[{"id":"1398093167286554755","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"*The End*","timestamp":"2025-07-25T00:03:06.396000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":206,"userName":"Storyteller"},{"id":"1398093070645592256","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He doesn't know. He doesn't know that the datapad she holds contains the truth of his family's legacy, a secret that could destroy them. He doesn't know that the real prize wasn't just glory, but a map that could change the galaxy. Iyola Kett has done it. She found the Sunken Star. But as the Stardust Seeker jumps to hyperspace, leaving the jungle moon of Xylos far behind, she realizes the chase she loved so much is over, and a far more dangerous game has just begun.","timestamp":"2025-07-25T00:02:43.355000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":204,"userName":"Storyteller"},{"id":"1398093041780396032","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He looks at Iyola, his usual arrogance completely gone. \"My father will… compensate you for the loss of your ship's pod. And for my rescue.\" He pauses, struggling with the words. \"What you did back there… after I… Thank you, Iyola.\"","timestamp":"2025-07-25T00:02:36.473000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":202,"userName":"Hextor Ambur"},{"id":"1398093039490175177","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The repulsor sled screams through the jungle, a high-tech blur against the primeval landscape. Iyola fights the controls, weaving between colossal trees as the enraged hisses of the predators follow her. The smoke from her fire is a disorienting gray wall, and she navigates almost entirely by instinct, aiming for the dark shape of the wreck.\nShe sees it—the shattered viewport, a gaping maw in the ship's command deck. She pushes the accelerator, intending to punch through cleanly. But the smoke is too thick; her angle is slightly off. Instead of a clean entry, the sled slams into the lower frame of the viewport with a sickening crunch of metal. The sled is thrown sideways, careening into the bridge and coming to a grinding halt just meters from where a stunned Hextor is sitting.\nThe front of the sled is a crumpled mess, and the repulsorlift engine is sputtering violently. But she made it. In the chaotic aftermath, she manages to haul Hextor onto the back of the sled. While he groans in pain, she works frantically, sparks flying from her multitool as she bypasses fried circuits and reroutes power to the damaged engine. It's ugly, but it works.\nWith a final, protesting shudder, the sled lifts off. They fly out of the ancient wreck, leaving the enraged predators and the ghost of the Sunken Star behind.\nHours later, in the quiet of the Stardust Seeker's medbay, a new quiet hangs between them. Caz, after a flurry of worried questions, has left them alone. Hextor's leg is now properly, if temporarily, stabilized in a medical brace.","timestamp":"2025-07-25T00:02:35.927000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":201,"userName":"Storyteller"},{"id":"1397601775569342554","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor's datapad is almost laughably simple. The home screen is a large, gaudy icon of the Ambur family crest. Tapping it brings up a single, oversized button labeled 'SLED OPERATIONS'. A moment later, she has full access. It seems Hextor's security priorities are as lacking as his survival skills.\n\nShe sends the command. The repulsor sled hums to life, its running lights cutting through the gloom of the mushroom grove. With a smooth, hydraulic hiss, the rear loading ramp lowers to the ground, inviting her aboard.\n\nShe vaults into the pilot's seat, the synth-leather cool against her hands. The controls are responsive, the engine purring with power. Now comes the hard part. She has to pilot this thing back through the jungle, through the smoke and the predators, and perform a maneuver that is equal parts insane and brilliant: a controlled crash through the shattered forward viewport of the Sunken Star to get to Hextor.\n\nIt is the most difficult piloting challenge she has ever faced. Everything comes down to this single, desperate flight.","timestamp":"2025-07-23T15:30:29.481000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":199,"userName":"Storyteller"},{"id":"1396987545883246722","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Of course Hextor’s hoversled is brand-new.  It’s practically decorative.  But Iyola’s life depends on it actually functioning. \n\nFortunately, Hextor had handed over his datapad, and he wasn’t a very smart guy.  *So this sled must be simple to operate - right?  *\n\nFirst things first.  She needed to get the ramp down.  Then she’d figure out on the fly how to steer this thing back to the Venture.","timestamp":"2025-07-21T22:49:45.712000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":197,"userName":"Iyola Kett"},{"id":"1396942846891659325","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She doesn't hesitate. Plunging into the thick, black smoke, Iyola runs. The world becomes a blind, choking chaos of swirling ash and shadow. The heat from the fire is intense on her left, and the muffled, enraged hisses of the predators are a terrifying chorus behind her. She runs on pure instinct and adrenaline, her legs pumping, her lungs burning, pushing through the unnatural twilight.\nJust as her breath is about to give out, she bursts through the edge of the smoke cloud and stumbles into a quiet grove. The air here is clear, and the clearing is illuminated by the soft, ethereal glow of a cluster of tall, blue-capped mushrooms. And there, parked neatly between them, is Hextor's repulsor sled.\nIt's a sleek, expensive-looking cargo sled, far fancier than it needs to be. She pulls out the silver datapad he gave her. The sled's ramp is sealed, and its engines are cold. She needs to interface with the sled's systems to get it powered up and ready to go before the smoke screen vanishes and the predators find her again.","timestamp":"2025-07-21T19:52:08.642000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":195,"userName":"Storyteller"},{"id":"1396867319371661517","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The fire takes hold with a ferocious intensity, far faster than she could have hoped. The ancient, dried materials of the wreck, combined with the leaking lubricant, create a thick, acrid black smoke that billows out from the ship, forming a dense, roiling curtain between the wreck and the jungle. The flames roar, casting a flickering, hellish light that dances with the steady, silver pulse of the power core.\n\nThe predators react instantly. The lead creature, which had been poised to attack, rears back with an enraged hiss, its six red eyes glowing with agitation through the smoke. The others in the pack break formation, moving away from the heat and the choking fumes, their confident patrol now a disorganized mess. They are confused, wary, and completely distracted by the sudden inferno.\n\nThis is it. Her gambit paid off, creating the perfect cover. The path to the grove of blue-capped mushrooms is now hidden behind a wall of smoke. It's time to run.","timestamp":"2025-07-21T14:52:01.478000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":193,"userName":"Storyteller"},{"id":"1396673486558073033","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"And it works. The flames start licking at the dry leaves and dead plant growth almost immediately, like they’ve been waiting for her. Even better, when the flames hit the dried-up durafoam, the burning materials emit acrid clouds of smoke, obscuring the tree line.    *If the predators also use scent for tracking, that should throw them off as well.  *\n\nThis is as much camouflage and distraction as she can hope for.  Steeling herself, Iyola makes a run for the hoversled.","timestamp":"2025-07-21T02:01:48.134000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":191,"userName":"Iyola Kett"},{"id":"1396615831357755432","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola’s eyes settle on a long pile of debris at the end of the treeline around the crash site..  It’s not all metal; much of it appears to be dried-up gobs of durafoam insulation, dry vines, weird corkscrew-shaped dead leaves, and bits of what might be desiccated lubricant. Perfect tinder and kindling for a large blaze.\n\n She clutches her fire rod.  The impromptu fuel should go up quickly, though she won’t have much time to set the fire before the panthers swing around from their deadly patrol.  \n\nIyola watches the panther circling the perimeter of the clearing.  When she thinks it’s at the further point, she emerges and slinks over to the pile of debris.  Pulling out the fire rod and pointing the active end away from her,  she twists it twice front and back, combining the chemicals inside. A hot green flame immediately springs from the end.  She runs the rod along the dried tinder, increasing the surface area of the fire as much as she can.  \n\nHer muscles tense. Once it goes up, she needs to move to the sled.   She just hopes it's enough.","timestamp":"2025-07-20T22:12:42.063000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":189,"userName":"Iyola Kett"},{"id":"1396600246003306637","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The failed plan hangs in the air, a testament to the predators' cunning. From her vantage point in the breach, Iyola assesses her remaining, more desperate, options.\nAbove, the immense jungle canopy offers a potential, if treacherous, highway. The lower branches of the nearest giant tree are just within reach of a daring leap from the ship's hull, and from there, a network of thick limbs stretches out into the jungle. However, the canopy is not continuous; there are wide, dark gaps between the trees that would require dangerous, long leaps high above the jungle floor.\nNear the wreck, the ground is littered with flammable debris from the crash—brittle insulation, patches of dried lubricant, and ancient, tinder-dry vines clinging to the hull. The surrounding jungle is damp, but a well-placed fire using this debris could create a wall of smoke and flame, a potent distraction if she can get it burning hot and fast enough.\nAnd then there is the direct path. One hundred meters of open, root-strewn ground between the wreck and the grove of blue mushrooms. It's a straight shot, but the predators are fast, and she would be completely exposed the entire way. It would be a pure race for survival.\nHer hand rests on the grip of her blaster. It feels heavy, a final, bloody solution to a problem she'd rather outwit.","timestamp":"2025-07-20T21:10:46.225000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":187,"userName":"Storyteller"},{"id":"1396594214833491988","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola sighs as she puts back her electrobinoculars. She’s starting to really worry. *These beasts are smart, too smart.  A lot smarter than a lot of people she knows, actually.  Maybe even smarter than her.*  She wonders if in some way they’re like her - they don’t actually need to take her down, maybe they’re not even hungry, they just like the challenge.\n\n*Well, sympathy for the panthers was getting her exactly nowhere.*\n\nShe looked up toward the trees.  It might be possible to do a canopy scramble, but she wasn’t sure if the cover reached far enough. Still, she was a strong climber, and that would temporarily keep her out of reach of the predators.\n\nShe had her fire rod. These creatures were attracted by sound and noise, but most wild animals were scared of fire. If there was anything dry here that she could set aflame, she might be able to get the beasts to shy away from that area, and that might be just enough of a distraction to get through to the sled. \n\nShe could do a mad dash, timing the patterns of the panthers.  It was a long run.  It was doable, but risky.  Not that the other options weren’t.\n\nAnd if nothing else - she had her blaster.  She did not like having to use it, but something there weren’t other options.","timestamp":"2025-07-20T20:46:48.282000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":185,"userName":"Iyola Kett"},{"id":"1396127418007162950","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola takes Hextor's datapad, her mind already racing. She peers through the jagged breach in the hull, studying the clearing below. The predators move with a chilling efficiency, their patrol routes overlapping. One circles the wreck, another watches the jungle's edge, while a third remains poised near the main entrance. They are not mindless beasts; they are a coordinated pack of hunters.\nShe tries to plot a course in her mind, tracing a path from shadow to shadow, from one patch of dense foliage to the next. But every route she conceives leads to a dead end or crosses an open patch of ground patrolled by those glowing red eyes. The jungle, usually her ally, offers no safe passage. There are no gaps in their perimeter. No blind spots she can exploit.\nHer careful plan to sneak to the sled is impossible. The pack has the wreck completely locked down. Any attempt to reach the blue-capped mushrooms will be a direct, desperate sprint through a field of waiting predators.","timestamp":"2025-07-19T13:51:55.246000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":183,"userName":"Storyteller"},{"id":"1394855567088029789","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"A new plan, wild and audacious, sparks in Iyola's mind. It's a crazy long shot, but it's better than waiting here to die. Before she can do anything, she first has to get out of the wreck and across a hundred meters of jungle without being seen.\n\nShe creeps back to the main breach, peering out into the clearing. The pack of predators is still there, circling the massive ship, their red eyes scanning the hull for any sign of movement. They are hunting, patient and alert. Getting to the sled means navigating through their territory. She needs to find the perfect exit point and the quietest path, using the terrain and the shadows to her advantage.","timestamp":"2025-07-16T01:38:02.357000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":181,"userName":"Storyteller"},{"id":"1394855565234274445","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Outside,\"** he rasps. **\"Northeast of here. I parked it… near a grove of those tall, blue-capped mushrooms. The ramp… it's keyed to my datapad.\"** He fumbles at his belt, producing a sleek, silver datapad and holding it out to her.","timestamp":"2025-07-16T01:38:01.915000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":180,"userName":"Hextor Ambur"},{"id":"1394855562323300472","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor looks up, confused by her sudden shift in tone, but her confidence seems to bolster him slightly. He points a trembling finger in the general direction of the bridge.","timestamp":"2025-07-16T01:38:01.221000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":179,"userName":"Storyteller"},{"id":"1394847064466395287","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**Hextor! It’s OK.  It’s going to be OK.  That kit would have probably made things worse.  Don’t worry, we’ll do something else.” ** She tried not to look at his injured leg too closely.  Her mother would have been so embarrassed. \n \nHer mind whirled, thinking of ways to get them both out of here. She listened for the creatures.  She assumed they were still outside this door; would they ever just leave?  *This wasn’t her lucky day, that was for sure.* But there would always be a next plan.\n\nHextor wouldn’t be able to do more than stagger, and she didn’t want to risk another medical intervention.  But his speeder was outside.  If she could get to the speeder and drive it through the viewing panel, she could put him on it and make their escape.\n\n**“Remind me where your speeder is, again?”  **","timestamp":"2025-07-16T01:04:15.174000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":177,"userName":"Iyola Kett"},{"id":"1394816205860245665","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor, who had been bracing for the pain of the treatment, looks down at the wasted supplies and then back at her, his brief flicker of hope extinguished. A low, despairing groan escapes his lips.","timestamp":"2025-07-15T23:01:37.909000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":175,"userName":"Hextor Ambur"},{"id":"1394816203784060932","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She kneels, laying out the strange, antique instruments on a relatively clean patch of the deck. She tries to apply the logic her mother, the doctor, would use, but the tools are all wrong. The synthflesh applicator feels heavy and unbalanced in her hand, its activation stud in an awkward position.\n\nShe places the nozzle against a deep gash on Hextor’s calf and presses the stud. Instead of the gentle hiss of expanding medical foam, the ancient device gives a violent shudder and the canister ruptures. A thick, shimmering paste sprays out sideways, splattering uselessly against the durasteel wall. In her haste to control the malfunctioning applicator, she knocks the small, shimmering vial of analgesic off the deck. It shatters with a tiny, heartbreaking crash, the priceless painkiller soaking into a thousand years of dust.","timestamp":"2025-07-15T23:01:37.414000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":174,"userName":"Storyteller"},{"id":"1394770099864600616","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola opens the ancient medpac. Inside, nestled in sterile blue foam, are tools that are both familiar and alien. There's a vial of shimmering analgesic fluid and a bulky auto-suture, but the synthflesh applicator looks more like a primitive caulking gun, and the bone-setter is a heavy, intimidating-looking clamp. The labels are in the same archaic script she saw on the bridge. The equipment is preserved, but using it correctly on such a severe injury will be a challenge.\n\nApplying a thousand-year-old solution to a fresh wound is a gamble, but it's the only one they have.","timestamp":"2025-07-15T19:58:25.383000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":172,"userName":"Storyteller"},{"id":"1394770096894902496","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor stares at her, his mouth slightly agape. He seems genuinely stunned by her words, by the raw honesty and unexpected empathy. For a moment, he doesn't seem to register the pain. He just looks at her, and a single, frustrated tear traces a path through the grime on his cheek. He nods slowly, then grits his teeth and, with a sharp intake of breath, straightens his mangled leg out on the deck.","timestamp":"2025-07-15T19:58:24.675000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":171,"userName":"Hextor Ambur"},{"id":"1394480634751094834","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola felt something she had never expected to feel for Hextor Ambur - real sympathy.  \n\nShe pulled out the medkit and showed it to him.  **  “Hextor, listen to me. First of all, I'm going to have to treat that leg, which means you need to straighten it out, and that is going to be very uncomfortable. **\n\n**“I understand where you’re coming from.  I was supposed to be a doctor or a professor, like the rest of my family.  And look at me.   **\n\n**\"Someone like your father - like my family - you’ll never be what they want you to be, no matter how hard you try.  So tell them to kriff off and do what makes you happy.  You almost died out here, Hextor, at least twice. Would it have been worth it? I don’t think so.  There’s something else you’re meant to do, so go and find it. OK, keep that leg as straight as possible.” **","timestamp":"2025-07-15T00:48:11.522000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":169,"userName":"Iyola Kett"},{"id":"1394455167054778369","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He looks down at his mangled leg and shakes his head, a pained grimace twisting his features. \"**No. I can't feel much of anything, which is probably for the worse.**\" He looks back up at her, his usual bravado completely gone, replaced with a weary, hollow look.\n\nHer question seems to drain the last bit of fight out of him. He leans his head back against the cold metal wall and lets out a long, shaky breath. \"**You're right. It's not my game.**\" He avoids her eyes, staring at the grime on the floor. \"**My father. He's… obsessed with the *Sunken Star*. Has been for years. He talks about it like it's some… ancestral quest. A matter of family honor to be the one to find it. He paid for the ship, the crew, the coordinates… all of it. This was supposed to be my chance to finally prove to him that I…**\" His voice trails off, the unspoken words '...wasn't a failure' hanging in the air. \"**Looks like I even failed at that.**\"","timestamp":"2025-07-14T23:06:59.550000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":167,"userName":"Hextor Ambur"},{"id":"1394450215959789668","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**Hey, no, I’m fine,”** says Iyola, doing her best to sound casual and unruffled.  **“Smooth as spidersilk, no problems at all. How’s the leg, Hextor? Can you move it?” ** \n\nShe has the medpac, of course. But before she applied it, she had to ask Hextor a question that had been on her mind since he had made his ludicrous appearance on Xylos.\n\n**“Hextor, I have to ask you.  Why did you actually come here?  Why drop the credits on Nar Shadda?  This isn’t your game.  Neither is Rianza, actually. So why risk it?”**","timestamp":"2025-07-14T22:47:19.117000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":165,"userName":"Iyola Kett"},{"id":"1394436290266529822","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"\"**You… you came back,**\" he breathes, the words a mixture of disbelief and profound relief. \"**You actually came back. I thought… I thought you were…**\" He can't finish the sentence, simply shaking his head in awe.","timestamp":"2025-07-14T21:51:58.973000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":163,"userName":"Hextor Ambur"},{"id":"1394436287775117332","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The furious shrieks of the trapped predator fade behind her as she moves down the corridor, replaced by a tense, ringing silence. Her glowrod beam dances ahead, illuminating the path back to the main corridor where she first found Hextor.\nShe reaches the blast door and peers through the narrow gap. On the other side, Hextor is slumped against the far wall, his face pale and slick with sweat in the strobing silver light of the power core. He has the makeshift crowbar across his lap, and his head snaps up as she approaches, his eyes wide.","timestamp":"2025-07-14T21:51:58.379000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":162,"userName":"Storyteller"},{"id":"1394431259484229662","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola gasps for air as the blast door shuts with an emphatic clang.  She staggers a bit down the hallway before leaning against the cool metal wall of the hallway, trying to catch her breath. Behind her, the beast shrieks in fury. *That was close!*\n\nHextor is ahead of her.  She hopes none of the  other beasts have made inside.  She vaguely wonders how she’ll be able to get out of the ship, but first things first.\n\nShe walks slowly along the corridor, listening for Hextor, or any signs of further invasion.","timestamp":"2025-07-14T21:31:59.541000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":160,"userName":"Iyola Kett"},{"id":"1394395725860966511","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Her fingers find the corroded lever and she throws her entire weight downwards. For a terrible second, nothing happens, the metal frozen solid by time. The predator, realizing its prey has slipped past, lets out an enraged shriek and tries to scramble back out of the medbay.\n\nThen, with a groan of tortured metal, the lever gives way. The heavy blast door slides down from the ceiling with incredible speed, a slab of durasteel meant to contain catastrophic medical emergencies. It slams into the floor with a deafening **BOOM** that shakes the entire corridor, sealing the medbay shut just as the creature’s snout lunges for the gap. A shower of sparks rains down as one of its claws scrapes uselessly against the sealed door.\n\nA cacophony of furious, inhuman shrieks and the heavy thud of the creature throwing itself against the inside of the door erupts from the medbay. But the door holds. The creature is trapped.\n\nSilence returns to the narrow maintenance tunnel. She is alone again. The path ahead, leading back to Hextor, is now clear.","timestamp":"2025-07-14T19:10:47.665000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":158,"userName":"Storyteller"},{"id":"1393774614710190282","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She backs away slowly, her glowrod beam held steady on the creature. The predator mirrors her movement, slinking down the narrow tunnel, its six red eyes never leaving her. It's hunting, enjoying the chase, confident in the close confines of the shaft. The scraping of its claws on the metal grate is the only sound besides her own heartbeat.\n\nShe reaches the junction, the dark opening to the medbay just over her shoulder. This is her chance. She has to bait the creature into the room and get the door sealed before it can react.\n\nShe takes a deep breath, then darts into the medbay, swinging her glowrod in a wide arc to illuminate the room and make herself as obvious a target as possible. The predator takes the bait. With a guttural roar, it lunges after her into the room. Its claws tear at the floor where she was standing as she dives past the doorway. Her hand gropes for the door's manual release lever—a heavy, corroded bar recessed into the wall.","timestamp":"2025-07-13T02:02:43.227000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":156,"userName":"Storyteller"},{"id":"1393639806080385165","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett 25/25 HP 0 CT | 7 FP","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The signal boost search is a fool’s errand.  But as she turns to leave, she finds the badge of the heroic Captain Jax. It feels cool and heavy in her hand.  She takes it.\n\nAs she begins the walk back to Hextor - and soon, Caz and the Seeker - Iyola ponders what to do with the information she’s received.  She tucks the ancient medpac into one of her larger jacket pockets.\n\nThere were two big decisions - what to do with the navigation data, and whether to reveal the historic perfidy of the Ambur Fleet.  She thought of the two men waiting for her -  *Hextor, wounded, in pain, hoping against hope that she’d be true to her word, and Caz, waiting for a signal to somehow make it through the treacherous clouds of Xylos.  *\n\nHer musing was swiftly and unpleasantly interrupted by the sound of claws on metal grating, and an angry-sounding hiss. It was one of those panther-things, and it had made its way inside the *Sunken Star*.  Iyola would be impressed if she wasn’t so terrified. \n\nHer mind raced through her options.  The creatures were hardly scared by light or sound   - they were attracted by it.  *She’d have to lure it away. * Her guess was that it wouldn’t be quite as fast in the artificial corridors of the ship.  Lure it inside a room, seal it away - that would be her first option. If that didn’t work - she’d have to run back to the bridge and go through the broken panel window, though that would make it more difficult to rescue Hextor. \n\nWIth that in mind, she backtracked toward the junction she had noticed earlier.","timestamp":"2025-07-12T17:07:02.345000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":154,"userName":"Iyola Kett 25/25 HP 0 CT | 7 FP"},{"id":"1392482658604421160","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The journey back through the maintenance tunnel is tense. The silence presses in, a stark contrast to the chaos of the last hour. Her glowrod cuts a solitary path through the oppressive darkness. As she retraces her steps, her beam illuminates a junction she’d missed in her haste—a perpendicular corridor with a faded plate that reads MEDBAY.\n\nDrawn by a mix of morbid curiosity and practicality, she takes a quick look inside. The room is a scene of quiet tragedy. Skeletal remains in tattered uniforms are slumped over consoles and on tilting medical berths. Amidst the dusty, archaic equipment, she spots a small, sealed durasteel case on a shelf. Prying it open, she finds a pre-Republic medpac, its contents remarkably preserved. The injectable stims and synthflesh applicators look ancient, but their chemical indicators still glow with potency. It could be a great help for Hextor's leg.\n\nAs she steps back into the main tunnel, a sound from the direction she is heading—towards Hextor—freezes her in place. It's a low, wet, guttural hiss, followed by the sharp scrape of claws on the grated floor. It's close. One of the predators has somehow found its way into the maintenance shafts ahead of her.\n\nShe is caught. In front of her, a predator stalks the narrow, dark passage. Behind her is the long walk back to the bridge.","timestamp":"2025-07-09T12:28:56.888000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":152,"userName":"Storyteller"},{"id":"1392482155069837502","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The silence of the bridge is absolute now that the console is dark. Her datapad, heavy with its stolen secrets, is the only source of light. She sweeps her glowrod's beam across the command deck, searching for anything that might help her. The comms station is a ruin of shattered screens and fused circuits—nothing there could boost a signal across the system, let alone across the room.\n\nHer beam falls upon the captain's command chair. The uniform of the long-dead captain has mostly crumbled to dust, but something glints on the floor where his hand would have rested. She kneels and picks it up. It's a small, silver disc, tarnished with age but intricately engraved with the sigil of the Cularin Exploratory Fleet and the name JAX. It's a rank insignia, a personal effect from a man dead for a thousand years. It is the perfect souvenir. She slips it into her pocket.\n\nThe thought of Hextor waiting for her, helpless and injured, pulls at her. The glory, the history, the dangerous truth—all of it can wait. He trusted her to come back. With one last look at the silent, starlit bridge, she turns and steps back into the dark maintenance tunnel, her glowrod lighting the way back to the blast door, and back to her rival.","timestamp":"2025-07-09T12:26:56.836000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":150,"userName":"Storyteller"},{"id":"1392299870215344300","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola somberly watched the final log entry. Exploration wasn’t safe. She enjoyed the risk, but sometimes, your luck ran out.  *Not mine, though. Not yet.*\n\nShe has the path through the Maw.  If she was a smuggler, it could make her rich.  It could be a major asset to the Republic, or the Jedi, or the Exploration Corps.  But would they credit her for it?  She felt like the lothcat who’d caught the speeder.  *Most of the joy,* she mused, *was in the chase*. The rest was in the glory.\n\nMore disturbing was what she’d learned about the Ambur family concern.  She’d already known that Hextor was spoiled and shiftless; he’d never worked for anything in his life, and he was an idiot too. But now it made sense to her why he was here. He’d been sent here to get this data, to cover up the crimes his family had built their fortune on. And if the Ambur group knew that she’d seen the log, *she - and Caz -could be in real danger*.\n\nFirst things first.  Iyola looked around the bridge.  She wondered if there was anything still here that could boost a signal high enough to reach the *Stardust Seeker*. She’d also love to find some kind of souvenir to prove she was here. Then she’d make her way to Hextor.","timestamp":"2025-07-09T00:22:36.740000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":148,"userName":"Iyola Kett"},{"id":"1391955008878153809","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The datapad whirs, the progress bar filling rapidly as a torrent of ancient data flows from the ship’s memory core. As the files transfer, the main console flickers, displaying fragmented images and text from the final log entries.\n\nA grainy image of a middle-aged human captain, his face grim, appears on the screen. Below it, his final log entry scrolls past:\n\n*CAPTAIN'S LOG, FINAL ENTRY: We have done it. The rumors were true. A stable passage through the Crimson Maw. A route that will change the Republic forever. But we were not the only ones who knew. The Ambur Trade Fleet found us. They demanded the coordinates. When I refused, they opened fire. Our engines are crippled… our hull is breached. They are boarding. We will not let the route fall into their hands. I am initiating a controlled crash into the moon below and wiping the navi-computer… but the raw sensor data will remain in the logs. If anyone finds this… let the Republic know what was done here. Let them know the Amburs are traitors. May the Force forgive them. And us. Jax, out.*\n\nThe transfer completes with a soft chime. The console goes dark, its last duties finally fulfilled after a thousand years of silence.\n\nShe has it all. The complete, uncorrupted logs of the *Sunken Star*. The proof of her discovery. But she has so much more. She possesses the coordinates to a priceless hyperspace route and a secret that could shatter one of the Republic’s most powerful families—the family of the man she just saved, who is waiting for her, helpless, just a short distance away. The fame she craved is within her reach, but it is entangled with a truth far more dangerous and valuable than she could have ever imagined.","timestamp":"2025-07-08T01:32:15.390000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":146,"userName":"Storyteller"},{"id":"1391944029243052254","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"At the moment of her victory, Iyola was faced with an unexpected foe - a time-forgotten security subroutine. She muttered to herself.  She had a solid grasp of ancient scripts and iconography, but this program was ancient and borderline illegible.  She could try to  remove the panel with her multitool, have Caz take a look at it.  But that could break it irretrievably.\n  \n*I’ve come this far.*\n\nIyola watched the program scroll across the screen.  She started to see the same icon repeat - was that avoid?  Bypass?  \n\nShe tapped it, lightly, then when another line of script appeared, chose the option that seemed to contain the first word.  The screen froze, then blinked blue.  \n\nNothing else happened for a moment.  Then Iyola noticed a tiny switch near the input port that had begun to emit silvery-blue light.  She pressed it firmly.\n\nThe screen flashed again, and  her datapad whirred as the logs began to download.  She still had no idea what she had done, but soon the charts and logs would be hers.","timestamp":"2025-07-08T00:48:37.641000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":144,"userName":"Iyola Kett"},{"id":"1391461562677596231","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She places her datapad on the cool, dusty surface of the console. An interface port, surprisingly similar to modern standards, glows faintly as she connects her cable. The ancient system recognizes the connection, and the amber light on the console brightens. A stream of archaic text scrolls across her datapad's screen—a pre-Republic security protocol, elegant and complex.\n\nThe ship's log, the sensor data, the culmination of her life's work is right there, protected by a thousand-year-old digital ghost. Bypassing the encryption to transfer the massive dataset will be a delicate operation. One wrong command could corrupt the ancient files forever.","timestamp":"2025-07-06T16:51:28.648000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":142,"userName":"Storyteller"},{"id":"1391426639988002919","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The opening chime is one of the most beautiful sounds she’s ever heard.\n\nThe blast door recedes as if it was never there.  She steps onto the bridge, her boots disturbing a millennia of dust.  \n\nThe main nav is in the center of the room, as if waiting just  for her.  *This is what she’s here for.  This is her triumph.  * She’s the one to solve the mystery of the Sunken Star - and uncover future mysteries to explore. She pulls out her datapad to record the log and any other symbolism in this chamber.","timestamp":"2025-07-06T14:32:42.430000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":140,"userName":"Iyola Kett"},{"id":"1391218455973330954","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a soft click, she opens the lock's panel. The delicate, crystalline circuitry within is a beautiful, intricate latticework, completely alien to modern mechanics. Dust motes dance in her glowrod’s beam as she carefully bridges two connections with the tip of her multitool.\n\nFor a moment, nothing happens. Then, a soft, harmonious chime echoes through the tunnel as the ancient lock cycles open. With a hiss of depressurizing atmosphere, the massive blast door slides smoothly and silently into the wall.\n\nThe bridge of the *Sunken Star* is before her. It is a place of cathedral-like silence and eerie beauty. The forward viewscreen is shattered, revealing a breathtaking panorama of the Xylos jungle, its bioluminescent flora casting a soft, multi-colored glow into the command center. Starlight from the alien sky glimmers through the canopy. Dust hangs thick in the air, illuminated by her glowrod and the pulsing light from the distant, damaged power core. The command chairs are empty, their occupants long since turned to dust, their uniforms crumbling where they lay.\n\nAnd there, in the center of the room, is the main navigation and astrogation console. It is remarkably intact, its surface glowing with a faint, amber light. This is it. The ship's log, the sensor data, the last records of the *Sunken Star's* journey—the proof of her discovery—is within her grasp.","timestamp":"2025-07-06T00:45:27.493000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":138,"userName":"Storyteller"},{"id":"1391195180094197873","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The right-hand tunnel is long and straight. The dust is thick here, undisturbed for ages, and it rises in ghostly clouds around her feet as she moves. The low hum of the power core is a constant companion, vibrating up through the grated floor. Every few meters, she passes a junction box with the same ancient symbols, all confirming she's on the right path.\n\nAfter a steady five-minute walk, the tunnel ends abruptly. Her glowrod beam illuminates a heavy, armored blast door. This is it. A small, grimy plate next to the door reads **COMMAND BRIDGE** in the same archaic script as the symbols. The door is sealed tight, its electronic locking mechanism dark and lifeless. A thin seam along the edge of the lock's panel suggests it can be pried open, but the circuitry within will be ancient and delicate. Hot-wiring the lock to force the door open will require a steady hand and more than a little luck.","timestamp":"2025-07-05T23:12:58.091000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":136,"userName":"Storyteller"},{"id":"1390883705316184118","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola traces the symbols with her finger. It’s one thing to see them on a data-tape, and quite another to see it right here, on this wreck.  She’s looked at hundreds of old charts and wayfindings. These, she finally decides, must be from the Cularin expedition, over a thousand years earlier. She is the first person to touch this symbol in a millennium.  And now she sees what she must do.  The path to the data log is clear - she needs to go right.  And so she does, scraping along the tunnel, disturbing centuries-old dust as she did.","timestamp":"2025-07-05T02:35:16.717000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":134,"userName":"Iyola Kett"},{"id":"1390771368387153940","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She holds the glowrod steady, its beam focused on the strange, elegant symbols etched into the bulkhead. They are frustratingly familiar, shapes she's glimpsed in historical texts and on the crumbling ruins of other pre-Republic sites. She closes her eyes for a second, pushing aside the immediate adrenaline of the chase and delving into her memory, sifting through years of obscure lore and half-forgotten navigational charts.\nAnd then it clicks. It's a pictographic dialect used by the Cularin Exploratory Fleet, a short-lived but ambitious survey project from the very dawn of the Republic. She suddenly remembers reading a treatise on its unique navigational symbology.\nThe concentric circles on the left are not just a general sign for engineering; they are the specific sigil for the ship's gravitic drive and power core access. A dead end for her purposes. The branching pattern on the right, however, is the symbol for the command spine. It represents the flow of information from the ship’s primary sensors to the bridge.\nHer path is clear. The corridor to the right leads directly to the bridge, and to the prize she came here for.","timestamp":"2025-07-04T19:08:53.506000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":132,"userName":"Storyteller"},{"id":"1390728960433848441","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The glowrod springs to life with a familiar hiss, casting a bright, steady beam that cuts through the absolute darkness. It reveals a narrow, circular maintenance tunnel, barely wide enough for her to stand comfortably. The walls are a dense, claustrophobic web of thick, bundled cables and pipes coated in a fine layer of shimmering, crystalline dust. The air is cold, still, and smells of ancient, ozone-rich machinery.\n\nShe moves forward, her footsteps echoing softly on the grated floor. The silence is profound after the chaos on the hull. After about twenty meters, the tunnel ends in a T-junction, splitting left and right into identical passages. Above each opening, etched into the metal wall, is a series of complex, archaic symbols—a form of pre-Republic technical schematic she has only seen in datapads.\n\nOne set of symbols seems to depict a series of concentric circles, perhaps indicating the ship's core systems or engineering. The other shows a branching, tree-like pattern, possibly representing the command and control network. Deciphering the ancient script would tell her for certain which path leads to the bridge.","timestamp":"2025-07-04T16:20:22.662000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":130,"userName":"Storyteller"},{"id":"1390706891641978882","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She’s inside. The landing is hard, but it’s clean.\n\nHer heart is hammering so loudly in her chest she’s surprised it doesn’t make the walls vibrate.  It’s pitch dark in here but she has her a glowrod in one of her many pockets, and she pulls it out and activates it.\n\nShe squints ahead into the darkness. She can’t wait to see what else is inside this glorious ruin.","timestamp":"2025-07-04T14:52:41.052000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":128,"userName":"Iyola Kett"},{"id":"1390547493867094146","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a deafening screech of protesting metal, the wheel turns. A series of heavy locking bolts retract with loud, echoing **CLUNKS**, and the square hatch grinds open, revealing a dark, vertical shaft leading down into the ship's interior.\n\nThere's no time to be gentle. As the first predator's head, a nightmare of red eyes and needle-like teeth, appears over the edge of the hull, she swings her legs into the opening and drops down. She lands with a thud on the grated floor of a narrow maintenance tunnel, the air thick with the smell of stale, recycled air and ozone. Without hesitation, she reaches up, grabs the inner handle of the heavy hatch, and pulls it shut. The final **CLANG** of the hatch sealing plunges her into absolute darkness and silence, cutting off the enraged shriek of the creature outside.","timestamp":"2025-07-04T04:19:17.661000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":126,"userName":"Storyteller"},{"id":"1390547476980826132","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The desperate search pays off. Near the stern of the massive ship, half-hidden under a thick blanket of alien moss, her eyes catch it: a perfectly square outline in the hull. *An emergency maintenance hatch.* It’s flush with the ship's surface and lacks any external handle, but a recessed panel next to it suggests a manual release mechanism. It's her way in.\n\nAs she moves towards it, a series of deep, scraping sounds echo from below. She glances over the edge of the wreck and sees one of the panther-like creatures attempting to climb the hull, its claws finding purchase in the grooved metal and thick vines. It's clumsy, not built for climbing, but it is making slow, steady progress. It hasn't seen her yet, but it will soon. Time is running out.\n\nReaching the hatch, she pries at the recessed panel with her multitool. The panel groans and pops open, revealing a grimy, unlit manual crank wheel. The mechanism is frozen with centuries of disuse and corrosion. Turning it will require all of her strength.\n\nShe grips the frozen crank wheel, planting her feet firmly on the slick hull. With a grunt of exertion, she throws her entire weight into it. For a heart-stopping moment, it doesn't budge, rusted solid by centuries of exposure. The sound of claws scraping against metal grows louder, closer. She gives it one more desperate, powerful heave.","timestamp":"2025-07-04T04:19:13.635000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":124,"userName":"Storyteller"},{"id":"1390372117903577304","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The slick, moss-covered hull of the ship is treacherous under her boots. She moves carefully across the curved surface, using broken antennae and thick, woody vines as handholds. The jungle spreads out around the wreck, a sea of green under the moon's dim light. Below, the enraged shrieks of the predators have turned into determined, guttural clicks as they begin to test the walls of the ship, looking for a way up.\n\nIyola knows she doesn’t have much time. Her goal is the bridge, the ship’s nerve center, where the logs will be. Accessing it from the inside is impossible with the pack on her heels. There has to be another way in from up here—an emergency escape hatch, a dorsal cargo door, or even just a section of hull weakened by the crash centuries ago.\n\nHer eyes scan every surface, every shadow, looking for the tell-tale straight lines of a sealed hatch or the dark void of an undocumented breach in the ancient vessel's skin.","timestamp":"2025-07-03T16:42:24.773000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":122,"userName":"Storyteller"},{"id":"1390161495765028976","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The panthers are fast - really fast.  But Iyola is desperate, and she practically levitates through that hole.  Once again, her trusty ascension gun proves true. \n\nShe can hear the predators squealing with anger below her.  Let them.  *If Hextor couldn’t get through this hole, there’s no way a giant panther-beast could.  *\n\nHer mission now is to find another way into the ship.  She knows roughly where the door to the inner chamber of the ship lies; she just has to get beyond it.  \n\nIyola thinks of Caz.  She knows he’s worrying; *he can’t help himself. * The thought of him makes her smile a bit, despite everything.  \n\nShe picks her way down the hull, looking for a way inside before the panthers figure out how to scale the walls of the Sunken Star.","timestamp":"2025-07-03T02:45:28.542000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":120,"userName":"Iyola Kett"},{"id":"1390149679802749011","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"A surge of adrenaline, a whisper of the Force, floods through her. As the predator lunges, its claws extended, Iyola pulls her legs up tight against her body. The creature's razor-sharp talons scrape against the heel of her boot with a screech of metal on keratin, but find no purchase. The winch doesn't falter, pulling her through the jagged breach in the ceiling and out into the humid, open air.\n\nShe lands with a solid thud on the curved, moss-covered hull of the *Sunken Star*. Below her, the frustrated shrieks of the predators echo up from inside the wreck. The chase isn't over. She can hear them scrambling, clawing at the walls, already looking for another way out.\n\nThe top of the ancient ship is a landscape of its own, a graveyard of broken antennae and buckled hull plates, all draped in thick, ancient vines. The pulsing silver light from the exposed power core casts moving shadows across the wreck and the surrounding jungle clearing. She has escaped the trap, but now she is exposed, with a pack of relentless hunters on her trail.","timestamp":"2025-07-03T01:58:31.397000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":118,"userName":"Storyteller"},{"id":"1389791553945600010","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola’s yell cuts through the corridor. The lead predator's head snaps towards her, its six eyes narrowing with malevolent intelligence. It answers her challenge with a high-pitched, chittering shriek that promises pain, and it breaks into a full, bounding charge.\n\nThe ascension gun fires with a loud *thwump*, the hook biting securely into the twisted metal at the edge of the ceiling breach. The winch engages with a powerful whine, yanking her feet from the floor just as the creature lunges. Its claws rake the air where she was standing a split second before. She is airborne, rocketing upwards towards the hole in the ceiling as the entire pack converges on the spot below her. Escaping their reach will require perfect timing and agility.","timestamp":"2025-07-02T02:15:27.539000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":116,"userName":"Storyteller"},{"id":"1389791550870917201","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor stares at her for a half-second, his expression a mixture of terror and utter astonishment. He gives a jerky, uncomprehending nod, then turns and begins to drag himself towards the narrow opening of the blast door as fast as his mangled leg will allow.","timestamp":"2025-07-02T02:15:26.806000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":115,"userName":"Hextor Ambur"},{"id":"1389746398936698981","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola mutters curses under her breath from multiple languages as she assesses the situation. *Of course Hextor would appear to kriff everything up.*  She could get through that door right now and she’d have a clear path to the data log.  *She’d just have the horrible death of another person on her conscience.  *\n\nIn her earlier survey of the room, she’d noticed a breach in what was now the ceiling of the ship.  Big enough for her to get through, but not big enough for Hextor. \n\n*Well, in for a dime, in for a datary.*\n\nShe grabs her ascension gun.  \n\n**“Hextor, go through the door, They won’t be able to reach you there.  Just - wait on the other side.  I’ll draw them away and join you in a minute.”  \n**\nShe turned to face the pack . \n\n**“Hey, you!” ** she yells at the lead panther-creature. **\n**\n\nShe fires the gun at the ceiling next to the hole. She should be able to swing through and get on the outside of the ship - then she can lead them off from there.","timestamp":"2025-07-01T23:16:01.746000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":113,"userName":"Iyola Kett"},{"id":"1389616960458981528","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The lead creature's roar galvanizes the pack. They surge forward, six-legged bodies moving with a terrifying, fluid grace over the wreckage. The sound of their claws scrabbling on the durasteel deck is a sharp, staccato rhythm of impending death.\n\nHextor, his face a sheet of white, scrambles to his feet, using the railing as a crude crutch. He hobbles after Iyola as she instinctively starts her sprint towards the blast door, his movements clumsy and agonizingly slow.\n\nA cold, hard calculation flashes through Iyola’s mind. She can make it. Her own speed and agility are more than a match for the cluttered terrain. She can dive through that gap and seal the door before the first creature reaches it. But as she glances back, she sees Hextor, already ten meters behind, stumbling desperately. She realizes with absolute certainty that if she saves herself, she is leaving him to die. The moment she disappears through that door, the pack will be on him.","timestamp":"2025-07-01T14:41:41.208000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":111,"userName":"Storyteller"},{"id":"1389612352890077295","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola’s eyes widen, taking in the entire situation at once. It’s not great. Then she sees it - a portal, just barely open enough for her, and probably Hextor.  He’s in bad shape, but the clicking and growling coming from the panthers should motivate him to move.  *It’s working for her, anyway. *\n\n**“Hextor,” **she says**, “we’re going through that gap.  Move as quickly as you can. We can close it behind us.  Go now!”**  She’s going to get there first, obviously, but she’ll wait for him as long as she can. Her blaster lies heavily at her side.","timestamp":"2025-07-01T14:23:22.678000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":109,"userName":"Iyola Kett"},{"id":"1389436073523810417","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The lead predator's assessment ends. It lowers its head and lets out a chuffing roar, a clear signal to the pack. They begin to advance down the corridor, their movements no longer cautious but fluid and purposeful. They are closing the distance.\n\nAs the creatures advance, Iyola’s desperate scan of the corridor pays off. There. Past a heap of sparking conduit and a buckled deck plate, she spots it. A section of the bulkhead is different—thicker, reinforced, with the unmistakable outline of a blast door. The door itself is wedged partially open, leaving a gap just wide enough for a person to squeeze through. On the wall next to it, a manual release lever—greasy and covered in dust—promises a way to seal the passage behind them.\n\nIt's a chance. A slim one, but better than none. The predators are less than thirty meters away now and breaking into a run.","timestamp":"2025-07-01T02:42:54.402000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":107,"userName":"Storyteller"},{"id":"1389392259933536256","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The clicking and hissing grow louder, closer. The lead predator now stands fully in the breach, its head low to the ground, sniffing the air. Its six crimson eyes are locked on them, and it bares a set of long, needle-like teeth. The rest of the pack is right behind it, a mass of shadows and glowing eyes. They aren't rushing in, but are cautiously, intelligently assessing the situation. The diversion is over.","timestamp":"2025-06-30T23:48:48.428000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":105,"userName":"Storyteller"},{"id":"1389392257672810579","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He takes the railing segment with a grateful nod, his knuckles white as he uses it to push himself into a sitting position. He lets out a pained hiss through his teeth. **\"Yes,\"** he says, his voice strained. **\"A repulsor sled. Back the way I came… maybe a hundred meters. But there's no way… I can't…\"** His voice trails off as his eyes fix on the corridor entrance.","timestamp":"2025-06-30T23:48:47.889000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":104,"userName":"Hextor Ambur"},{"id":"1389387112532676609","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola scoffs at Hextor.**  “A Nar Shadda information broker.  Ridiculous.  You’re lucky they didn’t sell you directions to a rancor fighting pit.”**   She shakes her head and turns her attention to the beam manuever.  \n\nAnd it works  Hextor manages to squirm away from the durasteel column before Iyola’s forced to drop it again.  The resulting noise resonates throughout the ship -  Iyola can feel the vibrations through the soles of her boots. No doubt that will get the attention of those six-eyed panther-things too. *They have to move, and quickly.  Or at least move.  *\n\n**“We’ve got to go, Hextor.  Come on.”**  She looks down at him, then hands him the crowbar. **“Lean on this.” ** She looks around her- if she could find a way forward with a door, or an aperture small enough that they could fit but not the panther-things, they might have an escape route. \n\n*Or was there a way Hextor alone could escape?***  “Do you have a vehicle with you?” **she asked him.  If he still had his speeder and was able to get to it, he might be able to lure them off with noise, but still make his escape. * He owed her that much.\n*","timestamp":"2025-06-30T23:28:21.192000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":102,"userName":"Iyola Kett"},{"id":"1389293351634866277","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola gives the dropped blaster a sharp kick, sending it skittering across the deck far out of his reach. She jams the end of the railing segment deep under the edge of the massive beam, finding a solid fulcrum point in the buckled deck plating. **\"Right,\"** she says, her voice tight with effort. **\"Now!\"**\n\nShe puts her entire body into it, muscles straining. For a moment, nothing happens. Then, with a deep, groaning screech of tortured metal, the massive beam begins to lift. It rises slowly, just a few centimeters, but it's enough. Hextor, seeing his chance, scrambles backward, dragging his mangled leg out from under the immense weight with a choked cry of pain. The moment he is clear, Iyola lets the beam drop with a deafening **CLANG** that echoes through the entire shipwreck.\n\nHextor lies on the deck, panting and cradling his leg. He's free, but he's not going anywhere on his own. The loud clang from the dropped beam causes the hissing and clicking of the predators down the hall to pause, as if their attention has been drawn back from the initial diversion. They have a few moments, at best.","timestamp":"2025-06-30T17:15:46.852000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":100,"userName":"Storyteller"},{"id":"1389293350070521916","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"I… I didn't *find* it,\"** he admits, his voice cracking. **\"I bought the coordinates. From a broker on Nar Shaddaa… Paid a fortune for an ‘exclusive’ tip.\"**","timestamp":"2025-06-30T17:15:46.479000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":99,"userName":"Hextor Ambur"},{"id":"1389293345066455173","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor’s eyes widen as she hefts the makeshift crowbar. He nods weakly and with a clatter, his hold-out blaster drops from his trembling fingers onto the deck. As she asks the question, a grimace of pain and humiliation flashes across his face.","timestamp":"2025-06-30T17:15:45.286000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":98,"userName":"Storyteller"},{"id":"1389276943572013069","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**I don’t actually have to help you,**” Iyola said smugly.  She tugged on the end of the durasteel railing segment, which came loose after some twisting. It was ideal.  It was even slightly curved. ** “But I will, just because I’m that awesome.”  **And because she wasn’t a monster.  *She wasn’t going to leave someone to die, even if it was someone like Hextor.*\n\nShe leaned over Hextor, looking at the placement of the beam.  His leg looked broken, but it didn’t appear to her that it had been punctured at all.  That was good, as he was unlikely to bleed out if she moved the heavy piece of metal away off him.\n\n**“So I’m going to lift this beam off you” **she said with confidence.  It occurred to her that she might look intimidating at his angle, looming over him with a metal rod.  The notion amused her, and a smile flashed across her face.  **“Be ready to move as quickly to your right as possible when I tell you to. You won’t have long. Oh, and drop the blaster first, please. Don’t want it to go off accidentally.” **  When he did, she planned to kick it out of the way.\n\nAs she assessed the durasteel for the best fulcrum point, improvised crowbar in hand, she asked Hextor casually, **“How’d you find this place, anyway?”**  Selecting her spot, she jammed the lever in place. **\"Anyway, get ready to move right - now!\"**","timestamp":"2025-06-30T16:10:34.865000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":96,"userName":"Iyola Kett"},{"id":"1389214172662726777","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"His words confirm her suspicion. She's his only hope. Her eyes leave Hextor and begin to scan the debris-strewn corridor. With the predators momentarily distracted, the strobing silver light of the power core seems less menacing and more illuminating. Her gaze sweeps over the chaotic jumble of sheared bulkhead panels and shattered consoles. Then she sees it. Partially hidden beneath a tangle of thick power cables is a long, straight section of reinforced durasteel pipe, about a meter in length, that was once part of the crew railing. It's perfect. An improvised crowbar.","timestamp":"2025-06-30T12:01:09.114000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":94,"userName":"Storyteller"},{"id":"1389214170213253291","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Hextor Ambur","avatar":"6cdf37bc666a6108cc6057d1db4d8eea","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He looks up at her, his face a mask of pain and disbelief. He swallows hard, trying to compose himself, but it is a failing effort. \"**Gone,**\" he rasps, his voice barely a whisper. \"**They... they ran. The moment those things showed up... they just ran.**\" He looks away, a flicker of his old pride turning into shame. \"**Please... you have to help me.**\"","timestamp":"2025-06-30T12:01:08.530000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":93,"userName":"Hextor Ambur"},{"id":"1389068013902499882","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola watched in satisfaction as her diversion worked.  The gigantic predator skittered away, giving her - and Hextor - some breathing room.\n\nShe looked down at him.\n\n**“Hi,**” she said.  **“Fancy meeting you here.  Got anyone else with you?”  **She knew, of course, that he’d had two hirelings with him earlier.  If they were around, she was running for the data log, and they could free their boss on their own time. She watched for his response carefully.\n\nShe wondered if there was anything nearby that could serve as a crowbar.  If she had one, she might be able to leverage the beam off Hextor.  He still wouldn’t be able to move much, of course.  *And if the predators came back, well, she wouldn’t need to outrun them; she’d just need to be able to outrun Hextor*.","timestamp":"2025-06-30T02:20:22.150000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":91,"userName":"Iyola Kett"},{"id":"1388974799065190461","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor flinches as Iyola leans over him, her multitool whirring to life. His eyes dart from her focused expression to the hissing predators, then back again, his usual arrogance completely replaced by a primal fear.\n\nShe finds the main power conduit for the wrecked cargo-lifter, a thick bundle of wires still faintly glowing with residual energy. The plan is reckless, a desperate gambit born from equal parts audacity and necessity. She begins to splice the wires, her fingers moving quickly, trying to create a contained short-circuit that will overload the hydraulic system. For a second, the whine of the machinery sounds unstable, threatening to fizzle out.\n\nBut then the connection catches. With a surge of stolen energy, the power conduit flares brilliantly. The current races through the system, and a hydraulic piston located twenty meters down the corridor, far from them, instantly over-pressurizes.\n\nWith a deafening **BANG!**, the piston explodes, sending a shower of sparks and shrapnel against the far wall of the corridor. The concussive force of the blast echoes through the metal hull of the ship like a thunderclap.\n\nThe lead predator, which had been coiled to spring, flattens itself against the deck, startled by the violent noise. Its six red eyes swivel away from Hextor and fixate on the smoking, sparking ruin of the exploded piston down the hall. It lets out a questioning hiss to its packmates, their attention now fully diverted to the source of the loud, unexpected explosion. They begin to cautiously creep towards it, abandoning their cornered prey for this new, more interesting development.\n\nThe diversion worked. For now. Hextor lets out a shaky breath he didn't realize he was holding, but the massive durasteel beam remains firmly planted on his crushed leg.","timestamp":"2025-06-29T20:09:58.001000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":89,"userName":"Storyteller"},{"id":"1388934798541586533","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor may be a dunce, but he appears to get her meaning.  It’s actually a little unsettling, seeing this swaggering dolt afraid and immobile, so desperate he’s willing to trust, well, her.\n\nShe looks over his positioning.  She’s not a trained doctor, unlike most of her family, but she knows enough. *It looks bad, really bad*.  For his sake, she hopes there’s some space between the beam and the limb, or he’ll likely lose that leg. * If her sister Peluna was here, she’d probably be setting up for an amputation right now. * Either way, she’s eager to get going, and whatever she needs to do, she needs to do it now.\n\nOptions.  She could try to lift the steel beam. It looked very heavy, though, and while she was pretty strong - strong enough to support her own weight, anyway - she wasn’t sure she’d be able to shift that massive beam at all, much less where it might land. \n\nThere were still dribs and drabs of power in the crippled hydraulic system.  She could repower it just for a minute - based on her experiences with the drones, that would certainly do something.  If she was lucky, it would both distract the panther-things and allow the beam to be moved. If she wasn’t - \n\n*She couldn’t make things worse, right? * Well time to find out.  Iyola grabbed her multitool and got to work.","timestamp":"2025-06-29T17:31:01.133000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":87,"userName":"Iyola Kett"},{"id":"1388706952842055905","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Hextor doesn't see her at first. His focus is entirely on the guttural clicks and hisses echoing from the breach in the hull, his knuckles white where he grips a useless hold-out blaster. When Iyola slips out of the shadows and raises a finger to her lips, he flinches violently, a strangled gasp escaping him. His eyes, wide with pain and terror, lock onto hers. There is no sign of his usual arrogance, only a raw, desperate plea for silence.\n\nShe gives him a sharp, single nod and turns her attention to his predicament. The support beam pinning his leg is immense, a solid block of durasteel bent and twisted by the crash. It looks far too heavy to lift. The beam, however, is entangled in a snarl of power conduits and what looks like the shattered remnants of a cargo-lifter's hydraulic system. A network of glowing blue energy lines still pulses weakly within the damaged machinery.\n\nHer mind races, weighing the options against the approaching clicks of the predators. She could put her back into it, try to leverage the beam just enough for him to pull free, a feat of pure strength. Or she could try something more delicate. That damaged hydraulic system is still connected to the ship's ancient, dying power core. A deliberate, targeted short-circuit—a quick, dangerous rewiring job with her multitool—could cause the hydraulics to violently over-pressurize. It would almost certainly create a loud, explosive bang, hopefully drawing the creatures away from the wreck, but it could also make the unstable wreckage shift unpredictably.","timestamp":"2025-06-29T02:25:38.485000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":85,"userName":"Storyteller"},{"id":"1388671473589293127","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The interior of the Sunken Star is jawdropping and strange.  Then Iyola encounters something even stranger - Hextor Ambur, in the flesh, in his ridiculous “explorer” uniform, trapped under a beam.  There’s no sign of his muscular hirelings; either they’ve abandoned him to his fate, or  they too fell prey to the dangers of  Xylos.  Speaking of which - she can see the panther-beasts approaching, their red eyes glowing in the dark.  They must be excellent trackers. \n\nShe could just leave Hextor to his fate.  That’s what he would most likely do if their situations were reversed. He'd provide an excellent distraction as she went to retrieve the ship data and log.  \n\nBut - she can’t bring herself to do that.  *She’s better than him, in every way.  Including this.  *\n\nShe sidles up to Hextor, raising a finger to her lips, indicating that he needs to be quiet.  She eyes the machinery trapping him, seeing if there’s a way she can lever it off him.  That would solve one problem, but there are so many more.","timestamp":"2025-06-29T00:04:39.572000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":83,"userName":"Iyola Kett"},{"id":"1388599270206083215","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The ancient metal of the hull feels cold and slick with moss beneath her fingertips as she approaches the gaping wound in the ship's side. The rhythmic hum from the power core is much louder here, a physical presence that presses in on her. The strobing silver light from within casts long, dancing shadows that make the clearing feel alive and unsettling.\n\nShe pulls herself up and through the jagged opening, her boots clanging on a tilted durasteel deck plate. The interior of the *Sunken Star* is a scene of utter devastation. Corridors twist at impossible angles, their walls covered in a lattice of ancient, dried vines. Wires and conduits hang like limp tentacles from the ceiling, and the air is thick with the dust of centuries and the sharp, metallic tang of the nearby power source.\n\nA groan echoes from deeper within the ship. It is not the sound of stressed metal, but of a being in pain. It's followed by a string of muttered curses.\n\nMoving cautiously, Iyola peers around the corner of a collapsed bulkhead. In the strobing silver light, she sees him. Hextor Ambur. Her rival is half-pinned beneath a massive, fallen support beam, his face pale with pain and fear, his expensive explorer's gear torn and covered in dust. One of his legs is trapped at an unnatural angle. He is helpless.\n\nFrom another breach in the hull further down the corridor, a series of guttural clicks and hisses can be heard, growing closer. Through the opening, she can see multiple pairs of glowing red eyes moving in the shadows outside. The predators have arrived, drawn by the pulsing energy of the core.\n\nShe remains unseen. The path to her right leads deeper into the ship, towards what must be the command deck and the captain's log—the proof she needs. Before her lies her rival, vulnerable and at the mercy of the approaching creatures.","timestamp":"2025-06-28T19:17:44.944000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":81,"userName":"Storyteller"},{"id":"1388533769694085312","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola stops and takes in the glorious sight of the Sunken Star for a moment.  It’s so much larger than she had imagined. The accounts are fragmentary - much like the vessel, it appears - and at times contradictory*. But she’s solved it.  She’s done it. She’s here.\n*\nShe watches for movement, but all she sees is the flickering of light and the slight sway of vines in the wind. No time like the present. Scraping the goo on her boots off on a nearby stone, she heads to the opening torn in the hull.  *She’ll be famous for this.  Everyone will know she’s the scout who found the Sunken Star. \n*","timestamp":"2025-06-28T14:57:28.405000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":79,"userName":"Iyola Kett"},{"id":"1388475193671946341","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She’s on the right path. The hum grows louder, the pulsing light more intense. She pushes through a final curtain of thick, hanging vines and steps into a large clearing. And stops, her breath catching in her throat.\n\nIt’s here. The *Sunken Star*. It's larger than the legends described, a massive, ancient vessel half-buried in the earth. Its hull is scarred by its atmospheric entry centuries ago, now draped in moss and thick vines. The source of the light and the hum is a massive, fractured crystalline structure visible through a gaping hole in the ship's midsection—the power core, still feebly alive after all this time. It casts a ghostly, strobing silver light over the entire clearing, making the shadows of the surrounding trees dance and twist.","timestamp":"2025-06-28T11:04:42.793000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":77,"userName":"Storyteller"},{"id":"1388475163707834408","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The glowrod ignites, casting a bright, clean light that battles against the oppressive mist. It doesn’t cut through the fog so much as it illuminates it, turning the swirling vapor into a brilliant, shifting wall of white around her. It gives her a clear view of her immediate surroundings but makes the world beyond a few meters even more mysterious. The slurping sound of the goo pulling at her boots is the only noise that accompanies her determined, plodding steps.\n\nAfter what feels like an eternity, the ground begins to firm up beneath her feet. The iridescent sludge gives way to damp, dark earth and tangled roots. The air here feels different, charged with a strange energy that makes the hairs on her arms stand on end. She’s climbing a gentle, wide slope now, leading out of the ravine's lowest point.\n\nThe pulsing silver light she saw from the clifftop is much brighter here, filtering through the high canopy in rhythmic waves. It’s accompanied by a low, resonant hum that seems to vibrate not just in the air, but deep in her teeth and bones. It’s a sound of immense, ancient power, barely contained. As she walks, her boot kicks something hard, something not made of rock or wood. She kneels and digs it out of the soft earth. It’s a piece of metal, pitted and corroded with age, but its lines are unmistakably manufactured. A few meters further, she finds another: a twisted shard of what might have been a viewport.","timestamp":"2025-06-28T11:04:35.649000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":75,"userName":"Storyteller"},{"id":"1388355159720988773","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She almost makes it down without incident, until the rope has a bad bounce. The synthleather jacket takes the worst of the collision, but she knows she’ll be a constellation of bruises in a few hours.  With a wince, she finally makes it down.  She has arrived.\n\n*But where is she? * The fog clings this close to the ground.  It might be some kind of swamp - a very shimmery swamp.  She’s standing in some kind of ooze that makes it hard to walk.  But walk she must. That’s what they taught her in her first week in the Expeditionary Corps  - *most of scouting is just putting one foot in front of the other and  not giving up.*  Of course they also taught her to record an incident holofile whenever she found anything marginally novel, and that part she completely ignored. \n\nShe takes out her glowrod.  She isn’t sure if it will cut through the mists, but it’s worth a try. She walks forward purposefully, or as much as she can, with this slurping goo on her boots.","timestamp":"2025-06-28T03:07:44.469000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":73,"userName":"Iyola Kett"},{"id":"1388347380377718784","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The rappel begins well. Iyola leans back into the void, the rope taut and secure in her gloved hands. The rough cliff face slides past as she expertly controls her descent, planting her boots to push off and avoid the worst of the slick, mossy patches. The world becomes a narrow vertical tunnel of grey rock and swirling white mist.\n\nAbout halfway down, the rope snags on a sharp outcropping above her. The sudden jolt throws off her rhythm. She tries to swing free, but the angle is wrong. Instead of a controlled descent, the final twenty meters become a clumsy, uncontrolled slide. Her boots scramble for purchase, and she collides hard with the rock wall more than once before her feet finally touch solid ground with a jarring thud.\n\nShe has arrived at the bottom. The air here is thick, heavy, and cool, carrying the smell of wet earth and decay. The mist is a dense, disorienting blanket, limiting visibility to only a few meters in any direction. The silence is profound, broken only by the slow, steady drip of water from unseen ledges above. Unfortunately, her landing spot is less than ideal. She finds herself standing ankle-deep in a pool of viscous, iridescent goo that bubbles faintly and clings to her boots with a disgusting sucking sound.","timestamp":"2025-06-28T02:36:49.729000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":71,"userName":"Storyteller"},{"id":"1388338187566317648","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Her anchor set, Iyola loops the rope around her chest, thigh, and shoulder, allowing her to control her downward movement as she rappels. It wasn’t comfortable, but it was effective.  She glances downward to see if she can peer through the mist and get a sense of the terrain beneath her, but there’s no choice but to keep going.  *That’s really the only choice she ever has. *\n\nShe starts to make her way down the cliff face.","timestamp":"2025-06-28T02:00:17.992000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":69,"userName":"Iyola Kett"},{"id":"1388333810403250296","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Leaning out from the cliff face, Iyola holds the heavy spike in one hand, her knuckles white. She taps it against the rock near the root, listening to the sound, feeling the vibrations through her arm. *There*. A subtle shift in the tone, a solid, dense sound that speaks of stable rock. With the practiced economy of motion of a seasoned pioneer, she places the point of the spike against the spot and brings the flat of her multitool down on it like a hammer.\n\nThe first blow rings out, sharp and loud in the quiet ravine. The second drives it deeper, and with a series of quick, powerful strikes, she sinks the durasteel spike deep into the rock until it is buried to the hilt. It holds firm. She gives it a hard, testing pull; it doesn't budge.\n\nWorking quickly, she loops the synthrope around the thick, gnarled root and through the eye of the spike, tying a series of complex, redundant knots that she could tie in her sleep. She gives the rope a final, sharp tug, satisfying herself that the anchor is secure. The free end of the rope uncoils and disappears into the swirling mist below. The makeshift anchor is set. Her way down is ready.","timestamp":"2025-06-28T01:42:54.395000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":67,"userName":"Storyteller"},{"id":"1388324682746433657","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**“Oof!”**  Iyola clings to the root, taking deep breaths until she finds her equilibrium, or as much as it can be found in this situation.  She finds a miniscule foothold, stabilizing herself a bit more, and takes a quick mental inventory.  Not hurt, except her pride, but this was a precarious perch indeed.\n\nThe root appears to be sturdy - it was holding her weight, in any case. She has an idea.  She’d probably lose her synthrope, but it would be worth it. If she could loop her rope around this root and secure it tightly enough, she could rappel down until she found a better climbing route, and at least reach the bottom of this ravine.  She was pretty sure she had a climbing spike in one of her pockets.","timestamp":"2025-06-28T01:06:38.192000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":65,"userName":"Iyola Kett"},{"id":"1388132809553612812","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a confident grin, Iyola begins her descent. The first few meters are easy, the rock solid under her gloves. She moves with the practiced grace of someone who has spent a lifetime on speeders and ice floes, finding handholds where none seem to exist. The mist from the ravine floor below curls around her boots, obscuring the bottom in an eerie white shroud.\n\nAbout ten meters down, she reaches for a large, promising-looking outcrop to shift her weight. The moment her fingers close around it, the rock crumbles into dust and pebbles, a section of the cliff face giving way beneath her. Her boots skate on slick, wet moss, and for a heart-stopping second, she is airborne.\n\nInstinct and sheer grit take over. Instead of plummeting into the mist, she twists, her free hand lashing out and catching a gnarled, thick root protruding from the rock wall. The impact wrenches her shoulder, and her body swings hard against the cliff face, the breath knocked out of her.\n\nShe hangs there, dangling from the root, her heart hammering against her ribs. The easy confidence of a moment ago is gone, replaced by the cold reality of the treacherous climb. She hasn't fallen, but she's lost her momentum and the path down looks even more hazardous from this new, precarious position.","timestamp":"2025-06-27T12:24:12.058000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":63,"userName":"Storyteller"},{"id":"1387969591547793418","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola immediately dismissed the notion of going upstream.  That could take hours, and she didn’t have hours.  Caz was no doubt fretting with the lack of comm contact, and he might do something foolish, like look for her early.  She needed to get to the Sunken Star, nab her prize, and get out. \n\nAccess via the overhead tree limbs a possibility - she wasn't adverse to swinging across. But she was entranced by the idea of taking the most direct approach - climbing the rock face. She tightened her gloves, tapped her lucky pebble, and prepared for the climb.  *Just watch a poser like Hextor try this! *","timestamp":"2025-06-27T01:35:37.853000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":61,"userName":"Iyola Kett"},{"id":"1387882361328242688","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The journey begins. For the first hour, the going is tough but manageable as she pushes her way through the thick, alien undergrowth. The air remains thick with the scent of ozone and strange blossoms. Finally, she breaks through a line of thick, fern-like plants and stops short, her boots sinking into the soft earth at the very edge of a precipice. Her path is blocked. A wide, deep ravine, at least sixty meters across, separates her from the gently sloping terrain that leads towards the mysterious light.\n\nHer eyes trace the lip of the chasm. It seems to stretch for kilometers in either direction, a formidable obstacle. Her scout's instincts tell her that the landscape might be more favorable further upstream where the ravine might narrow or a fallen giant of a tree might have formed a natural bridge, but searching for it would cost her precious time. Across the sixty-meter gap, the gnarled branches of the opposing trees look tantalizingly close, potential anchor points for her ascension gun, though discerning a truly solid one from this distance is difficult. And then there is the direct approach: the rock face itself, a treacherous, near-vertical wall of slick moss and crumbling ledges that a daring climber might just be able to descend into the mist-shrouded depths and back up the other side.","timestamp":"2025-06-26T19:49:00.548000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":59,"userName":"Storyteller"},{"id":"1387882339652337665","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Focusing the electrobinoculars on the northern disturbance, she can just make out the figures through the haze. Hextor is there, unmistakable in his ridiculously clean, custom explorer gear, directing two other individuals who look like hired muscle. They're loading equipment onto a large, battered-looking repulsor sled. They seem more like a heavy-handed survey team than nimble explorers and are definitely heading away from the strange light in the southeast.\n\nTurning her attention to the east, the canyon appears as a deep, jagged wound in the earth, its bottom lost in shadow. The panther-like creatures patrol the near rim, their movements efficient and predatory. They show no sign of leaving the rocky terrain of their territory, confirming her suspicion that giving the canyon a wide berth is her safest bet.\n\nAfter one last look toward the pulsing, silvery beacon to the southeast, she secures her gear. The descent is swift and easy, the ascension gun's winch lowering her smoothly back to the humid jungle floor.","timestamp":"2025-06-26T19:48:55.380000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":57,"userName":"Storyteller"},{"id":"1387794916981215272","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola lowered the electrobinoculars.  If she was right, the Sunken Star was to the southeast, near the river.  Or something interesting was, anyway.  \n\nShe raised the electrobinoculars again, narrowing the focus on the vehicle heading north to see if she could get a better count of how many beings were in Hextor’s group, and what sort of equipment he had.   He was heading away from what she thought was the site of the Sunken Star, which meant that either he didn’t know where it was, or he was looking for something else entirely.\n\nShe moved the beam over to the panther-creatures at the canyon.  They were gorgeous, and would probably devour her in nanoseconds.  She tried to get a sense of the surrounds and  structure of the canyon itself.  That would be one site to avoid.  *It didn’t appear that the Xylos-panthers ranged that far from their territory, but she was no xenobiologist. *\n\nShe took one long look at the silvery light near the river.  That was her next destination.  *She’d grab the nav data, then, well, then she’d figure out how to contact Caz.  First things first.* \n\nAs Iyola prepared to descend, she noticed one of the weirdest insects she’d ever seen clinging to  the sleeve of her jacket. It looked like a plump, dark purple  worm or caterpillar with twelve long legs and a string of luminous orange eyespots on its back.  \n\n**“Hey little friend,**” she said, coaxing it off onto a leaf, before heading down.","timestamp":"2025-06-26T14:01:32.191000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":55,"userName":"Iyola Kett"},{"id":"1387563927701032961","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The makeshift nest high in the canopy offers a breathtaking, vertiginous view. From here, the jungle basin stretches out before her like a vast, uncharted sea of green and blue. The thick, humid haze partially obscures the distant mountain ranges, but she can clearly see the winding path of a wide, muddy river and several deep, shadow-filled ravines that cut through the landscape. The air is filled with the cries of flying creatures and the ever-present hum of the moon's energy.\n\nShe raises the electrobinoculars to her eyes, the powerful lenses cutting through the haze. It doesn't take her long to find signs of Hextor. To the north, a wide, ugly scar is being carved through the jungle—a trail of snapped trees and churned-up earth, likely made by a repulsor sled or some other small vehicle. His team is moving fast and carelessly, not bothering to hide their path.\n\nSwinging the binoculars further east, towards a rocky, darker part of the basin, she spots movement. A pack of sleek, panther-like creatures with dark, chitinous plating on their backs and multiple pairs of glowing red eyes are patrolling a canyon rim. They move with a terrifying predatory grace, and they appear to be circling a specific territory.\n\nThen she sees it. Far to the southeast, in the direction of the river, is a subtle but distinct anomaly. While the rest of the jungle's bioluminescence glows with a soft, steady light, there is a section of the canopy, miles away, that seems to pulse with a rhythmic, unnatural silver-white light. The energy seems to be resonating with the flora itself, causing it to shimmer and strobe in a way that is both beautiful and deeply strange. It's a beacon, of a sort.\n\nFrom her perch, she now has a complete tactical overview: Hextor's loud and destructive path, a dangerous pack of predators to be avoided, and a mysterious energy source that could very well be the resting place of the *Sunken Star*.","timestamp":"2025-06-25T22:43:40.055000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":53,"userName":"Storyteller"},{"id":"1387546102785511598","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola has climbed the icy crags of Rhinnal in a windstorm - a rough-barked tree branch is no challenge at all.  As agile as a monkey-lizard,  she scrambles along the network of branches,  eventually finding a nest of sorts at the top of the canopy.  \n\nFrom here, she should be able to sight the trail of Hextor’s team, maybe even navigate around them and reach their destination before them.  \n\nIt was actually a little chilly up here.  She pulled out her electrobinoculars and surveyed the landscape in front of her, looking for her rivals.","timestamp":"2025-06-25T21:32:50.264000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":51,"userName":"Iyola Kett"},{"id":"1387510736292548681","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Her eyes scan the canopy above. The jungle of Xylos is a forest of giants. Trees wider than her pod is long soar into the humid haze, their upper branches creating a dense ceiling that blots out the sky. Many are draped in thick, pulsating vines or covered in slick, bioluminescent moss that glows with a soft blue-green light.\n\nShe selects her target: a colossal, gnarled giant whose bark seems rough enough to provide decent handholds if needed. It rises a good hundred meters above the jungle floor. Drawing her ascension gun, she aims for a thick, stable-looking limb high above. The grapple fires with a sharp *thwump*, the durasteel hook biting deep into the alien wood.\n\nThe powered winch engages, pulling her swiftly off the ground and up the immense trunk of the tree. The climb is dizzying, carrying her past strange, chittering creatures that peer out from holes in the bark and over wide, shelf-like fungi. The air grows thinner and cooler the higher she goes. Reaching the main canopy will require her to navigate the final, treacherous stretch of branches high above the jungle floor.","timestamp":"2025-06-25T19:12:18.235000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":49,"userName":"Storyteller"},{"id":"1387503839829037199","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola shook her head.  Reaching into one of the many pockets on her turquoise-colored synthleather jacket, she shifted her amaralite pebble from the right to the left side of her body.  Maybe this would turn her luck around, if the Petrusian superstitions had anything to them.\n\nShe assessed the ground ahead of her.  Hextor's team couldn't be far; she needed to improve her vantage point. She looked around her for a tree or other growth tall enough for her to get a better view, drawing her ascension gun.","timestamp":"2025-06-25T18:44:53.990000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":47,"userName":"Iyola Kett"},{"id":"1387466918490931261","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a determined grin, Iyola follows them into the oppressive green of the jungle. For the first hundred meters, the path is clear. But as she moves deeper, the alien nature of Xylos begins to work against her. The ground transitions from soft soil to a springy, moss-covered rock that doesn't hold impressions. The thick, overlapping layers of roots and glowing fungi create a confusing, three-dimensional landscape where a trail can vanish in an instant. The tracks she was following simply disappear into the dense undergrowth. She circles the area, her eyes scanning for a broken twig or a scuffed patch of moss, but finds nothing. Hextor's trail has gone cold.\n\nThe initial thrill of the chase begins to fade, replaced by the stark reality of her situation. The pod is a wreck, the easy trail is gone, and she is alone in the heart of a hostile, uncharted wilderness. Before her is the endless, humming jungle.","timestamp":"2025-06-25T16:18:11.257000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":45,"userName":"Storyteller"},{"id":"1387466903655813141","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The metal of the pod groans in protest as Iyola puts her shoulder into it, trying to pry loose the salvageable power converter. She gives a final, mighty heave. There is a sharp *snap*, but it's not the sound of success. The component doesn't come free; instead, the damaged housing around it shatters, sending a cascade of useless plastic shards and bent metal connectors tumbling into the mud. The converter remains firmly embedded in the wreck, now completely inaccessible. So much for that idea.\n\nFrustrated, she turns her attention to the more promising clue: the landing site of the *Gilded Thorn*. The scorch marks are just as she saw them, a clear sign of Hextor's presence. She approaches the spot, her eyes scanning the ground, looking for any sign of his trail. She finds faint tracks leading away from the clearing, just as she'd hoped. They are careless, arrogant tracks, made by someone confident they wouldn't be followed.","timestamp":"2025-06-25T16:18:07.720000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":43,"userName":"Storyteller"},{"id":"1387445397978480873","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a final push, Iyola emerges from the pod, which, she notices, is already settling into the marshy ground.  She takes her surroundings in - chirping creatures, glowing fungi, the lush, overgrown vegetation and hazy fragrant air such a contrast to her icy home, Rhinnal.  She loves it already. \n\nBut there’s no time to map out this uncharted jungle moon of Xylos.  She needs to focus on the prize - the *Sunken Star*.  And as she looks around, she sees that she’s had a spot of luck.  Yes, Hextor and his crew have landed, and they have a speeder, and now she knows exactly where they’re going.  *They might have more equipment and beings, but she has herself.  She can cut through this jungle like hot Mustafarian butter.* And if she knows Hextor, he’s nothing but barely competent and easily duped. Following their trail is a risk, but what isn’t. \n\nThe thought springs unbidden into her head.  *I wonder how they found Xylos so quickly. Has someone been following me?  Are they tracking the Seeker?*  She put the idea out of her head.  It wasn’t helping her right now. \n\n Iyola’s light hair is already sticking to her forehead in the humidity. She squashes it back into a bun and glances back at the pod.  \n\nJust one minute - she’s going to try to yank that component.  It’s probably dangerous, but that’s fine.  Plus, it looks unpowered so it might not interact with the energy on the planet like the probes had. Then she’ll follow the trail.","timestamp":"2025-06-25T14:52:40.367000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":41,"userName":"Iyola Kett"},{"id":"1387193030200787035","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The air that greets her outside the pod is thick and alive, a heavy blanket of humidity smelling of rain-soaked soil, night-blooming flowers, and the faint, sharp scent of ozone. Towering, bioluminescent fungi cast a soft, eerie glow on the surrounding foliage, revealing plants with broad, iridescent leaves and vines as thick as her arm. The jungle floor is a dense tapestry of roots and moss, punctuated by pools of shimmering, dark water. The air hums with the chirps and clicks of unseen creatures.\n\nHer attention turns back to the wrecked pod, its hull groaning as it settles into the mud. While most of the key systems are a lost cause, her scavenger's eye tells her there might be some useful components she can strip before abandoning it. Prying loose anything salvageable from the twisted metal without causing a power feedback will be tricky.\n\nWhile she considers this, she pulls out the datapad containing the telemetry map Caz uploaded. It flickers to life, displaying a topographical layout of this hemisphere of Xylos. As expected, it's incomplete. Vast swathes of the landscape are obscured by sensor ghosting, but it shows the major mountain ranges to the east and a massive river system to the south. Based on the visible landmarks, she can get a rough triangulation of her position in a wide, uncharted jungle basin.\n\nIt's as she's scanning the terrain around the crash site, comparing it to the map, that she sees it. About fifty meters away, half-hidden by the immense, fan-like leaves of a native tree, is a tell-tale sign of another visitor: a series of deep, precise scorch marks on the ground, characteristic of a high-quality lander's vertical thrusters. The landing is clean, controlled—nothing like her own crash. Hextor, or someone from his crew, landed nearby. And recently. There are faint tracks leading away from the scorch marks, deeper into the jungle. The race is already underway.","timestamp":"2025-06-24T22:09:51.200000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":39,"userName":"Storyteller"},{"id":"1387181725058076674","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola took a deep breath of the fragrant air of Xylos. New planets always smelled great to her.  Sure, the probe thing hadn’t worked out, comms were down,and she had no idea where she was or where to find the Sunken Star.  But she was a scout, on a forgotten jungle moon, and exploring was what she did.  Most being would have been nervous, but in her case, the chaos focused her. \n\n*She should get going *- but first, she eyeballed the pod to see if there was anything to scrap here that would be useful on her trek through Xylos.  She’d need to at least have a bead on the location; *Caz would probably be annoyed if they had to lose another planetary entry pod.  He’d forgive her, of course, but still. *","timestamp":"2025-06-24T21:24:55.844000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":37,"userName":"Iyola Kett"},{"id":"1387018876591542393","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola makes her way to the deployment bay. The \"Shooting Star\" is less a pod and more a cramped metal coffin with a cockpit and a viewport. Strapping into the pilot's seat, she seals the hatch and gives Caz the green light. A series of mechanical clunks echoes through the hull, followed by a gut-wrenching lurch as magnetic clamps release her into the void.\n\nThe descent is violent. The small craft shudders and groans as it hits the upper atmosphere, the view outside turning from the black of space to a searing tunnel of white and emerald energy. Alarms blare across her console, the board lighting up with warnings. As Caz predicted, the pod's sensors are a useless wash of static. The plan to scan is a bust; survival is now the only priority. She fights the controls, wrestling the bucking pod through the turbulence, aiming for a dark patch that might be a stable landmass.\n\nWith a final, bone-jarring impact, the pod slams into the ground, tearing through alien foliage and rich, dark soil before coming to rest at a sharp angle. The alarms die, replaced by an unnerving silence broken only by the hiss of cooling metal and the strange, multi-layered sounds of the jungle outside. The forward viewscreen is cracked, showing nothing but a wall of thick, pulsating flora. A blinking red light on the console indicates the long-range comm is offline, battered into silence by the rough landing. She is alone.\n\nWith a grunt of effort, Iyola hits the manual release for the main hatch. It groans in protest before swinging open, revealing the dense, alien jungle of Xylos. The air that flows in is thick, heavy with the smell of damp earth, strange blossoms, and the faint, electric tang of ozone.","timestamp":"2025-06-24T10:37:49.744000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":33,"userName":"Storyteller"},{"id":"1387018855926468631","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Caz Rha","avatar":"f77bf768a1a186c18afcda070542b147","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"A sigh of relief is audible over the comm, followed by a wry chuckle. ***\"Defective, huh? Sure they were. As long as you're okay. Listen, Iyola, the pod's sensors are going to have the same problem as the ship's, maybe worse once you're inside that soup. Don't count on them. Your best bet is to ride it out and get your boots on the ground.\"*** There's a pause, and his voice becomes more serious. ***\"And be careful with that comm. The interference is strong. If I don't hear from you in twelve standard hours, I'm coming to look for you, Hextor or no Hextor. Got it? Fly safe, Iyola.\"***","timestamp":"2025-06-24T10:37:44.817000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":31,"userName":"Caz Rha"},{"id":"1386894985080733850","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola managed to leap back from the arc of energy just in time. The probes were all kriffed. Belatedly, Iyola realized that she probably should have separated the probes first.\n\n**\"Uh, change of plans, Caz. The probes were defective.  But don't worry, I wasn't vaporized.  I'll just head down in the pod and use the pod sensors once I break through the atmo.  It'll be fine.  I'll message you on the long-range commlink after I've gotten the nav data from the Sunken Star. \"**\n\nShe wondered briefly if the comm would cut through the energy storm around Xylos.* Oh, she'd commed through worse.  Probably. It was time to get on the ground, in any case; she was itching to explore Xylos. *","timestamp":"2025-06-24T02:25:31.706000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":29,"userName":"Iyola Kett"},{"id":"1386893595063353396","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The smoking probes on the bench are a testament to her failed gamble. The shortcut is gone.","timestamp":"2025-06-24T02:20:00.300000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":27,"userName":"Storyteller"},{"id":"1386893593976766515","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Caz Rha","avatar":"f77bf768a1a186c18afcda070542b147","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"His voice crackles over the internal comm almost immediately, laced with alarm. **\"Iyola! What was that? I just registered a massive power spike and then nothing! Are you alright? Talk to me!\"**","timestamp":"2025-06-24T02:20:00.041000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":26,"userName":"Caz Rha"},{"id":"1386893590738768003","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Her hands move with practiced confidence, multitool in one hand, the datapad displaying Caz's chaotic energy readings in the other. She isolates the primary power cell conduit, preparing to create the bypass that will overclock the sensor array. For a moment, it seems to work. The probe hums, a low thrum of energy building within it. But as she makes the final, delicate connection, the complex energy from Xylos's atmosphere proves too unstable.\n\nThere's a sharp *fizzle* and a flash of brilliant blue light from the probe's core. She pulls her hand back instinctively as the acrid smell of ozone fills the small storage bay. A cascade of smaller sparks dances across the workbench, and the low hum of the other probes dies abruptly. They're all dead, their power cells completely fried.","timestamp":"2025-06-24T02:19:59.269000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":25,"userName":"Storyteller"},{"id":"1386890560442470432","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"\"**Don't fret, ma sareen, I won't make you talk to my mom at all**,\" Iyola called from the storage bay. She wasn't worried. *There was at least a slight chance this mechanical maneuver would work, even though she'd never really done anything like it. And if it didn't - well, she'd head to the surface and figure something out.  She always did. *\n\nShe dismissed the vaporization comment.  *That was just Caz being Caz*.  She'd let him be the one who overthought things. \n\nShe grabbed her multitool and pried the access panel open on the probe closest to her.  Datapad in one hand, she got to work.","timestamp":"2025-06-24T02:07:56.790000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":23,"userName":"Iyola Kett"},{"id":"1386880442355028070","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"A moment later, a datapad on a workbench in the small, cluttered mechanical storage bay chimes. The screen illuminates with the chaotic, raw data streams of Xylos's energetic atmosphere. Spread across the bench are the leftover survey probes from the Dosuun expedition—sleek, silver darts, cold and inert.\n\nModifying them for these conditions is a daring, on-the-fly piece of engineering. Iyola would need to manually recalibrate the energy-gathering arrays, forcing them to operate far outside their safety specifications to punch a signal through the moon's interference. It's a delicate and risky operation. Success could give her the edge she needs, but a single miscalculation could overload the probe's power cells, rendering them useless scrap metal before she even gets in the pod.","timestamp":"2025-06-24T01:27:44.450000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":21,"userName":"Storyteller"},{"id":"1386880439666479124","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Caz Rha","avatar":"f77bf768a1a186c18afcda070542b147","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He watches her go, a flicker of a smile on his face despite the tension. Her confidence is infectious, as always. He turns back to his console, his golden-yellow fingers flying across the controls. **\"Tighten the bands? Iyola, you know that'll burn out the core sequencers in minutes, maybe seconds after you launch them.\"** He shakes his head, a sound of fond exasperation in his voice that carries over the ship's internal comm. **\"But if anyone can time it just right to get a single ping... it's you. Alright, sending the atmospheric energy resonance data to the workstation in mechanical storage now. Be careful. I'd rather not have to explain to your mother how I let you get vaporized by your own science project.\"**","timestamp":"2025-06-24T01:27:43.809000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":20,"userName":"Caz Rha"},{"id":"1386857633696190585","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola laughed. She leaned over and glanced at the screen, placing a reassuring hand on Caz's shoulder as she did so.\n\n** \"Not that loser Hextor again!\"  **she said brightly. **\"He's really going to be embarrassed when I grab the Sunken Star before him. When we do,\" **she amended her statement. \n\nIyola straightened out her bright turquoise synth-leather jacket,  **\"We've still got a few of those probes left over from that thing on Dosuun, right?  I'll throw them into the pod - probably easier to scan when I'm through the atmosphere.\"**\n\nThe jewel-toned moon of Xylos churned beneath her.  T*his was exciting. She had no idea what was down there, or where the wreck was.  Though it would be nice to have at least some idea where the wreck was.  *She squeezed his shoulder, then released him and stood up, walking toward mechanical storage.\n\n**\"Hey, Caz, send me over that energy signature.  I'm going to try to tighten the probe bands real quick, maybe counter and cut through some of this energy cloud interference.  It'll burn out the probe faster, but I just need an idea where the Sunken Star is, and I can handle the rest.\" **","timestamp":"2025-06-23T23:57:06.442000+00:00","edited_timestamp":"2025-06-24T01:25:04.255000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":14,"userName":"Iyola Kett"},{"id":"1386795622991925310","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"In the deployment bay, the ship's single-person entry pod, the \"Shooting Star,\" sat prepped and waiting. On the viewscreen, the hostile, beautiful moon churned below, hiding both a legendary prize and an unknown number of dangers. The choice of what to do next rested squarely with Iyola.","timestamp":"2025-06-23T19:50:41.938000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":8,"userName":"Storyteller"},{"id":"1386795621679370300","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Caz Rha","avatar":"f77bf768a1a186c18afcda070542b147","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"He can't scan the surface any better than we can, but he's already here. He'll be sending down probes, maybe even dropping his own team blind.\"** He sighs, running a hand over his head and looking to Iyola, his trust absolute. **\"This was supposed to be our score. Clean and simple. What's the plan, boss?\"**","timestamp":"2025-06-23T19:50:41.625000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":7,"userName":"Caz Rha"},{"id":"1386795619116384429","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The name hangs in the air for a moment, heavy with unspoken history and rivalry: Hextor Ambur. The thrill of being on the cusp of the discovery of a lifetime is now a frantic, ticking clock. On the main tactical display, the garbled sensor data from Xylos is now overlaid with two markers: the friendly blue icon of the *Stardust Seeker*, and a single, arrogant gold icon representing the *Gilded Thorn* on the opposite side of the moon.","timestamp":"2025-06-23T19:50:41.014000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":6,"userName":"Storyteller"},{"id":"1386795601626398771","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Caz Rha","avatar":"f77bf768a1a186c18afcda070542b147","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The Twi'lek pilot leans forward, his golden fingers dancing across a console as the final astrogation charts resolve on his screen. His lekku twitch with a mix of excitement and anxiety. He glances over at Iyola, a wide smile flashing for a moment before it tightens with professional concern. **\"Well, this is it, Iyola. End of the line. The legends, the data fragments, they all pointed here. The *Sunken Star* has to be down there somewhere.\"**\n\nHe taps a sequence on his display, and a new window pops up, showing a chaotic scramble of sensor feedback. **\"Problem is, that atmosphere is even nastier up close than the charts suggested. It's like a soup of pure energy. I can't get a scan lock on anything smaller than a mountain range. Trying to pinpoint the wreck from orbit is impossible.\"**\n\nHe pauses, his expression souring. **\"And... we're not the first to the party. Long-range sensors picked up another ship that just settled into a high orbit. Transponder matches the *Gilded Thorn*.\"**","timestamp":"2025-06-23T19:50:36.844000+00:00","edited_timestamp":"2025-06-23T19:52:03.276000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":4,"userName":"Caz Rha"},{"id":"1386795599382319175","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The low, resonant hum of the *Stardust Seeker’s* life support is the only sound in the cockpit, a stark contrast to the chaotic beauty filling the main viewscreen. Below, the jungle moon of Xylos is a swirling masterpiece of emerald green and sapphire blue, its thick atmosphere churning with violent energy storms that flash like silent lightning across its face. The cockpit itself is worn but meticulously maintained; the faint, familiar smells of spiced caf and ozone hang in the recycled air. Every instrument panel and control yoke shows signs of frequent, expert use.","timestamp":"2025-06-23T19:50:36.309000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":3,"userName":"Storyteller"},{"id":"1386794368551358485","channel_id":"1386794250947264743","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"***A long time ago in a galaxy far, far away....***\n# **STAR WARS**\n## **THE SUNKEN STAR OF XYLOS** \nThe age of galactic exploration is not over. In the furthest reaches of the Outer Rim, forgotten legends and lost treasures still wait for those daring enough to find them. The greatest of these prizes is the **SUNKEN STAR**, a pre-Republic survey ship rumored to hold priceless navigational data, lost for centuries to the void.\nNow, after years of relentless searching, intrepid pioneer **IYOLA KETT** has tracked the ghost ship to its final resting place—the uncharted jungle moon of Xylos. The discovery would cement her legacy, bringing her the fame and respect she has fought so hard to earn.\nBut she is not alone. Her ambitious rival, **HEXTOR AMBUR**, has followed her trail, turning Iyola’s moment of triumph into a desperate race. With the moon's violent atmosphere scrambling their sensors, Iyola must descend to the hostile surface alone to claim the legendary prize before it is stolen from her grasp....","timestamp":"2025-06-23T19:45:42.856000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":1,"userName":"Storyteller"},{"id":"1386794250947264743","channel_id":"1380700164175696062","author":{"id":"208916238661844993","username":"aliciagd","avatar":"d7832f2cac5df42d164b81e35de34f09","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Alicia","avatar_decoration_data":null,"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"480488957889609733","identity_enabled":true,"tag":"Sage","badge":"a97b2236adc3b0f190ee75428db3a914"},"primary_guild":{"identity_guild_id":"480488957889609733","identity_enabled":true,"tag":"Sage","badge":"a97b2236adc3b0f190ee75428db3a914"}},"content":"Prelude: The Sunken Star of Xylos (Iyola)","timestamp":"2025-06-23T19:45:14.817000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1386794250947264743","guild_id":"661388927734775859"},"flags":32,"thread":{"id":"1386794250947264743","type":11,"last_message_id":"1398093167286554755","flags":0,"guild_id":"661388927734775859","name":"Prelude: The Sunken Star of Xylos (Iyola)","parent_id":"1380700164175696062","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"208916238661844993","thread_metadata":{"archived":false,"archive_timestamp":"2025-07-06T16:58:19.093000+00:00","auto_archive_duration":4320,"locked":true,"create_timestamp":"2025-06-23T19:45:14.817000+00:00"},"message_count":107,"member_count":5,"total_message_sent":207,"member_ids_preview":["644942473315090434","206049406653431808","276746725572608001","208916238661844993","626586611500711967"]},"components":[],"userName":"aliciagd"}]