[{"id":"1382501819497971736","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"***A long time ago in a galaxy far, far away....***\n# **STAR WARS**\n## **THE STATIC ON THE LINE**\n\n*The **HIGH REPUBLIC** era is a time of prosperity, but shadows lengthen in the Outer Rim. For the desperate and the daring, forgotten legends and whispered rumors are often the only currency that matters.*\n\n*Down on his luck and haunted by past failures, Balosar smuggler **DRYZAN KAR'DOLA** has staked his last credits on such a tale—a family story of the **STARDUST DRIFTER**, a heavily armed transport that served as a mobile treasury for a smugglers' coalition, lost to the cosmic tides centuries ago.*\n\n*Acting on a cryptic clue from his father's audio logs, Dryzan has traced the ghost ship's final resting place to the treacherous **ASH-VEIL** nebula. Now, with the help of his slicer contact on Nar Shaddaa, **VIANNA NORSTRAG**, a faint, ancient signal has been confirmed, breathing life into the myth. Plotting a course into the ship-shredding nebula, Dryzan prepares to risk everything on one last, desperate gamble....*","timestamp":"2025-06-11T23:28:39.410000+00:00","edited_timestamp":"2025-06-11T23:39:08.141000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":1,"userName":"Storyteller"},{"id":"1383074987593961556","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The darkness of the cockpit is a familiar comfort, a stark contrast to the grimy, neon-lit docking bay of the orbital station visible through the transparisteel viewport. Outside, droids and dockworkers move in a silent, distant ballet under the station's harsh floodlights. The air inside is stale, thick with the lingering scent of yesterday's caf and the faint, metallic tang of ozone from a panel that sparks intermittently near the floor.\n\nStanding silently beside the pilot's chair is a droid, a model Dryzan has never seen anywhere else. It is bipedal, with a practical, slim-bodied build that suggests function over form. Its original off-white plating is a sad history of a hard life—a patchwork of deep scuffs, welded dents, and mismatched, unpainted plates of raw durasteel. Its head is a simple, functional block with three round, glowing blue optical sensors. One of them flickers intermittently, casting a syncopated rhythm of light on the worn deck plating. The droid, designation GE-3, emits a low, steady processing whir, a sound Dryzan has become accustomed to over the past few weeks.\nThe ship is cold, running on bare minimum power to save credits, and the only other sound is the crackling voice of a man long dead, spilling from the ship's comm system speakers. It's one of his father's old audio logs, a recording Dryzan has listened to a hundred times while GE-3 cross-referenced the ship's ancient nav-computer with the fragmented story.","timestamp":"2025-06-13T13:26:13.333000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":4,"userName":"Storyteller"},{"id":"1383075066321047562","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Kar’dola Recording","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"\"***...not just a ship, you see,***\" the warm, weary voice says, layered with static like a ghost from another era. \"***She was a fortress. The Stardust Drifter. A mobile bank, a myth. The Coalition stored everything in her belly. She was meant to be their future, before she vanished into the Veil... the Ash-Veil. A ship-shredder, they called it. But for a prize like that... what's one more ghost in a graveyard?***\"","timestamp":"2025-06-13T13:26:32.103000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":6,"userName":"Kar’dola Recording"},{"id":"1383075068439036028","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"On the datapad resting on his lap, Dryzan has been tracing and retracing the modern star charts of that very nebula against a hand-drawn map from his father's notes. His dark hair is a tangled mess, and the stubble on his cheeks is more than a day old. He lets out a low, rattling cough that seems to echo in the cramped space. The story is a fairy tale, a smuggler's dying dream, but it's the only one he has left.\nThe audio log clicks off, the last word swallowed by an abrupt silence that feels heavier than the noise it replaced. The nav-chart on his lap continues to blink, a single, unverified coordinate deep within the swirling red icon of the Ash-Veil. The legend hangs in the air, waiting.","timestamp":"2025-06-13T13:26:32.608000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":7,"userName":"Storyteller"},{"id":"1383197307587137536","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Heaving a weary sigh, Dryzan lifts the glasses off his face with one hand while the other pinches and rubs at the bridge of his nose. His breath catches again on the inhale, another nasty cough erupting before he finally finishes the breath.\n\n**\"This kriffing cold air. I'll be glad when this is done, GE-3. No more struggles, no more scraping for credits for fuel, no more.. no more debts. Just freedom, from it all.\"**\n\nHe puts his glasses back on and gazes at the droid, the round red frames masking his eyes the way the *Ash-Veil* masks the coordinate blipping on the nav-chart.\n\n**\"Ready for one last roll of the die?\"**","timestamp":"2025-06-13T21:32:16.692000+00:00","edited_timestamp":"2025-06-13T23:04:47.430000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":9,"userName":"Dryzan Kar'dola"},{"id":"1383205321669083136","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The blue optical sensors on GE-3's head swivel to focus on Dryzan, the intermittent flicker of the third lens casting an unsteady light on the bulkhead. A series of soft clicks emits from the droid's chassis as it processes the query.\n\n**\"Diagnostic Observation: Your respiratory symptoms persist, Master Dryzan. The recycled air of this station has a particulate count seventeen percent above acceptable health standards. Informative Statement: The term 'freedom' is a complex philosophical concept, but I have cross-referenced it with your financial status. A significant increase in liquid assets would indeed alleviate many of the stressors currently affecting your operational efficiency.\"**\n\nThe droid pauses for a fraction of a second, its head tilting almost imperceptibly.\n\n**\"Clarification Query: By 'one last roll of the die,' are you metaphorically referring to the upcoming mission to investigate the anomalous energy signature within the Ash-Veil? Analytical Statement: While my programming does not include modules for games of chance, all my systems are functioning at ninety-eight point six percent efficiency. I am prepared to assist.\"**","timestamp":"2025-06-13T22:04:07.398000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[{"id":"1383205321090273420","filename":"GE3.png","size":5241436,"url":"https://cdn.discordapp.com/attachments/1381783775301734441/1383205321090273420/GE3.png?ex=68568397&is=68553217&hm=7397b6127fcd897aa2ed8f614b0649e6c2256d0438d4530e9ac1277a5e571d47&","proxy_url":"https://media.discordapp.net/attachments/1381783775301734441/1383205321090273420/GE3.png?ex=68568397&is=68553217&hm=7397b6127fcd897aa2ed8f614b0649e6c2256d0438d4530e9ac1277a5e571d47&","width":2048,"height":2048,"content_type":"image/png","content_scan_version":1,"placeholder":"jfcFDwIGqYd5hHeAeWeoOIiHhwFYOYAF","placeholder_version":1}],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":18,"userName":"GE-3"},{"id":"1383223682905800764","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Dryzan smiles wearily, amused despite himself by the conversation he has found himself repeating with the droid over the last few weeks.\n\n**\"Of course the symptoms persist, that's what a childhood spent breathing in the toxic crud of heavy industry does for you. Well, not for** *you* **obviously, but you know what I mean.\"**\nHe gestures with his hands while talking, long fingers swooping through the air like the speeders and lifters that fill the air on Balosar.\n\n**\"And yes, I meant our attempt to track down this treasure ship. The** *Stardust Drifter*.**\"**\nHe pauses, fingers running over the star charts one last time.\n**\"I remember him going on about it, but I never thought I'd be chasing that same crazy dream one day...\"** he mutters quietly.\n\nRefocusing on the present he gazes back at the droid's blue optics.\n\n**\"Glad that one of us is running efficiently. Me, I'm just running.\n\nNow let's try and find this thing before I have to try and scrape enough credits together to refuel again. I don't think I'll get much by asking for a tab.\"**\n\nTurning to the controls Dryzan starts prepping the ship to begin their hunt.\n\n**\"You got that course ready?\"**","timestamp":"2025-06-13T23:17:05.058000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":21,"userName":"Dryzan Kar'dola"},{"id":"1383235844273475648","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid's head swivels back to the main console. A low-resolution star chart flickers to life, displaying a direct, calculated route from their current position to the edge of the swirling nebula. **\"Affirmative Statement: The course has been plotted and loaded into the nav-computer. I have accounted for standard gravimetric shear and projected debris fields based on archival data. However, the Ash-Veil is known for unpredictable spatial anomalies. I calculate a thirty-four point seven percent chance of encountering unforeseen navigational hazards.\"**","timestamp":"2025-06-14T00:05:24.554000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":23,"userName":"GE-3"},{"id":"1383235847041585182","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The cockpit of the freighter shudders as Dryzan's hands move across the control console. Switches click into place with unsatisfying softness, their contacts worn from decades of use. The low hum of dormant systems pitches upward into a strained whine as power converters labor to draw energy. Dust, previously settled in the quiet dark, dances in the sudden glow of status lights changing from a sleepy amber to a hopeful, if flickering, green. Through the viewport, the rust-streaked, utilitarian structure of Gantry 94, a minor orbital platform clinging to the edge of civilized space, begins to slide away as the magnetic docking clamps release with a percussive thud that vibrates through the deck.","timestamp":"2025-06-14T00:05:25.214000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":24,"userName":"Storyteller"},{"id":"1383235861055012995","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid remains perfectly still, its photoreceptors tracking the readouts on a secondary screen. **\"Informative Statement: All pre-flight checks are complete. All systems report nominal functionality within expected parameters for a vessel of this age and maintenance history. The docking fees have been automatically transferred. Our available credit balance is now seventeen.\"** The droid pauses, its head tilting a single degree. **\"Advisory Statement: This credit balance is insufficient for standard refueling operations.\"**","timestamp":"2025-06-14T00:05:28.555000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":26,"userName":"GE-3"},{"id":"1383365697660260403","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"*Seventeen credits.* Dryzan sighs heavily, the weight of the galaxy feeling like it is pressing down on him for a moment.\n*Fuel, food, replacement parts to keep this junker going. Let alone any spare for...*\n\nHe refuses to let himself finish that thought. *I'll find a way. Always do.*\n\n**\"Well, we'd better find the** *Drifter* **quickly then. No time to lose.\"**\nOne hand lifts off the console for a second, automatically reaching towards a pocket for a death stick, before it stops and falls back towards the controls. *Shame that last shipment is all gone. Always helps me steady my nerves.*\n\nHe quickly punches the console buttons, getting the aging vehicle ready for the first jump. The bulkheads creak and judder faintly, a small trickle of dust falling from one of the atmospheric vents as the ship shakes under the stresses of the maneuvers.\n*Come on old girl, hold together. Just a few jumps more...*","timestamp":"2025-06-14T08:41:24.014000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":28,"userName":"Dryzan Kar'dola"},{"id":"1383400630990802945","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The ship groans in protest as Dryzan guides it away from the relative safety of Gantry 94. The navigation computer, an archaic model GE-3 has had to coax into cooperation, flickers as the coordinates for the first leg of the journey are locked in. With a final, decisive movement, Dryzan engages the hyperdrive.\n\nFor a heart-stopping moment, the only response is a deep, resonant shudder that runs the length of the hull, a sound like a leviathan taking a painful breath. Then, the view outside the cockpit distorts violently. The distant stars streak, elongate, and finally collapse into a swirling, incandescent tunnel of blue-white light. The familiar, unsettling non-sound of hyperspace travel fills the cockpit, a low thrum that is felt more in the bones than heard with the ears.","timestamp":"2025-06-14T11:00:12.769000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":30,"userName":"Storyteller"},{"id":"1383401190582259734","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s photoreceptors dim slightly to compensate for the sudden brilliance of the hyperspace vortex. It makes a series of soft, analytical clicks. **\"Informative Statement: Hyperdrive activation was successful, though the primary energy conduit experienced a power fluctuation seven point two percent outside of optimal parameters. I have logged the event for future maintenance. Projecting arrival at the Ash-Veil nebula in three standard hours.\"**","timestamp":"2025-06-14T11:02:26.186000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":33,"userName":"GE-3"},{"id":"1383533720467935313","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The relief is clear on Dryzan's face when the failing ship finally makes the jump to lightspeed, a plethora of warning indicators lighting up on some of the control banks.\n**\"Mmm, she's struggling all right. I haven't had the time to get her properly serviced and tuned by Tallen in a long while.\"** *Or the credits...* he thinks to himself.\n\n**\"Hopefully she can hold together long enough to get us there.\"** *Last thing we want is to cause another hyperspace disaster by flaming out...*","timestamp":"2025-06-14T19:49:03.773000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":35,"userName":"Dryzan Kar'dola"},{"id":"1383540301590958161","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The ship settles into the steady, hypnotic rhythm of hyperspace travel. The chaotic star-streaks outside the viewport become a constant, flowing river of light, offering no sense of speed or distance, only endless transit. The cockpit is an island of artificial calm in the storm, the air growing warmer as the overworked systems begin to heat the small space. The only sounds are the deep thrum of the hyperdrive and the occasional, anxious creak of stressed metal.","timestamp":"2025-06-14T20:15:12.835000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":37,"userName":"Storyteller"},{"id":"1383540304002547822","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s head swivels away from the main console and tilts down toward a low access panel near Dryzan’s feet, the one that had been sparking intermittently back at the station. Its flickering blue photoreceptor seems to stare intently at the plate. **\"Analysis: The previously noted power fluctuation from the primary energy conduit is consistent with a failing insulation seal on the auxiliary power converter, module 7-B, located behind that panel. Reference: My databanks contain a schematic for this module, along with an audio log from your progenitor detailing a similar repair he performed. Informative Statement: While the current risk of catastrophic failure is low, a destabilized power feed upon reversion to realspace could temporarily disable shields or weapon systems. I calculate a sixty-two percent probability of such an event if the issue is not addressed.\"**","timestamp":"2025-06-14T20:15:13.410000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":38,"userName":"GE-3"},{"id":"1383540305101324368","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The panel in question emits a low, oscillating hum, and a faint smell of burnt ozone periodically wafts from its seams. The tools for such a minor repair are stowed in a locker just behind the co-pilot's chair. The three-hour journey stretches ahead, a pocket of quiet time filled only with the ghost of his father's warning and the low hum of a problem waiting to happen.","timestamp":"2025-06-14T20:15:13.672000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":39,"userName":"Storyteller"},{"id":"1383695349880717423","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As the acrid tang of burnt wiring wafts through the air Dryzan groans gently, frustration surging through him. *What now?!*\nAs the droid diagnoses the issue he nods slowly.\n**\"Well, at least it'll pass the time. Play back the log GE-3, just in case dear old dad has done one of his 'special' repair jobs on this one. Last thing we need is to burn out another system because he used a custom wiring scheme again.\"**\n\nStanding and stretching, Dryzan removes the long trench coat and dumps it over the back of the copilot's chair. He grabs the handle of the tool locker and pulls it open, the door of the compartment creaking loudly as the aged hinges protest at having to move.\n*Let's see if I can manage this one without zapping myself again...*","timestamp":"2025-06-15T06:31:19.228000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":41,"userName":"Dryzan Kar'dola"},{"id":"1383760612584325235","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"GE-3's head tilts in acknowledgment. A soft whirring sound is followed by the familiar crackle of an old recording. The voice that fills the cockpit is the same warm, weary tone from before, but this time it's less storytelling and more practical, layered with the faint sounds of clanking tools in the background.","timestamp":"2025-06-15T10:50:39.069000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":43,"userName":"Storyteller"},{"id":"1383760615176146984","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Kar’dola Recording","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"***\"Right, the 7-B module is acting up again. Standard procedure is useless; the stock insulation just can't handle the load this old girl pulls when she's stressed. The trick is to bypass the secondary flow regulator entirely. See that green-striped wire? Ignore it. It's a trap. You need to splice directly into the primary feed. It'll look wrong to anyone who's ever read a standard schematic, but trust me, it's the only way she'll hold a steady charge through a jump. Just be careful not to ground it on the casing...\"***","timestamp":"2025-06-15T10:50:39.687000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":44,"userName":"Kar’dola Recording"},{"id":"1383760618217148426","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The recording clicks off. As Dryzan pries open the access panel with a groan of protesting metal, he's greeted by a sight that confirms his father's words. It’s a chaotic nest of wires, a mix of standard-issue cabling and several thick, off-color conduits jury-rigged with what looks suspiciously like hardened sealant tape. Just as the recording mentioned, a green-striped wire is neatly tucked away, while another, thicker wire is crudely spliced into a major power junction. It's near this very splice that the insulation has frayed, exposing a flickering, faintly glowing filament within. The source of the hum and the smell of ozone is obvious, and dangerously close to the metal casing of the module.","timestamp":"2025-06-15T10:50:40.412000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":45,"userName":"Storyteller"},{"id":"1383952640097914892","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"*Ugh, this is going to be a messy one.*\nExhaling a long breath, Dryzan grabs a long manipulator from the toolkit and a roll of sealant tape - *Well, there must be a reason he kept using it. Wonder if it can still be called a ship when 50% plus of the components are replaced by sealant...*. Gingerly reaching in, he focuses all of his will and intent on the careful motions of his hands.\n\nWith carefully controlled, almost glacial movements, Dryzan slowly places a temporary grounding pad between the exposed wire and the casing. Meticulously moving aside the other wires he gradually exposes the damaged one, unearthing the dangerous element from within the bundle of essential components.\n\n**\"Ok, here goes nothing.\"** he mutters to himself, expecting a shock to his fingers any moment. That or the deafening blast of alarms as the ship crashes out of hyperspace, or a moment of terror as the hull ruptures outwards from the engine room, or...\nA bead of sweat rolls down his forehead, irritating as it slips into the well where the skin-flap hiding one of his antennapalps is.\n\nThe sealant tape carefully and precisely snugs around the damaged cable, sheathing the lurking spectre of trouble that the frayed cable represented within a thin layer of safety.\n\n**\"... And done.\"** Dryzan says, a slight questioning tone in his voice, almost unbelieving at how smoothly that went off.\n**\"Uh, can you run a diagnostic on that, GE-3? Not that I don't trust my work of course, but always good to verify, right?\"**","timestamp":"2025-06-15T23:33:41.996000+00:00","edited_timestamp":"2025-06-15T23:34:33.180000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":47,"userName":"Dryzan Kar'dola"},{"id":"1383957354529292319","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The moment the sealant tape makes its final wrap around the frayed wire, the low, anxious hum from the module ceases. The acrid smell of ozone is no longer being produced, slowly starting to dissipate into the recycled air of the cockpit. The ship's ambient thrum seems to even out, losing a subtle, almost subliminal quaver that Dryzan hadn't even consciously noticed until it was gone. The filament behind the exposed splice dims, its dangerous glow extinguished. For the first time since leaving Gantry 94, the ship feels stable, almost content.","timestamp":"2025-06-15T23:52:26.004000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":51,"userName":"Storyteller"},{"id":"1383957356576112660","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s photoreceptors brighten, scanning the internal diagnostic readouts that flicker across its own vision. **\"Processing... Affirmative Statement: The repair is successful. The primary energy conduit is now stable. Power fluctuations have been reduced to zero point zero one percent, which is well within optimal performance parameters. The probability of system failure upon reversion to realspace has been recalculated to less than one percent. A highly efficient repair, Master Dryzan.\"**","timestamp":"2025-06-15T23:52:26.492000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":52,"userName":"GE-3"},{"id":"1384168148156154089","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As the ship settles around him a small amount of the nervous tension bleeds out of Dryzan, as if some subconscious unease at the failing systems has been quieted by his actions.\n\nHe nods as GE-3 delivers its report. It hasn't been long since he first started travelling with the droid, but he is already becoming accustomed to its presence; the familiar droning whir as it processes is an almost comforting background noise now, like the hum of the ship's engines as it thrusts them onwards through hyperspace.\n\n**\"Well I definitely prefer those odds.**\n**Anything else you've spotted that we may need to do something about? Or that we can plan for when we arrive?\"**\n*Otherwise I might just go take a nap. Or root around in the compartments one more time - there must be another death stick here somewhere...*\nHis hands pat his pockets unconsciously, the reaction as autonomous as the thin tongue that licks his lips slightly as soon as the thought of the drug pops up.","timestamp":"2025-06-16T13:50:03.121000+00:00","edited_timestamp":"2025-06-16T13:50:38.624000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":54,"userName":"Dryzan Kar'dola"},{"id":"1384176221264285730","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s head swivels to face Dryzan, its three blue eyes fixed on him. **\"Analysis: A full-system diagnostic reveals no other imminent critical failures. The port-side atmospheric regulator is functioning at eighty-seven percent efficiency, and the nav-computer's memory buffer shows a zero point zero three percent degradation rate, but neither pose an immediate risk to the mission.\"**\n\nThe droid pauses, processing the second part of the query.\n\n**\"Tactical Projection: Regarding our arrival, we must plan for several contingencies. The *Stardust Drifter*, having been dormant for centuries within a high-radiation nebula, will almost certainly lack a breathable atmosphere. Its internal temperature will have equalized with the surrounding void, approximating near-absolute zero. Standard environmental suits will be a necessity for all extra-vehicular and internal exploration.\"**\n\nA new data schematic flashes onto GE-3's chest-mounted display screen, showing the ghostly outline of a large, pre-Republic capital ship.\n\n**\"Additional Threat Assessment: High Republic-era Coalition treasury vessels of that class were frequently outfitted with automated security systems. There is a forty-one percent probability of encountering dormant security droids. Based on standard schematics of the era, these units are often sound-activated. I recommend maintaining absolute silence upon boarding to avoid unnecessary complications.\"**","timestamp":"2025-06-16T14:22:07.900000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":57,"userName":"GE-3"},{"id":"1384182196084019404","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"*Great, no atmosphere and no heat. Not to mention droid defenses that could rip me apart.*\n*If I didn't need the kriffing credits so badly...*\n\n**\"Ok, well, is there a way that we can deactivate or reprogram any defensive droids? I'd prefer not to have to creep around this huge thing trying not to breathe too hard or stub my toe on anything.\"**\nThe idea of creeping around the wreck in a suit, barely able to see or breathe, and all the while dreading hearing the CLOMP CLOMP of the droids approaching... He shudders. Just the thought is terrifying.","timestamp":"2025-06-16T14:45:52.408000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":59,"userName":"Dryzan Kar'dola"},{"id":"1384198432885051445","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid processes the question for a moment, its internal whirring rising in pitch slightly.\n\n**\"Analysis: Remote deactivation of the ship's internal security grid is improbable. The vessel's central security mainframe would require primary power, which has likely been offline for centuries. Furthermore, any surviving emergency power would prioritize critical systems, not a networked security interface accessible from the exterior.\"**\n\nThe schematic on its chest display shifts, highlighting several small nodes scattered throughout the ship's interior map.\n\n**\"Alternative Strategy: Direct interface presents a viable, though high-risk, solution. If an auxiliary security terminal with residual or reroutable power can be located, I can attempt to access the local network. My analysis indicates I could reprogram their patrol patterns or place them into a diagnostic standby mode. However, I would need to bypass multiple layers of archaic, but formidable, security protocols to do so.\"**\n\nThe droid's head tilts, its photoreceptors focusing on Dryzan.\n\n**\"Caveat: This action would require physical proximity to a terminal. Locating and accessing such a terminal without first alerting the sound-activated droids remains the primary tactical obstacle. Stealth will be the initial, unavoidable requirement.\"**","timestamp":"2025-06-16T15:50:23.563000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":61,"userName":"GE-3"},{"id":"1384245187194257489","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Dryzan studies the schematic futilely, the floorplan more complex than he could ever hope to memorise. He studies it anyway, searching for some kind of pattern or general understanding of the layout.\n\n**\"Ok, understood, so we'd need to get to a terminal before we could fix the droids.\"**\n\nHe scratches his chin thoughtfully, his mind beginning to flip through options and possibilities.\n\n**\"Can you highlight any possible landing bays? And airlocks too, just in case we have to dock externally. Then show me what the route would be from those respective entry points to the nearest terminal. Limit it to just the two options with the highest calculated probability of success - yes, I know you don't have much data to base it on, but we have to work with what we've got.\"**\nAs he focuses on the problem his hands and mind still, the nerves (and longing for another death stick) subsiding beneath the current goal.","timestamp":"2025-06-16T18:56:10.659000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":63,"userName":"Dryzan Kar'dola"},{"id":"1384248603362721944","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Processing request.\"** The droid’s optical sensors dim for a moment as it dedicates its full processing power to analyzing the schematics. After a few seconds, the image on its chest display zooms in, filtering out irrelevant sections of the ghost ship.\n\n**\"Analysis: The main dorsal hangar bay shows signs of catastrophic structural failure and is unsuitable for docking. However, two viable entry points present themselves with the highest calculated probability of success based on structural integrity scans and proximity to potential auxiliary power conduits.\"**","timestamp":"2025-06-16T19:09:45.137000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":65,"userName":"GE-3"},{"id":"1384248605648355500","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The schematic updates in real-time. A smaller, secondary cargo bay on the ventral side of the ship begins to glow, marked as **[OPTION ALPHA]**. A thin, yellow line traces a relatively direct path from this bay through a series of cargo holds and maintenance corridors to a small icon labeled `SEC-TERMINAL-ENG`.\n\nSimultaneously, a small, unassuming maintenance airlock near the aft engineering section is highlighted as **[OPTION BETA]**. A second, blue line snakes out from it, taking a more complex, winding route through what appear to be crew decks before arriving at a different icon marked `SEC-TERMINAL-CREW`.","timestamp":"2025-06-16T19:09:45.682000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":66,"userName":"Storyteller"},{"id":"1384248621968654376","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Visual Aid: Option Alpha, the secondary cargo bay. This route is shorter. Proximity to the main engineering section suggests a higher probability that its associated security terminal will have residual power. However, as a primary access point, it also carries a higher probability of being a designated patrol route for automated security.\"**\n\nThe droid’s head swivels slightly, indicating the second path.\n\n**\"Visual Aid: Option Beta, the maintenance airlock. This route is less direct and likely unmonitored. It offers a stealthier approach. However, terminals in crew sectors are often lower priority and may be unpowered, requiring us to traverse farther into the vessel to locate a functional node.\"**\n\nThe display holds steady, presenting the two glowing paths into the heart of the silent ship.\n\n**\"Awaiting your selection, Master Dryzan. Each route presents a distinct set of risk parameters.\"**","timestamp":"2025-06-16T19:09:49.573000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":68,"userName":"GE-3"},{"id":"1384316517268852807","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He cocks his head, hanging upon the droid's words as he studies the two routes. *Two roads to travel, neither one a certain thing...* he  whistles a fragment of a popular jizz song while he thinks.\n*Nothing to it, just gotta choose it, grab that horn and make it swing.*\n\nHe snaps his fingers.\n**\"Ok, let's do it. Beta, maintenance airlock. Let's just hope that we're in luck and the first terminal is functioning.\"**\n\nHe quickly moves to begin pacing the room, brandishing his hands in front of him.\n**\"Ok so let's plan out our little walk in the woods. We have some time before we get there, and I wanna make sure that this goes slick as drool off a Hutt's mouth.\"**\nThe prospect of action puts a spring into his step despite himself, his locks of dark hair swaying as he spins at the end of each journey.\n\nThe unusual pair discuss the details of the plan in depth, using what time they have to be as thorough as possible given what they know.\nAll the while the ship hurtles closer to the destination, and the date with what is hopefully enough treasure to change his life.","timestamp":"2025-06-16T23:39:37.074000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":70,"userName":"Dryzan Kar'dola"},{"id":"1384320001380712503","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The remaining hours in hyperspace pass in a blur of intense, whispered strategizing. Dryzan paces the confines of the cockpit, gesturing wildly as he outlines scenarios, while GE-3 stands stoically, its chest display shifting through thermal schematics, structural weak points, and simulated patrol routes for the silent security droids. The air grows thick with plans, counter-plans, and the low, persistent hum of the ship's engines.\n\nFinally, with a gut-wrenching lurch and a cacophony of groaning metal, the freighter drops back into realspace. The brilliant blue-white tunnel collapses into an infinite, silent blackness dotted with distant stars. And before them, dominating the viewport, hangs the Ash-Veil.\n\nIt is a terrifyingly beautiful sight. Vast, churning clouds of crimson and deep purple gas swirl like malevolent smoke, shot through with veins of ghostly white nebulae. Within its depths, strobes of internal lightning flash silently, briefly illuminating jagged fields of shattered asteroids and the skeletal remains of ships from wars long forgotten. It is less a nebula and more a cosmic wound, a graveyard that actively resists intrusion.","timestamp":"2025-06-16T23:53:27.751000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":72,"userName":"Storyteller"},{"id":"1384320004127719425","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s photoreceptors adjust, analyzing the swirling chaos. **\"Arrival confirmed. We are at the calculated entry point for the Ash-Veil. Warning: My sensors are detecting extreme gravimetric shear and high-density particulate clouds. Standard autopilot protocols are insufficient for safe navigation.\"** The droid turns its head to face its master. **\"Manual piloting is required. I can route primary sensor data directly to your console to assist with course correction, but your guidance will be paramount to our survival.\"**","timestamp":"2025-06-16T23:53:28.406000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":73,"userName":"GE-3"},{"id":"1384320005520228362","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The ship drifts at the edge of the storm, the first tendrils of gas licking at the viewport like ghostly fingers. The console flashes with proximity and radiation warnings. Guiding the aging freighter into the nebula's maw will require all of Dryzan's skill.","timestamp":"2025-06-16T23:53:28.738000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":74,"userName":"Storyteller"},{"id":"1384782037982122055","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The awe-inspiring sight of the nebula entrances Dryzan for a moment. Its swirling form captures an infinity of moments, countless tableaus of beauty and of terror swirling forever within its majestic form.\n\nHe slowly blinks, coming back to the moment as GE-3 lays out the situation.\n**\"Ok, I guess I should have known it would come to this.\"**\nDryzan resettles himself in the pilots seat, the well-worn material comfy and familiar, and flexes his fingers raising a chorus of cracks and pops from the joints. He lightly rests his hands on the controls, like a musician preparing for a grand performance.\n\n**\"Here we go.\"**\nHe begins to take them into the nebula, to whatever fate the swirling gas contains.","timestamp":"2025-06-18T06:29:25.861000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":76,"userName":"Dryzan Kar'dola"},{"id":"1385036668352073758","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"For a terrifying second, the ship is caught in a powerful gravimetric current. The freighter lurches violently to starboard, and a chorus of shrill alarms screams through the cockpit. A massive, jagged asteroid, previously hidden by the dense gas, tumbles directly into their path. The ship's frame groans, a sound of metal threatening to tear itself apart under the strain.\n\nJust as impact seems inevitable, Dryzan, guided by a surge of pure, desperate instinct and GE-3's precise vector callouts, yanks the control yoke hard. The aging engines scream in protest, pushing the ship into a roll that presses him deep into his seat. The freighter skims past the asteroid with centimeters to spare, the rock's sharp edge scraping a screeching gash along the ship's dorsal shields. The lights flicker, then hold.\n\nThe ship punches through the turbulent front, and suddenly, the violent roaring subsides. They emerge into a pocket of eerie calm, a bubble within the nebula where the gas is thinner, like the eye of a colossal storm. And there, suspended in the ghostly red glow, is the *Stardust Drifter*.\n\nIt is a silent, breathtaking leviathan. Far larger than Dryzan's freighter, it’s a relic of a bygone era of starship design—all hard angles, heavy plating, and oversized engine blocks. Its hull is pockmarked with centuries of micro-meteoroid impacts, but it appears otherwise intact. No lights burn within its countless viewports. It drifts, a ghost ship waiting in its tomb.","timestamp":"2025-06-18T23:21:14.472000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":78,"userName":"Storyteller"},{"id":"1385036670981767230","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s optical sensors focus on the derelict. **\"Target acquired. Analysis confirms vessel matches the profile of a High Republic-era Coalition Treasury-class transport. I am detecting significant structural integrity. However, there are no active power signatures, life signs, or communications.\"**","timestamp":"2025-06-18T23:21:15.099000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":79,"userName":"GE-3"},{"id":"1385036677931728986","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"A quick scan reveals what the schematics predicted: the main hangar is a mangled wreck, but a smaller, secondary cargo bay on the ship's underbelly seems to have a functional, though unpowered, outer door. The maintenance airlock near the aft section also appears viable. The ghost ship waits, offering two potential invitations into its silent depths.","timestamp":"2025-06-18T23:21:16.756000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":81,"userName":"Storyteller"},{"id":"1385197187511750698","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The abandoned ship is majestic despite its unusual design, lurking within the nebula like a glittering jewel shrouded by the swirls of cosmic dust. As Dryzan carefully maneuvers the old freighter around the larger vessel he can't help but be impressed for a moment by the size of the behemoth, before turning his attention to the next pressing concern - docking.\n\n**\"Glad to hear we don't have to worry about it falling apart on us - at least that's one less concern.**\n**I'm going to dock us at the maintenance airlock, then we're going to try for that terminal.\"**\n\nSuiting actions to words the Balosar's hands dance over the console, the familiar ballet of sliding the ship into a careful landing. This time there are no watchful guard patrols to avoid, just the baleful gaze of the vast nebula looking on as the far smaller vessel cozies up against the larger ship.\n\nAs the distance dwindles Dryzan drops the power until the ship is barely thrusting, slowly drifting in closer until the docking mechanism is close enough. With a sudden **THUMP** and a faint judder felt throughout the ship the mechanisms meet and lock, an airtight seal allowing safe transit through the void into the ancient ship.\n\nDryzan quickly finishes the shutdown of non-essential systems before rising from the comfortable haven of the pilot's chair. Grabbing his trenchcoat from where it is slung over the back of the copilot's chair he shrugs into it before turning to GE-3.\n\n**\"Ok, let's do it. Stick to the plan - we stay silent and make our way towards the nearest terminal. All being well we can access the systems and shut down the droids.**\n**Or, with my luck, the terminal will be no good and we need to go find the next one. If that happens we stay quiet and keep moving.\"**\n*And hope that we don't run face first into the security droids...* he can't help but think.\n\n*Man I wish I had some sticks left. 'One for the road' and all that.* he licks at his lips again, imagining the first instant of pleasure.","timestamp":"2025-06-19T09:59:05.222000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":85,"userName":"Dryzan Kar'dola"},{"id":"1385198099969998970","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As he strides towards the airlock he can feel his hands shake slightly. Not just mild withdrawal symptoms, but a manifestation of the tension and unease slowly building in his body, mixed with anticipation and even a hint of excitement. He realises that some small part of him can't help but feel excited at the idea of this adventure. Despite the likelihood of imminent death.","timestamp":"2025-06-19T10:02:42.769000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":87,"userName":"Dryzan Kar'dola"},{"id":"1385204837381181625","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The freighter, a minnow beside a dormant whale, drifts closer. Dryzan’s controls feel sluggish as the ship’s maneuvering thrusters puff against the void, nudging the vessel into position. The *Drifter*'s hull is a vast cliff face of pitted, dark metal, its sheer scale making the freighter feel fragile and insignificant. With a final, delicate push, the docking collar extends and meets the ancient airlock frame. There is a deep, resonant **CLANG** that echoes through the freighter’s structure, followed by the hiss and click of the magnetic clamps locking into place. The docking successful, a green light blinks on the console, indicating a hard seal. Outside, there is only the silent, swirling crimson of the Ash-Veil and the profound, unnerving stillness of the dead ship.\n\nDryzan powers down the primary systems, and the familiar thrum of his own ship dies away, replaced by an even deeper silence. The only light comes from the emergency strips along the floor and the steady blue glow of GE-3’s photoreceptors.","timestamp":"2025-06-19T10:29:29.093000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":89,"userName":"Storyteller"},{"id":"1385204839868399616","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s head swivels to face the airlock door. **\"Informative Statement: Docking seal is secure. External temperature is three degrees above absolute zero. Atmospheric pressure is zero. I have uploaded the schematics for this section of the vessel to your suit’s datapad. Proceeding is now contingent on the use of appropriate environmental protection.\"**","timestamp":"2025-06-19T10:29:29.686000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":90,"userName":"GE-3"},{"id":"1385204840858128416","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The airlock door of the freighter stands ready. Beyond it lies the outer door of the *Stardust Drifter*'s maintenance hatch, a portal into a silent, frozen tomb that hasn't known warmth or life for centuries. The environmental suits are stored in a locker by the main hatch, their helmets reflecting the dim cockpit lights. The plan is set. The only thing left is to take the first step.","timestamp":"2025-06-19T10:29:29.922000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":91,"userName":"Storyteller"},{"id":"1385228051998183425","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The silence is unnerving. Doesn't matter how many times he's had the ship 'dead' like this; hiding from authorities on an asteroid, drifting through interdiction blockades, once just because he was half out of his mind on death sticks and wanted to feel like he was drifting through space for eternity. Luckily he resisted the idea of jumping out of the airlock to experience it 'properly' that time.\nBut it never feels right. The oppressive stillness, as if his own ship has joined the *Drifter* and become a ghost in the nebula, to drift forever as a monument to his hubris coming here.\n\nIt's worse with GE-3 there, the looming silhouette with three blinding blue eyes burning through the darkness. The prospect of being hunted through the ghost ship by similarly spooky-looking droids does **not** make him feel good.\n\n**\"Come on, let's get this done. Check my suit integrity once I'm in - last thing I need is a leak slowly carbon poisoning me, or asphyxiating because I missed a latch.\"**\nHe struggles into the suit, slowly sealing and rechecking the connections, until GE-3 confirms he is ready.\n\n*Well, as ready as I can be.*\n\nKeying the hatch controls, the door hisses open to reveal the maintenance hatch. *No going back now.* he thinks, and begins opening the maintenance hatch to expose the dark, imagined horrors of the empty ship beyond.","timestamp":"2025-06-19T12:01:43.889000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":93,"userName":"Dryzan Kar'dola"},{"id":"1385236631077912677","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"GE-3’s head rotates 180 degrees to face Dryzan as he dons the bulky environmental suit. A thin, red beam projects from one of its optical sensors, methodically scanning every seam, latch, and joint of the suit.","timestamp":"2025-06-19T12:35:49.301000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":95,"userName":"Storyteller"},{"id":"1385236633242046575","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Suit integrity scan complete. All seals are secure. Oxygen levels are nominal. Internal heating element is active. You are prepared for extravehicular activity.\"**","timestamp":"2025-06-19T12:35:49.817000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":96,"userName":"GE-3"},{"id":"1385236634575831205","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a grunt, Dryzan cycles the airlock. The outer hatch of the *Stardust Drifter* groans open with a low, metallic shriek that sounds deafening in the silence, the ancient metal protesting its first movement in centuries. Dryzan freezes, every muscle tense, listening for any sign of response from the dark corridor beyond. The only sound is the echo of the hatch, which quickly fades into the oppressive, absolute quiet of the void. Nothing moves.\n\nThe corridor beyond is a black maw, untouched by any light. A fine layer of crystalline frost covers every surface, glittering faintly in the beam of Dryzan's shoulder-mounted lamp. The air that was once here has long since bled into space, leaving a perfect, frigid vacuum. The silence is so profound it feels like a physical pressure. Every shuffle of his magnetic boots on the deck plating, every puff of breath inside his helmet, feels like a thunderclap.","timestamp":"2025-06-19T12:35:50.135000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":97,"userName":"Storyteller"},{"id":"1385236635490324526","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid follows him through the airlock, its own metallic feet making soft, deliberate *clunks* on the frosted deck. **\"Informative Statement: We are aboard the *Stardust Drifter*. I am detecting no active power signatures in this immediate sector, which aligns with my projections for a dormant vessel. Proceeding with caution is advised. The designated route to terminal SEC-TERMINAL-CREW is forward, through the port-side maintenance shaft.\"**","timestamp":"2025-06-19T12:35:50.353000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":98,"userName":"GE-3"},{"id":"1385284513826996355","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Sure, and I bet it'll be as straightforward as it sounds.\"**\nHe turns to the large droid standing next to him.\n**\"That was sarcasm, in case you can't tell. I'm still not used to travelling with a droid.\"**\n\n*And can't imagine I ever will be, especially if this goes badly.*\n\nMoving carefully to minimise the noise that he makes, Dryzan cautiously maneuvers the suit along the darkened corridors. The slow pace is necessary not just for stealth, but for visibility - he has to keep pausing to rotate his torso, awkwardly playing the light over his surroundings. The beam from his suit sparkles and refracts off the ice crystals, a halo of thousands of tiny pricks of light outlining everything that he looks at.\n\nAs he proceeds deeper into the wreck his apprehension grows. Shadowy silhouettes in the corridor and reflections from the ice limning everything are transformed by his increasingly troubled mind into the looming form of security droids, lunging out to grab him and kill him. Beads of sweat run down his brow, and he automatically raises a hand to wipe them before it taps against the envirosuit helmet, reminding him that there is nothing he can do about it right now.\n\nSteeling himself, he continues creeping on in silence, GE-3 a not-quite-comforting presence behind him.","timestamp":"2025-06-19T15:46:05.438000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":100,"userName":"Dryzan Kar'dola"},{"id":"1385291624334233751","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Dryzan moves with a practiced silence, his magnetic boots making barely a whisper on the frosted deck. He uses the deep shadows cast by his lamp to his advantage, melting from one pool of darkness to the next. Every movement is deliberate, economical, the work of a man who knows how to be invisible. The silence holds, deep and absolute.\n\nBehind him, GE-3 follows with its steady, measured gait. But the droid's systems were not designed for the profound cold of the void. As it pivots to navigate a tight corner, a joint in its leg, its lubricants long since frozen solid, seizes for a fraction of a second before releasing with a sharp, piercing **CRACK-CLANG!** that echoes down the metal corridor like a gunshot. The sound, amplified by the perfect vacuum and utter silence, seems to vibrate through the very structure of the ship.","timestamp":"2025-06-19T16:14:20.715000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":102,"userName":"Storyteller"},{"id":"1385291626385244222","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid freezes mid-stride. Its head swivels to look at the offending leg, then back to Dryzan. **\"Apologetic Statement: A thermal-induced stress fracture has occurred in my primary knee actuator. This has resulted in an unscheduled, high-decibel acoustic event. My stealth efficacy has been compromised.\"**","timestamp":"2025-06-19T16:14:21.204000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":103,"userName":"GE-3"},{"id":"1385291627852988436","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"For a tense moment, there is only the echo. Then, from the darkness far down the corridor, a new sound answers: a low-power hum, followed by the distinct whir of ancient servos activating after centuries of slumber. A single, baleful red light ignites in the distance, a malevolent star in the oppressive black. It begins to move, sweeping the corridor in a slow, methodical patrol pattern. They are no longer alone.","timestamp":"2025-06-19T16:14:21.554000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":104,"userName":"Storyteller"},{"id":"1385338673213603873","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The sound shatters the near silence of his world, so loud that Dryzan startles and half jumps around.\n\nDryzan hisses **\"Krif! You scared the life out of me!\"**\n*Not to mention nearly made me soil this envirosuit.*\n**\"I thought you would be rated for-\"**\nHe cuts off as he becomes aware of the change further away, an almost primitive sense flaring alive to warn him.\nHe spins, catching sight of the terrible red light, and seeing it begin to move.\n\nThey are being hunted.\n\n**\"Krif, krif, krif, ok we need to get away. Is it between us and the terminal? And is there a access hatch that will get us into another corridor or into the maintenance ducts?\"**\n\nHe begins frantically trying to recall the schematics, while hoping that GE-3 will be able to supply the information that he is desperately hoping for before he can find out the accuracy of his own memory.","timestamp":"2025-06-19T19:21:18.042000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":106,"userName":"Dryzan Kar'dola"},{"id":"1385342099330961519","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s optical sensors analyze the approaching red light, cross-referencing it with its internal database. **\"Negative Statement: The activated unit is positioned between our current location and the designated security terminal. Our planned route is compromised.\"**\n\nThe schematic on the droid's chest flickers, updating instantly. The blue line representing their planned path now has a large, red X over it.\n\n**\"Analysis of schematics indicates a maintenance access hatch is located three meters to our immediate left. It provides entry to a network of unpressurized Jefferies tubes. This route is not on the primary schematic but offers an alternative path to the crew sector, bypassing this corridor.\"**","timestamp":"2025-06-19T19:34:54.892000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":108,"userName":"GE-3"},{"id":"1385342101457207372","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The single red light down the hall resolves into a glowing optic set in a blocky, armored chassis. The security droid moves with a heavy, rhythmic *CLOMP... CLOMP...* of magnetized feet, its head swiveling from side to side. The whirring of its servos is a low, menacing grind that seems to drill into the silence. It hasn't spotted them yet, but its methodical advance is closing the distance with every second.\n\nDryzan's suit lamp sweeps to the left, illuminating a low, rectangular panel set flush against the corridor wall, its edges thick with frost. It’s held in place by four large, old-fashioned manual locking bolts. It's a potential escape route, but getting it open without making more noise will be a challenge. The red eye of the approaching automaton continues its slow, relentless sweep of the corridor.","timestamp":"2025-06-19T19:34:55.399000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":109,"userName":"Storyteller"},{"id":"1385563544397025281","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He stares at the iced over panel and the possible escape that lies behind it. Then back at the advancing droid, and then down to the panel again.\n\n**CLOMP.. CLOMP..**\n\n*Every second that I waste thinking is bringing it closer, I need to DO something!*\n\nDryzan quickly bends down next to the vent, running his fingers over the edges.\n*There has to be a way to open it, there HAS to be!*\n\nHis breathing grows faster as he works, his mind fighting against his body's growing fight-or-flight response as the ancient sentinel continues its menacing advance.","timestamp":"2025-06-20T10:14:51.510000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":111,"userName":"Dryzan Kar'dola"},{"id":"1385564344263381052","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Come on, come on, there has to be a way...\"** he murmurs quietly, as his fingers continue working on the panel.\nFinally he feels something beginning to give, and has to force himself to continue working slowly and methodically instead of just yanking at the panel in desperation.\nSweat prickles across his back, running down between his shoulder blades as he imagines the droid advancing down the corridor towards him, closer and closer.\n*Come on, come on, got to get this open before it detects us!*","timestamp":"2025-06-20T10:18:02.213000+00:00","edited_timestamp":"2025-06-20T10:18:23.245000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":113,"userName":"Dryzan Kar'dola"},{"id":"1385565375181230081","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Dryzan Kar'dola","avatar":"5abab7a0510c15683419ce1a35550315","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Eventually the hatch separates enough that he can swing it open, the tighter confines of the dark maintenance tube revealed. Moving quickly and carefully, Dryzan beckons GE-3 into the tube, before turning to close the panel behind them and cover their escape.\n\n*I don't know if it will be able to detect us behind this. It's nearly here, krif it's going to find us, krif krif krif.....*\nHe freezes in position, unsure exactly how close the droid is to them.\n*Is that a hint of red bleeding through the panel? Is it outside? Is it moving past?*","timestamp":"2025-06-20T10:22:08.003000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":116,"userName":"Dryzan Kar'dola"},{"id":"1385578146799292567","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With a final, delicate twist, the last locking bolt slides free with a soft, satisfying *thwick*. The panel, no longer held by the pressure of its ancient seals, swings inward with a low groan. Dryzan doesn't hesitate, scrambling into the pitch-black, narrow opening and frantically gesturing for GE-3 to follow. The droid steps into the tube with an unnerving lack of urgency, its chassis scraping against the sides of the confined space. Dryzan reaches back, pulling the heavy panel shut just as the rhythmic *CLOMP... CLOMP...* of the security droid grows deafeningly loud.\n\nThey are plunged into near-absolute darkness, a cramped metal coffin barely wide enough for them to stand single file. The only light comes from the faint blue glow of GE-3's photoreceptors and the low-level illumination of Dryzan's own suit hud. The metal is freezing cold even through his suit, and the vibrations of the approaching automaton travel directly through the wall into his back.\n\nThe *CLOMP* is right outside now. A brilliant, terrifying sliver of red light slices through the thin seam of the hatch, painting a stark crimson line across Dryzan's helmet visor before sweeping past. The heavy footfalls continue, growing marginally softer as the droid proceeds down the corridor, its patrol route uninterrupted, its quarry unnoticed. The silence it leaves in its wake is somehow even more terrifying than the noise.","timestamp":"2025-06-20T11:12:52.994000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":118,"userName":"Storyteller"},{"id":"1385578149089382578","channel_id":"1381783775301734441","author":{"id":"1382501818768298095","username":"GE-3","avatar":"0cf8e808b45e617cdf06e607b903ded3","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The droid’s blue optics pierce the darkness of the maintenance tube. Its voice is a low, synthesized whisper over the private suit-to-suit comm. **\"Analysis: The patrol unit did not deviate from its programmed path. Our thermal and acoustic signatures remain undetected behind this shielding. Probability of immediate discovery has been reduced to one point three percent. Advisory Statement: This network of maintenance tubes is unmapped on the primary schematic. I will need to perform real-time scans to chart a path toward our objective.\"**","timestamp":"2025-06-20T11:12:53.540000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1382501818768298095","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":119,"userName":"GE-3"}]