[{"id":"1436385023728160768","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"***A long time ago in a galaxy far, far away....***\n\n# **STAR WARS**\n## **FORGOTTEN ONES**\n### **Episode III: Beneath the Glare**\n\nThe ancient cryo-ark Venture finds safe harbor at last, docked discreetly within the bustling tibanna mining colony of CLOUD CITY. Rescuedhe FORGOTTEN ONES—Wes, Iyola, and Varda—begin to grapple with their impossible awakening, centuries removed from their own time.\nUnder the stern but pragmatic guidance of Mandalorian CHIEF GHURN SKIRATA, commander of the elite Kando’s Coursers, a tentative alliance is formed. While repairs begin on their mysterious vessel, the refugees accept new identities and their first assignment: a discreet mission into Cloud City’s gleaming CASINO DISTRICT.\nBut even amidst the high stakes of corporate intrigue, unseen forces stir. As a shadowy rival makes its move, a fleeting, unknown energy signature—the whisper of a long-lost pinnace—is briefly glimpsed far beyond Bespin’s luminous clouds, hinting that the galaxy’s ancient past holds more secrets than even the Empire dares to imagine...","timestamp":"2025-11-07T16:01:16.400000+00:00","edited_timestamp":"2025-11-07T16:22:53.081000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1436747662643695716","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Morning on the *Atin Oya'ka*'s galley gradually gives way to the bustling efficiency of Ghurn Skirata's operations. The scent of freshly brewed caf now mixes with the crisp, filtered air of a space ready for work. Having concluded their meal and received their mission briefing from Chief Ghurn and Serena Foss, the *Venture* crew is now prepared to embark on Operation: Blind Sight. Each carries their newly issued data card, laden with temporary identities, mission parameters, and a discreet stipend of credits.\n\nArno, the lead Mandalorian enforcer, waits at the gangplank, a silent, armored figure ready to guide them. Their path will take them through the hidden operational zones of Kando's Coursers, then into the public thoroughfares of Cloud City, and finally into the glittering labyrinth of the Casino District. It is a world removed from their pasts, and from the quiet solace of the *Atin Oya'ka* and Kando'sCoursers compound.","timestamp":"2025-11-08T16:02:16.255000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1436747664829059337","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Arno Skirata","avatar":"c713c7c52595b9aa96f14e6a3e8cb399","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"** \"Follow me,**\" Arno's vocoder-filtered voice is calm, professional, and entirely devoid of inflection. Arno pivots sharply and sets a brisk pace, leading them from the *Atin Oya'ka*'s gangplank and into the heart of Kando's Coursers' secure facility.","timestamp":"2025-11-08T16:02:16.776000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Arno Skirata"},{"id":"1436747675784708512","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The private hangar bay is now a hive of silent, focused activity, with only automated cleaning droids gliding across the polished floor and specialized maintenance droids attending to the *Venture*'s external hull. The metallic tang of coolant and ozone hangs faintly in the air.\n\nTheir route takes them through a series of increasingly nondescript, utilitarian corridors, far from the polished client-facing offices. These are the logistical arteries of Kando's Coursers: bustling storerooms filled with secured cargo, equipment staging areas, and power conduit junctions, all marked by functional Mando'a script and humming with contained energy. Arno maintains a swift, unyielding pace, allowing no time for lingering or idle observation.\n\nFinally, they arrive at a heavy, unmarked durasteel door that blends seamlessly into a sheer plasteel wall. With a quick tap from Arno's gauntlet, a soft chime sounds, and the door slides open, revealing a brightly lit, bustling concourse of Cloud City's Port Town. The transition is instantaneous, a jarring shift from quiet, controlled privacy to a chaotic symphony of galactic life.","timestamp":"2025-11-08T16:02:19.388000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1436747678804606976","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Arno Skirata","avatar":"c713c7c52595b9aa96f14e6a3e8cb399","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"\"**The exit to public access is secured. Once outside, adhere to Cloud City's standard public transport and security protocols. When you return, tap your ident chips on the terminal to enter and security will clear you. **\" He indicates the console to the side of the entry into the compound.","timestamp":"2025-11-08T16:02:20.108000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Arno Skirata"},{"id":"1437137868622663741","channel_id":"1435992787584679936","author":{"id":"352982222636187659","username":"yogi_001","avatar":"42efdd81c920262f5537ca8c4a23e619","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Yogi","avatar_decoration_data":{"asset":"a_c12a5c953352c20bd6e63576e2cce3a0","sku_id":"1440174638930853956","expires_at":1768507200},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"552020084776763413","identity_enabled":true,"tag":"TCP","badge":"b184c153dc04b7955c319eb864d31d79"},"primary_guild":{"identity_guild_id":"552020084776763413","identity_enabled":true,"tag":"TCP","badge":"b184c153dc04b7955c319eb864d31d79"}},"content":"With the meeting concluded Wes grabbed his helmet and stood.  Looking at Ghurn and Serena he gave them a nod.  **”I will just need a short time before leaving.”**  There was a small nod from Ghurn that he took as acceptance.   Looking at Iyola and Varda he gave both a smile.  **”I’ll be back in a few moments.”**  With that he tucked his helmet under his arm and left the table and moved towards the loving quarters.   \n\n\nWith the door to his room still open he ejected his lightsaber and removed it from the right forearm vambrace.  Taking it would be dangerous.  He let out a breath and with conscious thought replaced the weapon back into its secretive and protected place.   When it was secure he closed up the compartment.  With a nod to himself the first of three things were done.   \n\n\nNext he accessed his bracer computer.   Slotting a storage disk he copied over any relevant data as to who he was on to the disk.  Then deleted the info from the device.  After placing the datacard on the room's small desk he grabbed the new ident chip and slotted it.  Within a few seconds his new identity was copied over as he slipped the new chip into a compartment on his utility belt.   \n\n\nHe looked at the new details on the screen.   Satisfied he opened up his messages.  There had been no response from Nadia of what he had sent her.  Still he decided to reach out and started a message.  \n\n\n*”Ghurn said you were going to take some rest.  Good.   Take what you need.  The file I sent you, I hope it was enough info.  If you need more to help find Marina let me know.  There are a couple other names of Jedi I can give you.  Others that she worked alongside with Silas towards the end of the war.  Thank you for helping Nadia.  This means a lot to me. \n\nWes”*","timestamp":"2025-11-09T17:52:48.610000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"yogi_001"},{"id":"1437137959093796924","channel_id":"1435992787584679936","author":{"id":"352982222636187659","username":"yogi_001","avatar":"42efdd81c920262f5537ca8c4a23e619","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Yogi","avatar_decoration_data":{"asset":"a_c12a5c953352c20bd6e63576e2cce3a0","sku_id":"1440174638930853956","expires_at":1768507200},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"552020084776763413","identity_enabled":true,"tag":"TCP","badge":"b184c153dc04b7955c319eb864d31d79"},"primary_guild":{"identity_guild_id":"552020084776763413","identity_enabled":true,"tag":"TCP","badge":"b184c153dc04b7955c319eb864d31d79"}},"content":"He hit send on the message and turned towards the door.   His eyes fell on the jet pack.   Seeing it brought forth a memory of when he and Marina found it on Fakir.  Picking it up he brought it over his head and let it fall into place securely on his back.   Putting his helmet on his HUD sprang to life and he saw the readout as the jetpacks reading linked up.   All was green and ready to go.   \n\n\n*****\n\n\nHe stood with the others as Arno opened the secured door.   The brightly lit concourse waited for them just past the doors archway.  Instantly he could hear the noise filter in.  They were about to reenter life within the galaxy.   For him it was a short nine years.  For Iyola and Varna it was hundreds.  **”Ready?”** He asked as his presence shifted into a persona he hadn’t used in many years.   A bodyguard protecting his clients.  With a purposeful and confident step he passed through the door into the hallway.  His head moving, eyes and senses alert.","timestamp":"2025-11-09T17:53:10.180000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":0,"flags":0,"components":[],"userName":"yogi_001"},{"id":"1437182536043466894","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola had swapped her datapad out for a blank one which just had her new ID on it, and a few downloads of current ag products.  It wasn’t like she had that much data anyway.  As Serena had advised, she hid away her ascender and some of her gems in her room. \n\nWes popped back out.  He had gone into full Mandalorian mode.  He was even wearing a jetpack.  Iyola felt a pang of jealousy.  She would love to have a jetpack.  She’d ask him about it later.  \n\n**“I’m ready,”** said Iyola. ** “Let’s go, Kalen.”**  It took every ounce of self-control she had not to sprint   ahead of Wes, but he was supposed to be a bodyguard, and she didn’t think Varda - *Morra* - could move that quickly, spry as the older woman was.  This undercover thing might be more challenging that she had expected.  \n\nThe doors opened on the new world, and Iyola breathed it in.","timestamp":"2025-11-09T20:50:18.153000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1438246520141906043","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda emerges from her quarters like a storm calmed only by intent. The faint shimmer of motion draws the eye first the soft clink of gemstones woven through her braids catching the corridor light. The dull shimmer of those jewels, once sleeping in a pouch, now breathe with quiet life against the dark strands of her hair tiny constellations in orbit around her composed expression.\n\nGone is the tattered, travel-worn cloak that once swallowed her shape. In its place, she wears a clean white blouse that glows faintly under the ship’s lights, the fabric loose at the sleeves but neatly cuffed, whispering of old ritual finery rather than simple comfort. Her skirt flows in soft, deliberate layers, each hem traced with hand-painted storm sigils, spirals of cloud and wave, threads of lightning inked in silver-blue that shimmer like memory. The small gemstones sewn between the patterns catch with every step, turning her movement into a slow dance of refracted light.\n\nWhen she pauses at the doorway, she looks less like a soldier of fortune and more like something ancient pretending at civility. A seer dressed for a kings court or a witch attending a masquerade. Her eyes sweep the others with quiet amusement. \"**Well,**\" she says, her voice smooth as riverstone, \"**if we’re to mingle among the high tables, I suppose it pays to look the part. One never knows what the Force might whisper between a shuffle and a spin.**\"\n\nThen, with that familiar glimmer of irony in her tone. \"**Besides… if fate intends to cheat, I’d rather she think me beautiful while she does it.**\" She holds a hand out to Iyola. \"**My dear?**\"","timestamp":"2025-11-12T19:18:11.730000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Varda Nisyren"},{"id":"1438305237671739455","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola marvels as “Morra” steps into the room. She wonders if she brought that ensemble with her or had somehow acquired it.  She laughed at the notion of handing Ghurn Skirata a shopping list. \n\nVarda - or Morra - held out her hand. *Well, there were some family concerns, weren’t there?  No reason they couldn’t be both relatives and coworkers.*\n\n**“You look wonderful, Granny Morra!”  **said Iyola.  She took the proffered hand.** “And yes, I’m ready to hit the town!” ** *Planet.  Whatever. *","timestamp":"2025-11-12T23:11:31.080000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1438600041903165502","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The door slides open, and the *Venture* crew steps into the dizzying, vibrant, and utterly overwhelming reality of Cloud City.\n\nThe Port Town concourse hits them like a physical wave: a cacophony of a thousand languages, the rush of air currents, the flashing neon of advertisements for every service imaginable. Throngs of aliens – Rodians, Twi'leks, Gran, Humans, and other less seen species – jostle for space. Overhead, automated cargo haulers hum along designated routes, ferrying goods between immense storage towers, while smaller utility vehicles zip across transparent gantries. The air hums with kinetic energy, a pulsating symphony of commerce and life. The ground beneath their feet is polished durasteel, slick with the footprints of countless hurried steps. For Iyola and Varda, centuries melt away in the sudden sensory overload; for Wes, the nine years feel like a lifetime. Even Dryzan and Vaeros, accustomed to bustling cities, visibly register the sheer density of activity. Misha, eyes wide with overwhelmed curiosity is momentarily lost in the surge of bodies.\n\nFollowing directions to the public transit, they board a gleaming sky-tram, the vehicle a blur of motion. The ride carries them swiftly upwards, offering panoramic glimpses of the city’s colossal, curving architecture. The industrial sprawl of Port Town quickly gives way to meticulously maintained green zones, residential towers soaring into the endless Bespin sky, and finally, the district of unparalleled opulence.","timestamp":"2025-11-13T18:42:57.886000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1438600067761180755","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The sky-tram comes to a smooth stop at the heart of the **Casino District**. As they step out onto a grand promenade, the transition is instantaneous. The light here is softer, warmer, filtering through massive stained-glass ceilings. The cacophony of commerce fades, replaced by the sophisticated murmur of high society, the distant, melodic chime of slot machines, and the smooth, professional voices of lounge singers. Gold and polished chromesteel dominate the architecture, reflecting endless, sparkling vistas of Bespin's breathtaking clouds. Waiters in pristine uniforms glide by with trays of exotic drinks, while well-dressed patrons, a mixture of corporate elite, underworld figures, and wealthy tourists, mingle with an air of practiced nonchalance. \n\nSerena's maps prove accurate. With minimal effort, they locate their first target: the elegant entrance to **The Ruby Sun Lounge**, its double doors crafted from burnished bronzium, flanked by discreet, unblinking security sensors. A soft red light filters from within, hinting at luxury and hidden conversations.","timestamp":"2025-11-13T18:43:04.051000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1440859750525829261","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola soaks it all in. Cloud City is not the usual sort of place she finds herself, but it’s beautiful in its own right.  \n\nShe looks down at herself.  Her jacket is as clean as it will ever be, its blue-green color contrasting with the orange and gold of the Bespin clouds. She’s taken a decent shower, or at least better than the ones on the underpowered Venture, and her hair is shiny and more on the dark blonde than light brown side of the color equation.  She would even consider wearing makeup, if she had any, but they hadn’t made a stop at any of the glistening storefronts she’d spotted on the tram.\n\nThey reach the Ruby Sun.  It’s even fancier than she had expected. But it’s still a cantina, and she knows cantinas.  She looks at her companions, then walks toward the door.","timestamp":"2025-11-20T00:22:14.405000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1440859753482813552","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes stood next to the two women.   The concourse in front of the Ruby Sun Lounge was busy.   Throngs of people hurried past.   His helmet slowly turned from side to side as he watched the groups of people.   Some were families, others were alone.  All had come to partake in the exuberance of the city's offerings.  He stepped a bit closer to Varda.   She was now Morra.   His employer and charge.  Iyola, now Tira looked like she was ready to bust through the door into the lounge.   He smiled beneath his helmet as he could sense the excitement within her.  \n\n**”Shall we enter?”**  He asked.   His voice was flat, void of emotion as it came through the vocoder.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-11-20T00:22:15.110000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1440859754476863602","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**Sure thing, Kalen,”**  Iyola said, trying the name out.**  “In fact, you can even get the door for us.”**  It would be amusing, pretending a Mandalorian worked for her, and Iyola intended to make the most of the opportunity. She rested her hand on “Morra”’s arm reassuringly, looking with interest at the other customers approaching the portal.","timestamp":"2025-11-20T00:22:15.347000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1440859882797662289","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes raised an eyebrow as Iyola asked him to get the door.  It was then he realized that she was going to have fun with the setup they were planning.  His gaze left her and quickly scanned the area before it returned to Iyola.  With a nod he moved to the doors and opened one.  Looking through he peered into the lounge.  As expected no one gave an obvious glance his way.  \n\n\nTurning he looked back at his two charges.  **”Miss Ves, Madam Narn.”**  As they walked past he looked inside once again. **Once again do be wary.  This place is not like home.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-11-20T00:22:45.941000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1440859885041487922","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**“Not like home?  I should certainly hope not!’  **said Iyola. ** “I don’t come to Cloud City because I want something like home.”  **\n\nThere was no obvious security at the door. *That probably meant there was a lot of security. * It didn’t matter to Iyola.  She practically sailed through the portal, tugging Varda behind her.","timestamp":"2025-11-20T00:22:46.476000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1440860854831550475","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As Wes, now fully embodying Kalen Rynn the vigilant bodyguard, holds the bronzium door open, the low murmur of the Ruby Sun Lounge spills out, wrapping around them like a rich, warm cloak. Iyola, adopting her persona of Tira Ves, practically sails through the portal, a current of restless energy pulling Varda (Morra Narn) gently in her wake. Wes follows, his armored presence a stark contrast to the lounge's opulent interior.\n\nThe Ruby Sun is a masterclass in understated luxury, a stark deviation from the glittering neon chaos of the Casino District outside. The lighting is low and warm, cast in deep amber and crimson hues from concealed projectors and glowing liquor bottles lining a vast, curving bar. Plush, synth-velvet banquettes in shades of ruby and amethyst ring the room, offering secluded intimacy, many of them partially obscured by intricate privacy screens woven from shimmering metallic threads.\n\nThe air is thick with the mingling scents of expensive alien spirits, exotic spices from small appetizer plates, and subtle, high-quality perfumes. Soft, instrumental jazz-fusion, rich with brass and synthesized strings, drifts from unseen speakers.","timestamp":"2025-11-20T00:26:37.692000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1440860878483357777","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The clientele is as exclusive as the decor: corporate executives in tailored suits, elegantly dressed socialites with elaborate hairstyles, and discreetly armed private security personnel who blend seamlessly into the shadows. Their conversations are a low, polished hum, punctuated by polite laughter and the occasional clink of expensive glassware. It's an environment of calculated leisure, designed for deals to be struck and reputations to be made—or subtly broken—far from the raw spectacle of the gaming tables.\n\nThe long, curving bar is sparsely populated, a few lone figures nursing drinks, while most of the activity seems concentrated in the more private banquettes and alcoves. There are no obvious \"Gilded Grasp\" banners or signs, no overt indicators of corporate rivalry. Discretion, it is clear, is the supreme currency here.","timestamp":"2025-11-20T00:26:43.331000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1441155629430345850","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":null,"discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda let's her eyes travel over the clientele with knowing eyes and a small smirk at her lip. Linked arms with Iyola she lets the exitsbke young girl drag her through. Her eyes trail the slow curls of smoke and she breathes in the atmosphere. In a strange twisted way it reminds her of home","timestamp":"2025-11-20T19:57:57.433000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Varda Nisyren"},{"id":"1441213844759515159","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola glances around the cantina, if that’s even the right word for this establishment.    Everything here is subdued and expensive, or at least it looks that way.  Not a lot of synth-hide jackets here; her coat’s blue-green hue seems to actively clash with the color scheme here.  Varda - Morris - looks glamorous, and Wes/Kalen looks like a wall of metal to her.  *I guess that’s the point.*\n\nWell, time to test out how many credits the Skiratas put on her chip.  She eyeballs the beings at the bar to see if any of them look particularly interesting before selecting seats for her ersatz grandmother.  Kalen can stand, of course.","timestamp":"2025-11-20T23:49:17.049000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1441776923175948432","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes stepped through the bronzium closely behind the two women who were now under his watch.  As the door closed the opulence of what lay before the three of them settled in.   What he had envisioned based on what info they had been given didn’t quite match up.  \n\n\nHis head swiveled while talking in the surroundings.  Corporate executives, and socialites who were finely dressed quietly socialized.  Discrete private security was also present blended into the scene.  Unless one was looking they would probably go unrecognized.   However he was looking.  He noticed more than one discrete glance in their direction.  \n\n\nWhile  the other private security blended in he stood out.  Stood out in a way that was obvious and he preferred it that way.  He moved to the side of Morra and looked at the two.   **”Have you decided where you’d like to sit?”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-11-22T13:06:45.405000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1441951675639402566","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The lounge hums with an undercurrent of quiet power. As Wes positions himself protectively beside Varda, his heightened senses immediately pick up on the subtle, assessing glances cast their way. He is, undeniably, a striking presence—the armored figure amidst the suits and silks. More than one discreet security detail subtly shifts position, their attention piqued.\n\nVarda’s eyes, old and wise, linger on the rising curls of smoke from a nearby table where a slender, impeccably dressed human woman, seemingly engrossed in her datapad, absently toys with a delicate piece of jewelry that flashes with a subtle, almost imperceptible gleam under the ambient lighting. The jewelry emits a very faint, nearly inaudible high-frequency hum – just on the edge of audible range if one were straining to listen in the quiet lounge.","timestamp":"2025-11-23T00:41:09.639000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1441951696506064987","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola, her own vibrant jacket a cheerful defiance to the room's muted elegance, surveys the bar. Three patrons occupy stools. One, a burly Gungan, nurses a brightly colored drink, his webbed hand idly rubbing at his chin, occasionally glancing at a discreetly tucked commlink. Another, a nervous-looking human male in a rumpled corporate uniform, repeatedly checks his wrist chrono, a clear sign of impatience or distress. The third figure, a sleek Mirialan female, is in a hushed, animated conversation with an unseen party via a tiny earbud comm, her expression a mix of frustration and guarded hope. None overtly fit the descriptions of Gorok or Xylo from the dossier.\n\nThe most secluded banquettes are currently occupied, mostly by hushed groups. However, there are a few open spots, including a slightly elevated booth near a panoramic viewport offering a breathtaking (and distracting) view of Cloud City, and another booth set deep within a shadowy alcove closer to the bar, offering maximum discretion. Each offers a different vantage point for observation. The faint, metallic taste of ozone from the air purifiers is pervasive, hinting at the technology constantly at work maintaining the lounge's pristine atmosphere.","timestamp":"2025-11-23T00:41:14.614000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1441991919201812610","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola squints at the beings sitting at the bar.  All of them seem to be more or less preoccupied.  Th*ey’re not relaxing here, they’re working.*  She looks over at the booths. They’re both appealing for different reasons - the view of the cloudscape of the city is stunning, and the shadowy booth, she supposes, is better for the reason they’re here - observation. \n\n*But they don’t all have to be observing the same thing at the same time, right? *\n\n**“Why don’t you grab a booth, Morra?” ** said Iyola.  *Tira. I'm Tira*. “**Either one. I’ll grab a drink at the bar and join you over there.” **That would spread them out to observe over a greater swath of territory, but really, she just wanted to order from the cantina tender and see things up close.  She feels weirdly excited.  Here she is, 200-odd years in the future, on a secret mission.  She’s really here.","timestamp":"2025-11-23T03:21:04.452000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1443424041510633532","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola confidently approaches the long, curving bar, its polished synth-stone surface reflecting the ambient crimson light. Behind it, a sleek human bartender, impeccably dressed in a black uniform with the casino's sigil pinned to his lapel, meticulously polishes a glass. He is a picture of detached professionalism, his expression neutral.\n\nIyola slides onto an unoccupied stool near the nervous-looking human male, who is still checking his chrono with agitated frequency. The burly Gungan and the Mirialan female continue their subdued activities further down the bar, seemingly oblivious.\n\nThe bartender glides over, his movements fluid. **\"Welcome to the Ruby Sun, ma'am,\"** he says, his voice smooth and polite. **\"What can I get for you this morning?\"** The gentle hum of concealed air purifiers and the soft strains of jazz-fusion fill the brief silence, the subtle glow from the liquor bottles illuminating Iyola's eager face. The vibrant hum of the Casino District outside is a faint whisper, entirely muted within the opulent confines of the lounge.","timestamp":"2025-11-27T02:11:49.018000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1443431021508038667","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes watched as Iyola headed off towards the bar.  He gave her a nod and made sure to look over anyone who was going to be in her vicinity.  He turned back to Varda.   And gestured towards the elevated booth.  While it was out in the open it also offered an unfettered view of the establishment.  Which is what they were looking for.   To see and be seen.   **”This way, Madam Morra.”**  His voice was clear through the helmet's vocoder.  \n\n\nWes walked alongside Varda as he looked around into the booths as they passed.  Taking note of the race and sex of the occupants.   He was also keeping an eye out for those they were briefed on.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-11-27T02:39:33.179000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1443643862202450033","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola idly watched the crimson light reflect off her blue-green jacket, making its hue appear more purple.  Her eyes swept back up at the bartender.  He was restrained, professional, almost clinical.  *It can take a bit of work to warm up cantina workers.* This isn’t the kind of venue where she’ll get anywhere sliding a gem across the counter.  She’ll start by ordering one of her favorite drinks.  \n\n**“I’ll have a Coronet Scramble,”** she said. The name of the beverage was a reference to Coronet City on Corellia, as it was a Corellian whisky-based drink, typically mixed with sunfruit liqueur and jogan juice, and topped with bubbling water. \n\nAs she waited, she glanced over at the nervous human, giving him a brief, reassuring smile","timestamp":"2025-11-27T16:45:18.355000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1444065423115948218","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The bartender offers a polite, unreadable smile as Iyola orders. **\"A Coronet Scramble, a fine choice, ma'am,\"** he responds smoothly, his hands already moving with practiced efficiency as he reaches for a selection of gleaming bottles behind the bar. He doesn't offer any personal chatter, his focus entirely on crafting the drink with precision.\n\nMeanwhile, Wes guides Varda towards the slightly elevated booth by the panoramic viewport. The seating is plush, designed for comfort and unobtrusive observation. As they move, Wes's sharp eyes scan each occupied banquette, subtly noting species, attire, and general demeanor. He clocks a few high-value targets, easily identifiable by their corporate insignia or the hushed intensity of their conversations, though none yet match the specific dossiers provided by Serena.\n\nHe notes the human woman from earlier, still engrossed in her datapad in a nearby banquette, her subtle, gleaming jewelry flashing imperceptibly. He catches the lingering glance of a Besalisk businessman at another table, seemingly engrossed in his drink, but whose multi-jointed fingers tap a peculiar, almost rhythmic pattern on the synth-stone table edge—a potential tell. The discreet security guards, meanwhile, continue their subtle vigilance, occasionally shifting their gaze towards the newcomers, their focus professional and unwavering.\n\nThe Ruby Sun, while an open network for its elite clientele, is a place where discretion is a form of armor. No one makes overt moves, but every interaction carries a weight, every glance a potential query.","timestamp":"2025-11-28T20:40:26.309000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1444371759846527128","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes walked slowly alongside Varda as they somewhat meandered towards  the elevated booth.  His steps were slow to stay next to his companion.  As he led the way he made sure the area was secure.  Careful to not let his gaze linger for too long on any one booth or persons.  He was here as hired protection.   The others like him simply did the same as they walked past.  More than one nod was returned as they slowly moved towards their destination.   \n\n\nArriving at the elevated booth Wes stood to the side awing Varda access so she could sit.  **”Miss Ves will be along momentarily Madam Morra.”**  His vocoder was low.   As Varda played up the image of an old woman taking a seat upon the plush seating of the booth he stood by as her vigilant guardian.  He took one last look around their immediate area noting anyone or thing of importance before facing the entrance.  His eyes and Force enhanced senses open and alert.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-11-29T16:57:42.677000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1444400782257684692","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"This is the oddest cantina Iyola has ever visited. It doesn’t seem like a cantina at all.  It reminds her of something else - well, it will come to her.  The male human continues to fiddle with his chrono, seemingly taking no note of her or anyone else at the Ruby Sun.\n\n\nShe takes an exploratory sip of the Coronet Scramble.  It’s absolutely delicious, smooth as a bolt of spidersilk.  She has to focus on not drinking it too quickly.  \n\n**“This is wonderful,” **she says to the bartender. **“Did you use an infused whisky?  The sunfruit is so pronounced.”  **\n\nIt suddenly comes to her.  This cantina reminds her of the waiting room at the acute ward of Rhinnal Medical.  *Everyone here is on edge, looking like they’re expecting to get bad news.  *\n\nShe glances at Wes and Varda, who have claimed a plush elevated booth.  It looks nice.  She’ll take a few more sips, then join them.","timestamp":"2025-11-29T18:53:02.159000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1444683521825308884","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The bartender, his hands moving with fluid precision as he polishes the synth-stone surface, offers Iyola a polite, almost imperceptible smile.\n\n**\"The Coronet Scramble is indeed a house specialty, ma'am,\"** the bartender confirms, his voice smooth and neutral. **\"We use only the finest Corellian whisky, infused in-house with hand-selected sunfruit for its bright, pronounced notes. Our clientele expects nothing less.\"** He doesn't offer a name or any personal detail, maintaining a detached professionalism, then subtly shifts his attention to discreetly wipe down a section of the bar, allowing Iyola her moment of observation.\n\nAs Tira sips her drink, a growing unease settles over her initial excitement. The lounge, initially perceived as subdued elegance, now hums with a palpable tension beneath the surface. The continuous, anxious chronometer checks of the nervous human at the bar, the Besalisk's rhythmic finger tapping, the almost too-still focus of the Mirialan's hushed conversation – it all solidifies Tira's sudden, unsettling realization. This isn't relaxation. It's a waiting game.\n\nMeanwhile, Wes, the impassive Kalen Rynn, positions himself as Morra Narn's vigilant guardian. From his vantage point, he maintains a sweeping scan of the lounge, his internal sensors—both natural and Force-attuned—sifting through the layers of ambient conversation and suppressed emotion. He notes the subtle shifts in eye contact from the private security details, a professional acknowledgment of his own imposing presence. His gaze flickers briefly to the elegant human woman (Lyssa) with the shimmering jewelry. The incredibly faint, almost subliminal hum from her delicate accessories is a consistent, high-frequency whisper, just beneath the threshold of ordinary hearing, and distinct from the general technological background noise of the lounge. It's too subtle to be accidental. It hints at purpose, perhaps even a discreet, active scan.","timestamp":"2025-11-30T13:36:32.525000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1444736542848323719","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola nods at the bartender’s explanation.  It’s really a pity that they spend so much time crafting delicious cocktails when most of the clientele doesn’t seem to care that much.  \n\n**“Well, I’ll join the rest of my party then**,” she says.  It feels like she’s talking to a synthwood wall.  Taking another large sip of the drink - *still delicious!* - she picks up the delicate receptacle and starts to thread her way toward “Kalen” and “Morra.”","timestamp":"2025-11-30T17:07:13.722000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1444750381199659010","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As Morra sat, Wes turned around.  A silent breath escaped him as he took in the surroundings.  His eyes and ears alert boosted slightly by his helmet's sensory package.  It was enough of a boost to help pick up visual clues or audible ranges his normal hearing couldn’t.  \n\n\nWhat was easily seen was the subtle shifts in the already present security details.  The subtle acknowledgment over comms or the quick glance to another unseen member of the detail.  It was a professional detail of the game that they all played.  See everything and look like you’re paying it minimal attention.  \n\n\nWhat truly did catch his attention was the woman.  She was human and elegantly dressed and adorned with equally as such jewelry.  He saw a flashing indicator on his HUD indicating a slight abnormality in the high-frequency sound spectrum.   He brought up his bracer computer to see what it was.  The anomaly was a high freq sound wave in the background.  It was too constant and steady to be haphazardly happening.  That meant it was something deliberate.   She was fishing.   \n\n\nHe spotted Iyola or *’Tira’* now moving towards them, drink in hand.  When she advanced to the raised platform he watched as others followed her.  Most looked and paid no attention but the elegantly dressed woman watched with seeming disinterested manner.  He had a subtle feeling that it was anything but disinterest.   When Tira stepped up to the raised both he stepped aside allowing her access to the plush booth.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-11-30T18:02:13.042000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1444792111139651767","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola slid away from the bar.  She glanced around her to see if anyone here was actually having any fun as she made her way to the booth. Guests of the Ruby Sun lounged at small tables, smoking or playing with their datapads.  \n\n *Should have gone to the casino*, thought  Iyola, *I guess I’ll have to have a different kind of fun.*  She stepped up onto the elevated platform, and kissed Varda on her creased cheek before sitting down.  “**Hey, Gram,”** she said.  **“Got a drink.  Did you order yet?”  **\n\nShe looked toward the bar, but really she was curious as to which of the beings sitting there would crack first.  That was the little game she would play with herself.\n\n**“The Coronet Scramble is fantastic,”** she said. ** “Highly recommended.” **\n\nBeside her, the so-called Kalen was looking stoic and vaguely threatening.  So good job there, she supposed.  There was a very subtle tension in his posture. \n\n**“I’ll go get one for you if you want,**” she continued. She wouldn't mind walking back to the bar.  She was feeling restless.","timestamp":"2025-11-30T20:48:02.235000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1445505127577288795","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda slides into the booth with a finely veiled grimace as her bones protest the simple movement. She keeps her eyes locked on Iyola at the bar as if a grandmother scared for her precious child to finally be out. The emotions and the actions are one to easily to slip into even after such a long time. \n\nShe catches Wes' eye and then they flick to the woman with the constant vibration. She shares a small nod with him and lets a frown temperarily mar her features. As Iyola returns Varda lets out a husky laugh. \"**Oh, not yet my dear. I'm not as young as I used to be. Dont want to addle my sight just yet.**\"","timestamp":"2025-12-02T20:01:18.601000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Varda Nisyren"},{"id":"1445777244856385647","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As Iyola, now fully embracing 'Tira Ves,' rejoins her companions in the elevated booth, the delicate balance of the Ruby Sun Lounge shifts. Her cheerful defiance, Varda's theatrical age, and Wes's silent, armored vigilance form an undeniable focal point. Their subtle entrance to the booth doesn't go unnoticed.\n\nWes's Force-augmented senses now process the continuous, high-frequency hum from the human woman in the nearby banquette as a low, almost subliminal thrum, clearly a scanning device. Her 'disinterested' glances track Iyola's arrival, her posture tightening almost imperceptibly, a professional noting a new variable in her operational environment.\n\nThe general hum of conversation around them begins to take on a more natural ebb and flow. At a table near the lounge's central planter, a wealthy Togorian industrialist gestures expansively, his booming laughter momentarily cutting through the jazz. A hushed Twi'lek hostess, impeccably adorned, glides from table to table, attending to the whims of the patrons.\n\nMeanwhile, the nervous human male from the bar, still compulsively checking his chrono, abruptly downs his drink and stands. He gives a quick, furtive glance around the room, his eyes scanning for something or someone, before making a hasty, almost panicked exit towards a side passage marked 'Fresher/Private Consultations'. His departure is sudden, but not overtly disruptive to the lounge's sophisticated calm.","timestamp":"2025-12-03T14:02:36.416000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1446943248479162390","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola was temporarily distracted by the sight of the rays of light refracting off the clouds of Bespin, a radiant orange-red hue that no doubt inspired the name of the Ruby Sun.  She turned back to Varda.\n\n**“You’re missing out,” **she said, taking another long sip. ** “If you like sunfruit, it’s the best.”**\n\nVarda and Wes seemed to be subtly eyeing a human woman lounging on a nearby chaise.  Iyola deliberately did not look in the same direction. She recalled the dossier they’d received - one of the operatives that frequented the Ruby Sun was a young human woman.  Well, between the so-called Kalen and Morra, they had it covered.\n\nThe agitated human stands up from the bar.  He continues to look around. Whoever he was planning to meet, it doesn’t seem like they’re here. He goes down a corridor with signage for both freshers and private consultations*.  Maybe they’re the same place. * It’s funny to think of secret meetings happening inside the freshers.  \n\nIyola polished off her drink.  **“Hey,” **she said casually, **“I think I might hit the freshers. If a server comes by, can you order me a bev without alcohol, like a moonberry frost, or a meiloroon shake, something like that?”**  She looked at “Kalen.”  **“You’ll be fine watching Gram here, right?”**","timestamp":"2025-12-06T19:15:53.343000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1447394981424795778","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes kept mostly impassive as he played his part of the vigilant bodyguard.  If anyone was watching and he knew some were he kept a vigilant watch over his “wards” and the area.  What the other patrons didn’t know was that he had other senses as well.  The Force could augment his natural senses providing him an added boost others didn’t have or even expect, especially now.   \n\n\nHe made sure to not obviously out anyone who was paying too much attention.  If he had, their human woman would have been the first.  His Force enhanced senses picked up the high-frequency hum of an electronic device in her possession.   He didn’t think it was a coincidence that she matched the description of one they were to watch out for.  This was her ‘territory’.  It made sense that she’d be staking it out for possible marks.   \n\n\nAs Iyola mentioned going to the freshens he gave her a slow nod in understanding.  The nervous human male that was at the bar had headed off that way.   **”Yes Miss Ves.  Do be mindful.   This isn’t home.”**  He turned his head towards her.   The impassive “T” visor gave her a slight nod before turning back.  His gaze in the direction of the well dressed Human woman who had taken an interest in them.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-08T01:10:54.870000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1447407759065612392","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Kalen turned to her and gave her a slight nod, warning her yet again that the Ruby Sun was not like home.  Home - what a concept.  *Where was home, anyway? * Tira’s home was some backwater in the Vespene sector.  Her own home - she used to think it was the Stardust Seeker.  Or Rhinnal.  Or maybe, one day, Ryloth.  Now she was caught between a weird ship run by a droid who hated her, and a bunch of Mandalorians. \n\nHer thoughts were going down a slightly melancholy lane. *Maybe I should lay off the whisky.  No, that's too dramatic.  *\n\n**“See ya in a bit,”** she says.  She saunters off toward the corridor with the freshers, and maybe, a tiny mystery to uncover.","timestamp":"2025-12-08T02:01:41.297000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1447712758366994623","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola, clutching her empty glass, rises from the booth with a casual shrug and begins to thread her way through the discreetly luxurious space, a playful glint in her eyes. Her blue-green jacket cuts a striking figure against the muted opulence. She passes the elegant human woman, Lyssa, whose gaze flicks up from her datapad for a brief, assessing moment, then returns to her screen with practiced indifference.\n\nAs Iyola nears the archway leading to the side passage, Wes subtly adjusts his stance. His enhanced senses follow her progress, ensuring no immediate, overt threats emerge from the surrounding patrons. His veiled gaze remains fixed on Lyssa, subtly tracking her, but a flicker of his attention is on the now-empty portion of the bar where the nervous human male had recently exited. He senses the residual agitated energy lingering in the space.\n\nThe corridor to the Fresher/Private Consultations is dimly lit, a deliberate contrast to the lounge's warm glow. The entrance itself is narrow, almost nondescript, leading into a short, sterile antechamber. Two doors, one marked with a generic 'Fresher' symbol and the other 'Private Consultations', beckon. The air here is noticeably cooler, scented faintly with a sharp, medicinal odor, a subtle disconnect from the lounge's rich perfumes. No overt security is visible here, but the discreet, almost clinical quiet of the passage suggests conversations held here are meant to be unheard.","timestamp":"2025-12-08T22:13:38.797000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1447763654513528964","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The hallway lacks the sumptuous decor of the rest of the Ruby Bar.  Most people come here for a reason, Iyola excepted.   Even her footsteps sound quieter. \n\nShe looks with some puzzlement at the fresher sign.  *Is it really just one door for all beings?  Strange.  *She places her hand on the door, listening for a moment, before pressing it lightly to see if it’s in use.","timestamp":"2025-12-09T01:35:53.384000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1448376603250917486","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":null,"discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The door hisses open silently, revealing not a single room, but a small, pristine, and *very* exclusive anteroom. Soft, blue-tinged lighting emanates from recessed panels. Directly ahead, a discreet sign points to several individual, sound-proofed cubicles: \"Fresher Unit 1,\" \"Fresher Unit 2,\" and so on, each with its own elegant, dark plasteel door. The air here is cool and completely sterile, scented with a mild, almost clinical, floral essence. There's no sound. No one is immediately visible. The passage designated \"Private Consultations\" is off to the right across the hall from the singular door for the freshers. It's a heavy, unadorned durasteel door that looks distinctly more robust than the others. It hums faintly with a power signature, suggesting active shielding or advanced internal systems.","timestamp":"2025-12-10T18:11:31.751000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1448376615527649403","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda, her keen eyes missing nothing, notices the subtle shift in Iyola’s posture, the sudden glint of purpose that transcends mere curiosity. She senses the young girl’s growing fascination with the possibilities beyond the mundane. She also notices Wes's silent, protective vigilance, his gaze briefly flicking to her with a subtle, unspoken concern. The pressure in the lounge, the hushed intensity of the *Gilded Grasp's* shadows, and the deliberate restraint she herself is employing all weigh upon her, bringing a genuine weariness that seeps into her bones.\n\nVarda slowly, deliberately, straightens, pushing the fatigue and discomfort down with long practice. Her gaze meets Wes's, and she offers a faint, reassuring nod, acknowledging his unspoken concern without verbalizing it. The wisdom in her eyes is clear.\n\n**\"My apologies,\"** Varda murmurs, her voice low and edged with a weariness that is entirely genuine. She inclines her head towards Wes, then Iyola, a brief, apologetic gesture that includes the entire mission and her own dwindling strength. **\"The hum of this place, it wears at old bones more than I expected. And certain... *flavors* in the air prove too potent for one such as I to fully process for extended periods.\"** Her lips quirk in a dry, almost self-deprecating smile, a subtle hint that her 'flavors' refer to more than just the perfumes.\n\nShe rises with a slow, careful grace, resting a hand on her staff. **\"I find I am suddenly in need of a quieter space. A true quiet.\"** She turns towards Wes, her eyes meeting his. **\"Kalen, would you see to Morra's wellbeing?\"** \n\nWithout waiting for a direct answer, Varda begins to walk with slow, measured steps towards the entrance of the Ruby Sun, her gaze drifting back across the opulent lounge, a serene smile settling on her lips once more as she quietly departs.","timestamp":"2025-12-10T18:11:34.678000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Varda Nisyren"},{"id":"1448896682405269556","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The door to the fresher opens, only to reveal several more freshers tucked within.  Across the hall, the door to private consultations hums ominously, or so it seems to Iyola.\n\nShe opens the door to one of the freshers at random. This is a fancy lounge; they’ve got to have some nice soap, at least.","timestamp":"2025-12-12T04:38:08.284000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1449058719362187354","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes nodded as Varda spoke.   He watched her stand and express her weariness and for him to check on Iyloa.   Judging from the earlier glance she gave him she was worried for Iyola.   He looked over to where she had walked off to.   The brightly lit lounge did little to obscure his view.   Especially from the vantage point he currently occupied.  \n\n\n**”Of course.”** His voice sounded flat.  His vocoder removed any emotion or inflection.   He slowly walked down from the raised booth they were on at her side keeping the look of protector and helper.  **”I’ll check on Miss Ves and make sure she’s looked after.”** \n\n\nHe walked alongside for a few more steps until it was time for him to branch off in the direction Iolya went.  As he strode purposely his senses, attuned to the environment were alert and ready.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-12T15:22:00.905000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1449141498393133120","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola pushes open the door to one of the individual fresher units. Inside, it's a sterile oasis of cool, dark stone and shimmering metal, smelling faintly of clean ozone. A mirrored plasteel counter stretches beneath a glowing archway, with no traditional faucets but sleek, touch-activated sonic dispensers for water and air jets for drying. To one side, a discreet alcove holds the 'fresher' itself, a marvel of bio-recycling technology. The luxury is evident in the minimalist design and the subtle, indirect lighting that bathes the room in a calming blue glow. However, to Iyola's disappointment, the dispensers only offer a standard, unscented cleansing foam—efficient, but far from the bubbling, aromatic soaps she envisioned.\n\nMeanwhile, Wes, now an armored specter moving through the subdued opulence of the lounge, strides towards the freshers. His senses, sharpened by the Force and augmented by his helmet's systems, remain on high alert. He discreetly scans the various occupied banquettes, making a mental note of any shifted postures or lingering glances in their direction. Lyssa, the elegant human operative with the data-skimming jewelry, remains seemingly engrossed in her datapad, yet Wes registers a minute, almost imperceptible tremor in her hand as he passes. It is a subtle reaction, a trained operative's acknowledgment of a professional threat now moving through her operational space. The nervous human male who had exited to the fresher corridor has not yet returned, the consultation door still closed and humming faintly with its internal energy. The very air seems to hold a heightened stillness, a quiet anticipation as Wes approaches the secluded passage.","timestamp":"2025-12-12T20:50:56.964000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1449418038368534619","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola washes her hands with the soap.  It’s unctuous and effective, but sadly flat and unscented.  She looks at herself in the mirror. Her light hair is neatly braided away, and her eyes are bright.  Her skin looks pale in the tinny artificial light. She looks normal, fine, cute, not like some time-displaced amateur spy for weirdo Mandalorians.\n \n**“Hi, Iyola,”** she tells her reflection.  **“You’re doing great.  It’s all going to work out, somehow.”  **\n\nIf she doesn’t hear anything interesting, her plan is to go back out into the corridor, and maybe take another glance at this door. And then, later, she’s going to go shopping.  The Skiratas can just wait for her to report back.","timestamp":"2025-12-13T15:09:49.232000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1449842671622295712","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Walking to where Iyola went Wes was alert.   His helmet's sensor package working in tandem with his Force senses queued him in about his surroundings.   The human woman whom he believed was Lessa, one of the people they were on the look out for, was discreetly tracking him.   His presence had her on edge.  The out of place tremor in her hand spoke volumes.  \n\n\nNot paying her any attention as if he considered her a non threat he continued moving towards where Iyola had gone.  He was now looking for the human male who hadn't returned.  It seems to be too quiet and that only put his senses on higher alert.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-14T19:17:09.689000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1449861737137307758","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola nods at her reflection, a determined glint in her eyes, before splashing a final handful of water onto her face. As she reaches for a sonic towel dispenser, her acute hearing, sharpened by years of wilderness exploration, catches a faint, almost subliminal murmur of conversation. It's too quiet, too muffled to make out words, but it's clearly emanating from *behind* the heavy, unadorned durasteel door marked 'Private Consultations' across the hall. The door, despite its solid appearance, doesn't seem to be perfectly sound-proofed against extremely focused hearing, or perhaps the muffled voices within are raised just enough to create a subtle vibration in the wall. The sound has a slightly agitated, clipped rhythm, more urgent than the general lounge murmur.\n\nMeanwhile, Wes steps into the cool, sterile anteroom of the freshers. His senses immediately confirm the complete absence of any overt physical threat within this immediate area. The silence here is profound, almost unsettling after the low hum of the lounge. He notes the individual fresher doors, some discreetly indicated as 'in use' by faint, glowing indicators.\n\nHis Force-attuned senses, however, pick up a very subtle but distinct aura of agitation and low-level stress emanating from *within* the 'Private Consultations' room. It's a contained pocket of unease, a clear contrast to the generalized indulgence of the lounge. It's a quiet eddy in the flow of the Force, an anomaly that draws his attention. While he can't discern precise thoughts or words, the emotional residue of the individual (or individuals) within is palpable: a mix of frustration, forced cordiality, and underlying apprehension. The air in that specific area of the Force feels slightly 'dense,' almost burdened.","timestamp":"2025-12-14T20:32:55.262000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1449878189919699157","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As Iyola is reaching for a towel she - senses more than hears - the cadence of an agitated conversation.  It’s coming from the consultation room, which makes sense, since she sees no evidence of the male human who’d rushed in here.  Iyola wondered whether the consultation room had listening devices in it.  She wouldn’t be surprised.  \n\nShe re-enters the antechamber, and almost runs directly into Wes.  What is he doing here?  **“Kalen?”** she asks.  **“Everything OK, or do you just need to use the fresher?”**","timestamp":"2025-12-14T21:38:17.911000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1450997731043578007","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Stepping into the anteroom of the freshens Wes stopped near the center.  The silence was overwhelming but it wasn’t his hearing that he was listening to.   It was the subtle shifts in the Force.  Agitation and stress emanated from within one of the rooms marked as ‘Private’.   What he felt within was different then the lounge.   Outside it was an air of ease and personal indulgence.  Within the room he felt the opposite.   Frustration mixed with apprehension and other emotions swirled behind the door.  An air of unease was easily picked up by the Mandalorians Force trained senses.\n\n\nHe started taking a step towards the door as another door, the women’s refresher, opened and Iyola stepped out.  Her question of why he was here was answered simply with a nod.   Her appearance gave him an idea.  He stepped closer jis voice low.  **”The human male that was uneasy and impatient at the bar.  Like he was waiting for something bad.  He’s in that room.  Wanna help me interrupt them?  It will require some acting.  If we can access the door.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-17T23:46:57.315000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1451222836571279532","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes steps closer to her.  His voice is low and tinny through his helmet as he tells her about his plan to interrupt the argument inside the consultation room.  Surprise, then delight flashes across Iyola’s expressive face.  She had thought she was just going to be sitting in a booth nursing a drink for hours - this was much more fun.\n\n**“I’m in,” **she whispers back to Wes.  **“They’re arguing about something in there. What’s your plan?**","timestamp":"2025-12-18T14:41:26.655000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1451347434667249845","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes smiled beneath his helmet as Iyola agreed to go along with his plan asking what it was.  He put his  hand on the small of her back and stood closer lowering his voice.   **”If I can access the door by tripping it we pretend to be lovers trying to find a place for a risqué rendezvous.   Unknowingly interrupting them.\"**  \n\n\nHe walked slowly towards the door, already reaching out with the Force to the door's mechanism seeing if he could trigger it.  **”Are you good with that plan?”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-18T22:56:33.156000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1451434657026539642","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola is surprised when Wes pulls her closer, his large hand pressing against the small of her back.  He whispers his plan to her - they’ll pretend to be lovers looking for a place to be alone.  It’ll be like a holovid drama plot.  This isn’t her; it’s a role.  *It might work. *She can make it work. \n\n She entwines herself around Wes, or at least his suit of beskar. It’s not that comfortable, but she’s committed to the bit. She leans in and murmurs near where she thinks his ear is.  \n\n**“I’ve been waiting all day to be alone with you, Kalen.  We don’t have much time.  Where can we go?”  **\n\nShe lightly traces his headgear with a finger, looking for a catch to open it.  She assumes that’s what Tira would do in this situation.  *What else is she supposed to do, lick the side of his helmet?*  They drift toward the consultation room door.","timestamp":"2025-12-19T04:43:08.587000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1451658982828544010","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes's Force-attuned hand finds the door's locking mechanism. He focuses, not on brute force, but on subtly disrupting the finely tuned electronics. The inner workings hum under his will, the Force coaxing an unintended response. With a soft *thunk*, audible in the sterile quiet, the heavy durasteel door of the 'Private Consultations' room unexpectedly slides open by a handspan, revealing a sliver of the agitated scene within.\n\nInside, the nervous human male they'd seen at the bar is indeed present, his face now flushed with anxiety, sitting across a small, polished table from Xylo, the Gran negotiator from Serena's briefing. Xylo's three eyes, usually jovial, are currently narrowed with an intensity that is anything but. He gestures emphatically with one hand, a datapad lying open between them displaying a complex series of financial figures. The conversation, previously muffled, is now clearly audible—a tense discussion about missed payments, unfulfilled contracts, and escalating penalties.","timestamp":"2025-12-19T19:34:32.026000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1451658985525612746","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Xylo","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"—and your 'concerns,' Koral, do not alter the contractual obligations! The collateral is forfeit. Silas Vane does not tolerate... *inefficiency*.\"**","timestamp":"2025-12-19T19:34:32.669000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Xylo"},{"id":"1451658999220011129","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Just as Xylo delivers this harsh pronouncement, the door unexpectedly hisses open, revealing Iyola (\"Tira\") in her dramatic embrace with Wes (\"Kalen\"). Their impromptu tableau of desperate longing—Iyola pressed against the formidable *beskar'gam*, whispering into the vocoder-grille of Wes's helmet while idly toying with his visor—casts a sudden, jarring incongruity into the tense corporate confrontation. \n\nBoth Xylo and the nervous Koral freeze mid-sentence, their heads snapping towards the now-partially-open door, their expressions a mixture of shock and profound disbelief at the utterly inappropriate interruption. The unexpected spectacle has utterly derailed their strained negotiation.","timestamp":"2025-12-19T19:34:35.934000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1451748288952012860","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With some subtle coaxing with the Force Wes disrupted the locking mechanism in short order.   It wasn’t the first time he had done this.  Master Davion had taught him to find the variance within the electronics and extort it.   With a subtle push the lock was compromised and the door hissed open.  \n\n\nKeeping up with the act the two ‘lovers’ stumble into the room.  The emotions and raised voices were still active and Wes felt them shift to surprise and shock.   \n\n\nInside was the nervous human from the bar.  Also in accompaniment running the meeting was the Gran negotiator Xylo from Serena’s briefing.  Wes stopped with actual surprise at the unfortunate mishap.  ***Stang.***  He cursed inwardly.  A second later the monotone voice of his vocoder sounded out.   **”Apparently this room is occupied.  Let’s find another one.”**  He looked around the room.   **”Excuse us.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-20T01:29:24.265000+00:00","edited_timestamp":"2025-12-20T01:33:00.356000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1451757291648057588","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola squawked in genuine surprise as the door suddenly opened.  *How had Wes done that?  *Inside, a  three-eyed Gran and the sweaty male human from the bar stared at them in shock.  Iyola buried her face against the hard carapace of Mandalorian armor on Wes’s chest, mainly to hide the expression on her face, but also because she was pretty embarrassed.   Aradara Diorlo had always done infiltrations in a stylish, deft manner.  That was not her. \n\n**“Sorry!  Sorry!” ** she said.  The metal was smooth and cold against her cheek. Wes intoned in his voice, flat and droidish through the helmet, that they would find another room.  She lightly punched Wes on the arm.  *Ow.* ** “I can’t believe you did this to me!” ** she said, half sobbing, half laughing. She wasn’t even sure if she was in character or not right now.","timestamp":"2025-12-20T02:05:10.675000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1451775313980817452","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Xylo's three eyes blink in slow, bewildered unison, his earlier anger completely deflated by the absurd interruption. Koral, the nervous human male, stares with his mouth agape, his face a canvas of disbelief. The subtle, urgent hum of distress that had permeated the room instantly evaporates, replaced by a stunned, almost comical silence.\n\nThe image of 'Tira' burying her face against 'Kalen's' beskar'gam, punctuated by her choked mixture of sobs and laughter and a very un-lover-like punch, utterly shatters the fragile illusion of their impromptu charade, replacing it with something far more bizarre and unexpected. It is not anger they provoke, but profound bewilderment and an almost stunned embarrassment from Xylo and Koral. The air now crackles with sheer, bewildered awkwardness.","timestamp":"2025-12-20T03:16:47.534000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1451784315036893249","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes felt the emotional tension in the room shift.  Where a distressed urgency hung over the room just moments before he felt it being replaced with a profound stunned silence.  The shock was that he didn’t need his Force senses to feel it.   Iyole, wrapped around him in an almost comical fashion, didn't help the charade by punching him in the arm.   \n\n\nNever taking his gaze off the two they interrupted, Wes stood tall as he patted the small of his companions back.  **”Cyar'ika, this rendezvous we waited for is going to have to wait..”**  Wes shifted his gaze to the Gran and gave Xylo a curt nod.  **”Please excuse us.   The door was unlocked.  We didn’t mean to interrupt.”**  \n\n\n | Cyar’ika - Sweerheart |\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-20T03:52:33.553000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1452435503365361977","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The awkward silence seemed to go on forever before Wes punctured it  with a more formal apology to the two beings they had interrupted accidentally on purpose.  Then he called her cyar’ika  - darling or sweetheart in Mando’a.  It was a loving term. Iyola took the gigantic hint and  realized she’d been going about this wrong.  She was trying to be a dramatic performer/triple agent/exotic dancer etc etc like Aradara Diorlo, and she wasn’t that at all.  \n\n*Imagine it’s Caz under that helmet, *, Iyola told herself.   Someone you want to be with. \n\n** ”I’ll wait as long as I have to, love,**”  said Iyola.  “**But I really hope it’s not that long.”** She softened against him as he rubbed the small of her back and placed a tiny kiss against his shoulder, which, unsurprisingly, tasted like dirty metal.  \n\n**“Let’s get back before Gram realizes we’re missing,” **she whispered to him.”","timestamp":"2025-12-21T23:00:08.949000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1452450118115790918","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Xylo","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Xylo lets out a frustrated, sputtering sigh, raking one hand over his crest as he watches the departing pair. The negotiations, whatever fragile state they were in, are irrevocably shattered by the sheer, awkward spectacle.\n\n**\"This is... preposterous! Unprofessional! This entire establishment's security is a farce!\"** Xylo splutters, finding his voice at last, though it's now tinged with a distinct whine of professional grievance rather than genuine threat. He scrambles for his datapad, clearly more concerned with documenting this bizarre security breach than continuing the discussion with Koral. **\"Get out! Just... get out!\"**","timestamp":"2025-12-21T23:58:13.377000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Xylo"},{"id":"1452834396267614281","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola slunk back to the booth, accompanied by Wes.  He let her know that Varda had left, exhausted after a long day of misadventure, so Iyola didn’t have to worry.\n\nOnce back in her seat, Iyola signaled for a server to come by.  She could use another drink. \n\n**“Thanks for keeping me safe,”** she said to “Kalen” in a mildly flirtatious tone.   She wasn’t sure how much more she could do in this overpriced lounge.  *Perhaps it was time to go shopping? * The thought made her perk up a bit.  It was better than thinking about Caz, and how she would never get to see him again.","timestamp":"2025-12-23T01:25:12.428000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1452837409782894678","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes left the back area with Iyola.  They act of wanting lovers fell away as they entered the main lounge.   Once again they were bodyguard and client as they made what seemed like a long trek back to where they were sitting.   \n\n\nIyola sat as he took the protective stance of the bodyguard once again.   Her comment of keeping her safe made him smile.   He turned his head and gave her a nod.   **”Just doing my job Miss Ves.  I’m sorry that things don’t go… as planned.”**  He turned his head back to the main lounge to see if the same players were lurking.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-23T01:37:10.906000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"reactions":[{"emoji":{"id":null,"name":"🤗"},"count":1,"count_details":{"burst":0,"normal":1},"burst_colors":[],"me_burst":false,"burst_me":false,"me":false,"burst_count":0}],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1452847284189663302","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"A discreet, human server, his smile professional and unreadable, approaches their booth almost immediately after Iyola signals. He is impeccably polite, offering no hint that he had observed their earlier, peculiar performance.\n\n**\"Welcome back, ma'am. Can I get you another Coronet Scramble, or perhaps something else?\"** he asks, his gaze briefly flicking to Wes with a subtle, respectful acknowledgment of his presence as a bodyguard.\n\nWes's Force-attuned senses confirm the immediate vicinity. Lyssa is still in her banquette, apparently deep in her datapad, her posture now slightly more rigid. Her high-frequency scanner continues its subtle thrum, indicating she's still very much on duty, seemingly uninterested in the antics by the fresher. Xylo and Koral, however, are nowhere to be seen, their private consultation room now quiet and its heavy door firmly closed.","timestamp":"2025-12-23T02:16:25.148000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1453182115553218824","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**The Coronet Scramble was delicious,”** says Iyola, **“but I’m in the mood for something different.” ** She glances over at the impassive side of Kalen’s helmet.  **“How about an iced joganita, extra frothy?”**  Wes can’t drink on the job, but “Tira” has no such qualms.\n\nShe looks the server over.  He’s so reserved he might as well be a freshly-wiped droid. **“I might go shopping for clothing after this,”** she says to him.  “**Any recommendations?” **","timestamp":"2025-12-24T00:26:55.166000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1453210633368502315","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Server","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The server's impeccably professional facade cracks, ever so slightly, at Iyola's unexpected shift to personal questions. A faint, almost imperceptible human warmth flickers in his eyes, a momentary surprise that reveals the man beneath the polished uniform.\n\n**\"An iced joganita, extra frothy. Excellent choice, ma'am,\"** he replies smoothly, a hint of genuine appreciation in his voice. He then pivots, his hand moving to subtly adjust the small datapad on his belt. **\"As for shopping recommendations, ma'am, Cloud City offers a multitude of boutiques. The 'Vertigo Spire Galleria' on Level 187 offers an exquisite selection of bespoke haute couture – rather exclusive, I'm afraid. For something more... spirited, perhaps 'The Neon Nook' on Level 120 in the entertainment district. Its selection is quite... *diverse*. Are you looking for anything in particular?\"** His smile, though still professional, holds a hint of genuine intrigue.","timestamp":"2025-12-24T02:20:14.343000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Server"},{"id":"1453491563802919052","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola’s mouth quirked upward. **“I’ve been called spirited before, believe it or not,**” she said.  \n\n**“I’ll be spending some time in Cloud City, and I’ve realized that I need to diversify my wardrobe,”** she said to the server.  **“Neon Nook sounds like one stop on the list.  I think I might need more fun capes and ponchos. Who doesn’t?  Maybe I’ll get Kalen one of those half-capes.  He’ll look so good in it, won’t you, Kalen?” ** Iyola winked at Wes. ** “I’m thinking green. Or yellow.”  **\n\n**“And then,” ** Iyola made a gesture toward the elegantly-attired crowd, making sure not to linger on that woman \nLyssa.  *I hope you’re enjoying spying on me right now, you sleemo*, she thought.  **“I’ll need something for, well, venues like this. The Vertigo Spire sounds perfect, but I’m gathering that I’ll need some sort of introduction to visit.” ** She leaned forward a touch.  **“How would I make that happen?” **","timestamp":"2025-12-24T20:56:33.378000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1454128419385118723","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Server","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The server's polite smile widens, a genuine flash of amusement now dancing in his eyes as Iyola teasingly questions Wes about capes. He smoothly notes her enthusiasm.\n\n**\"The Vertigo Spire Galleria operates on an exclusive, by-appointment-only basis, ma'am,\"** the server explains, his voice smooth and informative once more. **\"Clients typically acquire introductions through established corporate sponsors, private fashion consultants, or via direct invitation for significant bespoke commissions. It caters to a very... *particular* clientele, shall we say. While no overt 'introduction' is strictly required for browsing, an affiliation with a well-known entity or an impressive personal referral would certainly facilitate a more... *expeditious* experience.\"** He offers another polite smile, his implications clear and subtly helpful. He then turns to glide discreetly towards the bar, beginning to craft Iyola's iced joganita.","timestamp":"2025-12-26T15:07:11.581000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Server"},{"id":"1454174888666337331","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola nodded and smiled at the server, who excused himself to make her joganita.  She wondered if Serena Foss would hook her up with an introduction to the Vertigo Spire, so she could spend even more of the Skirata clan credits.  Probably not - and she wouldn’t blame them - but it was worth a try.  She knew she had the emergency commlink, but she obviously couldn’t contact them right here.  \n\n**“What do you think, Kalen?”** she asked Wes.  “**I’ll finish this  next drink, and then you’ll escort me to the Neon Nook?  Or carry me, I suppose, depending on how strong it is.”**  It was so uncanny interacting with someone whose entire face was covered with metal. Maybe other levels of Bespin would be more social.","timestamp":"2025-12-26T18:11:50.721000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1454469872653172736","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"At the comment of capes and Iyola getting him one he finally turned his head.   The neutral face of his T visor simply looked at the two talking about fashion.   **”Perhaps not Miss Ves.   Capes tend to get in the way at the wrong time.  One may work well with whatever you choose to wear.”**\n\n\nHe turned his head back out to the room at large again taking in the patrons.  Some made an effort to not look like they were watching while others simply looked their way.   \n\n\nWhen the server left he stepped closer to the table as.  He smiled when it was mentioned that he may have to carry her depending on the drink she was about to have.   **”Keep your wits about you Miss Ves.  There are many who would see that as an opportunity.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-27T13:44:00.384000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1454570896718299229","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**Well, if it’s the right person, maybe I don’t mind,”** she says to Wes coyly.  She idly watches the crowd.  **“Or maybe I’ll be the one with the opportunity.  Who knows until you try.” **\n\nThe dregs of her Coronet Scramble slosh in her glass. She should have expected that that a  frozen drink would take a bit longer.  Her mind drifts back to her unexpected hosts.  What will the Skiratas do when they report back?  Will they let her go?  Where would she go? \n\nThe idea of finality, of visiting Rhinnal and seeing what had happened to her family, is chilling.  It’s almost enough to sober her all the way up.  *But not quite. *","timestamp":"2025-12-27T20:25:26.398000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1455242128346316944","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The server returns with Iyola's iced joganita, a vibrant, frothy concoction in a tall, elegant glass, its surface shimmering with fine frost. The colors are brilliant, a stark, lively contrast to the muted elegance of the lounge, and the aroma of sweet, tangy fruit with a subtle floral note is immediately enticing. He sets it before her with a soft *clink*, his professional smile unwavering, and then discreetly melts back into the background, attending to other patrons.  \n\nIyola picks up the vibrant drink, its coolness a welcome contrast to the subdued warmth of the lounge. The hum of conversation continues, punctuated by the clinking of glasses and the occasional distant peal of laughter from a more boisterous patron in another section of the lounge. The elegant Mirialan female is now joined by a distinguished-looking Rodian male in a finely tailored suit, their conversation low and urgent, but with a new undertone of what might be a negotiation.\n\nAs Iyola sips, a distinct shift occurs in the Ruby Sun. Lyssa, the elegant human operative with the data-skimming jewelry, discreetly pockets her datapad and rises from her banquette. Her movements are fluid, almost predatory, as she glances once more around the lounge, a faint, almost imperceptible curl of her lip suggesting a dismissive assessment. She then makes her way directly to the lounge's main exit, disappearing with the same practiced indifference with which she operated, her subtle scanner no doubt cataloging a final batch of data as she passes through the lounge.","timestamp":"2025-12-29T16:52:40.489000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1455614740259672084","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola takes an experimental sip of the joganita. It’s fantastic. The airiness and sweet jogan flavor belie what is probably a hefty pour of spiced rum.  She takes a larger sip. The crunchy ice makes her mouth tingle.\n\n**“Kalen, this is so good,”** she says.  **“You have to try some.”**\n\nShe looks around her with the satisfied expression of a tourist on a Scarif beach.  The Miralian she’d spotted earlier is now deep in conversation with a well-dressed male Rodian.  *It doesn’t look like a fun chat.*  She guesses that this is the kind of thing she’s supposed to report back about to the Skiratas. Maybe she’ll also report on the drink selection at the Ruby Sun!  *Serena will love that!  *\n\nThe female human she thinks is Lyssa looks around her one more time, then departs.  She either doesn’t seem that interested in the goings-on here, or she’s a fantastic actor. Maybe both.  \n\nIyola wipes a bit of azure foam off her lip.  **\"Hey, Kalen.\"**  she says.  **“Let’s go to that neon place after I finish this.  I’m ready for a change of scenery.”**","timestamp":"2025-12-30T17:33:18.092000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1455718681421156475","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He didn’t pay many of the others any attention other than Lyssa the human woman that had been coyly keeping eyes on them since they entered.  He watched her get up and leave.   \n\n\nWhen Iyola asked about leaving he looked and saw that she was looking in the way Lyssa had left.   **”Let's go now.   Might be able to keep up with her.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2025-12-31T00:26:19.596000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1455734893207224342","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**“Right now? You can’t wait, can you?**” said Iyola slyly.  **“I get it.  Sure, give me a minute.”**  She grabbed the tall glass and took two more large gulps of the delectable joganita, then stood up.  She caught herself and put a hand on \"Kalen\"'s shoulder, which seemed like something Tira would do. To be honest, Iyola could use a little steadying herself.\n\n**“Lead the way,”** she said to Wes.","timestamp":"2025-12-31T01:30:44.787000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1456286404970807483","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":null,"discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**”Yes now.”**  He said as he watched Lyssa as she was reaching the exit.   He didn’t catch the smirk or her face as he watched their target get farther away.   \n\n\nThe sudden grab at his shoulder was enough to make him turn his head.  There he saw ‘Tira’ catching herself from a misstep.   **”You’re compromised.”**  His voice came out low and flat through his helmet's vocoder.   \n\n\nTaking her arm to steady her he took a pace, albeit a slower one, towards the door Lyssa had now gone through.  He wasn’t sure that they’d be able to keep up and not draw unwanted attention.  However he knew he drew attention wherever he went.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-01T14:02:15.438000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1456408710011162888","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**You know me, I love compromising,”**  Iyola murmured back.  **“But we don’t have to walk so slowly, cyar’ika. I’m just fine.” ** *Keep it going, just in case. *She wondered if Wes was also frustrated in his own way.  The Skiratas had told them to sit around and observe, but Wes was seemingly eager to track down  operatives like a hound. She was game, of course. \n\n**“After the Neon Nook, maybe the casino?  Or somewhere else?”** she continued to comment as they neared the door.","timestamp":"2026-01-01T22:08:15.232000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1456480114413010995","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"They pass the polite, now-empty glances of a few departing patrons near the lounge's exit. No one gives them overt attention. The lounge itself hums with a continued, sophisticated buzz, its soft lights casting long, dwindling shadows. The Mirialan and Rodian at the bar remain locked in their tense, hushed negotiation. Lyssa is now well out of sight, her path having taken her directly towards a bank of gleaming turbocars and public sky-trams on the main promenade.\n\nWes guides Iyola through the bronzium doors of The Ruby Sun Lounge. The moment they step back onto the promenade, the dazzling cacophony of the Casino District rushes in, a vibrant assault on the senses. The constant blare of advertisements, the rush of sky-trams, the jostle of a thousand alien footsteps—it's a world designed to overwhelm. The subtle chill of Bespin's upper atmosphere immediately replaces the lounge's filtered warmth.\n\nAhead, the myriad lights of the city form a chaotic river of activity. Finding Lyssa in this torrent of movement will be a challenge, relying less on Force sense and more on sharp visual tracking and luck, as the crowds provide excellent cover for anyone trying to disappear.","timestamp":"2026-01-02T02:51:59.368000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1456653669217996810","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes sighed inwardly when Iyola called him Cyar’ika.   He almost asked her not to call him that as he regretted using the Mandalorian term of endearment in their act.  He had only ever used it for Marina.   Now with that possibility of finding her, using it, even if playing a role, didn’t sit well with him.    \n\n\nHe was beginning to think that his pursuit of Lyssa was now to cover his feelings.  They were to watch and observe, not track her down like a Loth Cat.   It was then the last words Iyola said before they passed the doors of the lounge that hammered it home.  She was compromised from the alcohol.   \n\n\nHe came to a stop as they entered the promenade. The throng of people was a stark contrast to the more private setting inside.  What was a private setting inside was a chaotic swirl of movement and emotions out here.   \n\n\nHe shook his head as he looked slowly from side to side as if he was scanning to make sure it was safe for his client.  He realized pursuing Lyssa now would be dangerous and potentially compromise them and the mission.    He turned his head to look at Iyola who hung off his arm.  **”Perhaps a place where we can get a strong caf.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-02T14:21:38.058000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1456702488563417190","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola could feel Wes tense up as she continued their little charade until they’d left the Ruby Sun.  She wasn’t sure why. As they stepped through the portal into the urban commotion of Cloud City, it was as if her vision cleared. She stood up straight and took a half-step away from Wes. Whatever alcohol those bevs had actually contained was hardly enough to dull her senses. *Good thing I didn’t actually have to lay out credits for those overpriced fruit juices.*\n\nWes still seemed subtly agitated.   His visor scanned the hubbub. He suggested getting a caf. Did he actually believe that she was impaired?  Was he trying to delay, for some reason? She wished she could explain to him that she wasn’t drunk - she certainly knew what that felt like - and that she was ready to continue their pursuit. But they had to keep their cover until they were back on the Atin Oya’ka.  \n\n**“Mmm, no, I’m good right now,”**  she said distantly.  She considered where Lyssa might have headed in this crowd.  Her gray eyes intently scanned the scene before her, looking for a hint to where the Gilded Grasp operative might be, or where she might have gone.","timestamp":"2026-01-02T17:35:37.497000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1456721176096145623","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The vibrant chaos of the Casino District promenade swirls around Wes and Iyola. Wes stands still, his helmeted head slowly tracking the frantic pace of the crowds. Through the filter of his vocoder, his quiet suggestion for caf is lost almost immediately in the clamor. His focus is inward, his Force senses searching, confirming what his strategic mind already suspects: Lyssa has vanished into the torrent of bodies and blaring advertisements. Tracking her now would be an act of overt, attention-grabbing aggression, a clear compromise of their mission's discreet nature. \n\nIyola, however, remains fixed, her bright, unblinking gray eyes cutting through the sensory overload with the razor-sharp precision of an explorer spotting distant prey. While Wes's broad scan reveals only a receding ghost, Iyola's unburdened focus allows her to perceive a fleeting anomaly in the human current. A rapid flash of crimson fabric—a distinctive scarf—disappears into a public sky-tram entrance almost a full block away, moving with a subtle, professional haste.","timestamp":"2026-01-02T18:49:52.952000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1456737576974160008","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Terrain was terrain, whether wilderness or artificial.  Iyola recalls what Lyssa looked like and what she was wearing, and how far she might have gotten at various paces.  She scans the bands where she thinks her target might be.  And then, she spots it - a distinctive flash of red, the same shade as the scarf Lyssa had worn wrapped around her neck and shoulders. It’s her.  She nods at Wes in satisfaction. \n\n**“Come on,” **she says to him, starting to walk briskly toward the entrance.  **“We’ll miss our tram.”**","timestamp":"2026-01-02T19:55:03.226000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1456745594730320099","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He didn’t spot the woman among the throng of the crowds of people and aliens that walked the promenade.   He was about to suggest heading back for the time being when Iyola gave him a nod.   He looked in the direction she was looking but saw nothing fast moving patrons here in the sector.  \n\n\nHe started walking alongside her keeping pace.  **”We can not engage with her.  If you did indeed spot her we only ride along for one stop.   If she gets off we stay on.   If she stays on, we get off and wait for the next encounter.”** He took two steps before asking.  **”Got it?”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-02T20:26:54.808000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1456765327408107735","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"If?\"**  Iyola narrows her eyes and looks right ahead, refusing to look at Wes as he paces her on their journey toward the sky-tram.","timestamp":"2026-01-02T21:45:19.445000+00:00","edited_timestamp":"2026-01-02T22:23:38.728000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1456858137687490765","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**”Look, I'm sure you saw her.  I was looking at the other side of the promenade.  I don’t mean to infer that you didn’t see her.”**  He said as he continued to walk quickly alongside her.   **”We just can’t jump the blaster.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-03T03:54:07.140000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457025897877209130","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola glances sidelong at Wes.  **“OK, I heard you,”** she says.  She says nothing else as they approach the entrance to the tram.  \n\nWhen they arrive, she scans for routes and departure times, trying to figure out where her quarry might have gone.","timestamp":"2026-01-03T15:00:44.286000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457059053493813359","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola, with a fierce certainty in her gaze, scans the tram schedule board with lightning speed, her eyes cutting through the digital stream of departure times and destinations. She snatches the most efficient route, one that aligns with Lyssa's probable path. She then quickly guides Wes into the rapidly moving human current, pushing towards the glowing entrance of the next arriving sky-tram.\n\nThey reach the boarding platform just as a car hisses open, disgorging a wave of disembarking patrons before a new surge of commuters attempts to board. Through the chaotic swirl of bodies, Iyola's eyes lock on her target: a flash of crimson disappearing into one of the departing cars on the far side of the platform, the subtle, distinctive red scarf undeniable.\n\nDespite her agility and Wes's purposeful momentum, the sheer density of the crowd, coupled with the rapid cycle of the tram's doors, proves too formidable. By the time they surge onto the platform, the targeted car's doors are already hissing shut. They see Lyssa, her back to them, moving towards the interior of the tram car, unaware of their pursuit. The tram pulls away, a silent, gliding blur vanishing into the overhead tubes.\n\nThey are left on the platform, amidst the jostle of waiting passengers, watching their target recede into the metal arteries of Cloud City. The next tram is already cycling into position, its blue lights approaching in the distance.","timestamp":"2026-01-03T17:12:29.201000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1457082685192409179","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes walked hurriedly alongside Iyola as she led them in the direction that she saw Lyssa.  He scanned the area ahead for any threats letting Iyloa change direction as needed in the attempt to catch up.   \n\n\nReaching the platform brought about another challenge.  Disembarking passengers posed a significant barricade to their movement.   Using his size and appearance Wes managed to make headway through the mass of passengers but the size and density of the crowd was enough to allow the door to the tram car their quarry had boarded to close.  As quickly as the door closed it was moving away leaving the pair on the crowded platform.   \n\n\n**”I don’t believe she knew she was being followed.  No looks over her shoulder indicating she thought she was being followed.  We should be good there.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-03T18:46:23.437000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457130286851821721","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola nods at Wes’s assessment. She memorizes the destinations along  this tram route. She likely takes this path fairly often, if the Ruby Sun is her normal destination.  \n\nAs the next tram pulls in, she turns to Wes.** “Take it or head back?” ** she asks him. ** “Or to the Neon Nook?  We’re going to need a change of clothes.”** She looks him over.  **“At least, I will.” **","timestamp":"2026-01-03T21:55:32.557000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457147835697991800","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He took one more look around the platform and shook his head.  **”No, don't take it.  Let’s head back the way we came.”**  He turned and began to make a hole for them to walk through.  When they passed through the major masses and they could walk side by side again he walked beside Iyola.  \n\n\n**”I must apologize for earlier.”**  He took a quick glance over at her.  **”My use of the word Cyar’ika seemed prudent at the time.   Even though it was an act it felt wrong.  I know it caught you by surprise.   I felt the surprise in your presence when I said.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-03T23:05:16.528000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457159993202839685","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Almost like tossing a poncho off her shoulders, Iyola’s demeanor changes. She’s no longer hyperalert.  She looks drained, even a little sad.\n\n**“It - “**  she shakes her head.  **“That’s not something you need to apologize for.  It’s a word that is meaningful to you and not to me. It just shows how committed you were to what we were doing back there.  I promise you, I’ll never call you that again.”  **\n\n**“But  here’s what you can apologize for,”** Iyola says in a low, firm voice. **“Don’t order me around. “I’m not one of your soldiers or whatever.  I don’t report to you or work for you.  And I don’t make things up.**”   *Well, not when it’s important. * **“We work together, and you can trust what I say.”     **\n\n**“So head back, yeah?”** Iyola adds in a more conversational tone.","timestamp":"2026-01-03T23:53:35.103000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457199081263730794","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes walked along quietly still acting as the bodyguard as Iyola walked beside him.  He listened to her and gave her a nod.  He felt like he owed her an explanation.  \n\n\n**”Understood Miss Ves.”** He said keeping up the image of being her bodyguard.  **”I’ve mostly worked alone for ten years.  A portion of that in the unknown regions.”**  He kept his voice low and scanned the area before continuing.  **”I wasn’t ready to call another that even if it was just acting.”**  He paused again.  **”I know we were out of it for a different length of time.   It hasn’t been ten years for me.   Marina was still alive when whatever happened to me happened.”**  His hand came up to his middle just below his rib cage.     **”Now I can’t sense her when no amount of distance kept us from knowing that the other was there.”**  They took a few more steps.  **”I need to know what happened.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-04T02:28:54.423000+00:00","edited_timestamp":"2026-01-04T04:02:48.502000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457402932927533241","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"It wasn’t an apology, not exactly, but in her experience neither Mandalorians nor Jedi were much for acknowledging fault.  Still, he seemed contrite.  *I can work with that.*\n\nThe entire paramour performance clearly still bothered him, even though it had been his idea in the first place.  But Iyola could understand. \n\nFor her, cuddling a faceless block of Mandalorian metal was not appealing or reminiscent of her Caz in the slightest. But for Wes, having Iyola - this person Marina was probably also a human female, then - call him “beloved” in Mando’a must have felt like a betrayal to his loved one. \n\nA crowded tram station wasn’t the place for this conversation, though. ** “Kalen, take me back,”** she said.  **“I'm tired and I need a break.”**","timestamp":"2026-01-04T15:58:56.447000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457458712213061735","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes took a deep breath as he did his best to not intrude on her emotions.  He felt a strong one, similar to what he felt from Marina when she thought of him.  A memory came to mind and he smiled beneath his helmet.   He wondered if Iyola was also missing a loved one.  It wasn’t for him to ask especially here out in the open as they were.   \n\n\nHer request to head back had him looking across his left shoulder at her.  **”Back to quarters or to someplace quieter than here?  Either works for me.”**\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-04T19:40:35.265000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457464612466327602","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Let's go to quarters,\"** Iyola said. She wasn't really sure where to go yet, aside from that Atin Oya'ka, where they could have an actual conversation.  And probably better to report in while it was all still fresh.","timestamp":"2026-01-04T20:04:01.995000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457471702400372828","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes gives a quiet nod at Iyola's request, the subtle concern in his posture deepening. The raw honesty in her voice, the weariness she radiates, cuts through his own troubled thoughts. He pivots, subtly shifting his formidable frame to shepherd her through the dense throng of waiting passengers. The platform, once a place of fleeting opportunity, now feels simply loud and overwhelming.\n\nThey navigate the bustling sky-tram terminal, the garish advertisements and incessant chatter assaulting their senses. Iyola, though outwardly composed, maintains a quiet, almost melancholic scan of the various routes and departure times displayed on the terminal boards, making mental notes of potential destinations along Lyssa's likely trajectory. It is an instinctual act, a habit of cataloging routes that served her well in other, wilder landscapes.\n\nSoon, they find an arriving tram, its doors hissing open. They merge with the disembarking flow, their presence, particularly Wes's armored form, drawing only the briefest, most indifferent glances from the weary commuters. The sky-tram hums to life, gliding smoothly along its transparent track, carrying them swiftly away from the glittering, overwhelming chaos of the Casino District.","timestamp":"2026-01-04T20:32:12.367000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1457471720142147615","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"The journey back through Cloud City's public transportation system is a blur of motion and shifting urban landscapes. The view outside the transparent walls of the tram changes from the opulent, neon-soaked spires of the Upper City to the more utilitarian, though still bustling, architecture of the lower sectors and the Port Town district. Conversations around them are fragmented snippets of civilian life—a dispute over cargo tariffs, a complaint about droid repairs, a boast about Sabacc winnings—a tapestry of everyday existence that feels both profoundly alien and strangely comforting in its mundane constancy.\n\nFinally, the tram deposits them back at the designated public access point for Kando's Coursers' compound. The bustling concourse is still active, but less frenetic than the Casino District. The heavy, unmarked durasteel door that grants access to the private facility stands silently. Next to it, a discreet terminal gleams with an expectant blue light. Their escort, Arno, is nowhere in sight, leaving them to navigate the final leg of their return journey themselves.\n\nThe way back to the hangar and the *Atin Oya'ka* through the familiar, quiet corridors of Kando's Coursers compound stretches ahead.","timestamp":"2026-01-04T20:32:16.597000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1457503827392593973","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"They stand at the entrance of Kando’s Coursers.  Iyola tries to remember how to re-enter, before recalling the chip that Serena Foss had given her.  She gingerly tries it at the terminal.  There are quite a few things that she needs to get used to. \n\n*I might not be the only one*.\n\n“**So, this Marina you mentioned,**”  Iyola starts cautiously as she waited for the steel portal to do something, **“what did she look like?” **","timestamp":"2026-01-04T22:39:51.562000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457512089403785371","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With her answer he gives a nod and turns them towards a different section of the terminal.    Getting within sight distance of the tramboard they both looked it over to find the right departure to get them ‘home’.  \n\n\nFinding what they were looking for they only had to wait a few moments before the tram pulled up.   In what seemed like a blink of an eye they were off and the casino district with its lights and sounds were quickly fading away.  \n\n\nEver the watchful protector he kept watch.  His eyes scanned and his other senses listened for any subtitle shifts in the Force.  Sensing no danger he gave Iyola a nod indicating they were safe.  \n\n\n————\n\n\nThey stood before the unmarked door marred only by a discreet terminal.  As Iyola handled access he was surprised by her question.  It was honestly the last thing he expected her to ask him.   \n\n\nHe stood quietly for a second.  He was abòut to answer but the secured door *swooshed* open with the correct command from Iyola.   Saved by the open door he let her step in first.  After a half dozen steps he sighed and removed his helmet.  He turned his head and looked at Iyola and gave her a small smile.  It was genuine and honest as he thought about Marina. \n\n\n**”What did she look like?”**  He repeated her question.   His smile stayed as he remembered the *Legs Akimbo.*  A seedy cantina on Fakir.   **”She had dark brown hair and the most piercing blue eyes.  They lit up when she smiled and laughed.  I often thought they could look right through me.  Yet if she allowed it they could be soft when she looked at you.”**  \n\n\nHe tucked his helmet under his left arm and sighed.  Knowing that he sounded very unmandalorian.\n***\n<:fett:1287130263851368489> On [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-04T23:12:41.379000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457517075466551481","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He reached into his utility belt and pulled out his data pad.  Unlocking it he retrieved the file he had sent to Nadia not long ago.   He held it out for Iyola to look at.  \n\n\n\nMarina Cloudspinner (AKA: Rin Draay)\n\n*   Jedi Padawan, apprentice to Jedi Master Silas Draay. \n*   **Last Known Locations (Pre-Purge):**\n    1.  **Tanis:** Disruption mission targeting Separatist occupation affecting Republic hyperspace trade.\n    2.  **Jedi Praxeum Ship *Providence*:** A subsequent message indicated further studies aboard this vessel.\n*   **Final Contact:** The Galactic Republic fell mere weeks, if not days, after the last message was received. The plan for a post-mission rendezvous on Fakir never occurred.\n\n**-- Image File: T_LEG_AKIMBO_FAKIR_01 --**\n\n*(The image flickers to life on the datapad, warm and candid, taken in a low-lit booth within a bustling, seedy cantina. A glowing neon sign, \"Legs Akimbo,\" casts a lurid red hue across a smiling young woman and a stern Mandalorian. The woman, no older than Nadia, is undeniably striking—her dark brown hair falls in soft waves, framing a face alive with genuine laughter. Her eyes are a brilliant, piercing blue, reflecting both warmth and an underlying intensity. She leans subtly against the Mandalorian beside her, a quiet intimacy in the shared space. He, a much younger Wes, with his dark, earnest eyes, offers a rare, unguarded smile, a hint of deep affection in his expression as he looks towards her, both utterly lost in the moment. The photograph is a snapshot of unburdened joy.)*\n\n\n**---------------------------------------**\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-04T23:32:30.149000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457520193331789885","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Once they’re inside, Wes removes his helmet.  It’s a relief to see an actual face on him.  His dark eyes became distant and his expression softened as he considered her question about Marina's appearance.  His description matched with the flimsi she’d found and given to Nadia - dark hair, blue eyes, big smile.  The file he shared with her confirmed that his Marina was a Jedi.  It had to be the same woman.  \n\n** “And you two had kids?”**  Iyola asked.","timestamp":"2026-01-04T23:44:53.506000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457538383520993446","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes saw her look at the datapad, her finger scrolled the file and he saw her look at the picture of the two of them.  He smiled at the memory.  It seemed like a lifetime ago.  Iyola’s question caught him off guard and his gait hitched as he shook his head.  **”No.”**  He said as he looked forward again, shutting down the datapad, tucking it safely in a secure pouch.  \n\n\nHe took a few more steps as he thought about her question.  It seemed odd but he shook his head.  **”I don’t know.”**  He added.  **”We allowed the order to separate us even though neither of us wanted to.  We were both bound by duty.  Her to the Order myself to the Clans.”**  He sighed as he continued walking.  He brought up his hand to run the back of his neck trying to release some sudden tension wrangling with the idea to tell Iyola more.  \n\n\nHe let his hand fall to his side.   It found a comfortable place on the butt of his heavy blaster.  **”Before we met she had a daughter in secret.  She was hidden away from the Order.  They would have taken the child and she probably never would have seen it again.  I don't think she would have wanted to go through that again.”**  He let out a sigh.  **”Four weeks, five weeks, that's all we had.  That was all we needed to fall for each other.  The Force drew us together.  I think it had a plan for us and we let the Order keep us apart.   Then the Purge happened and it all went to hell.   We had a plan to meet back up on Fakir at the same cantina.”**  He shook his head.   The Force had other plans.   **”So no.   I don’t know if we had a child.”**\n\n\nThe thought was a sobering one.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-05T00:57:10.385000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457545457806082181","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola considers what Wes has told her. Marina’s oldest child is Nadia, who, assuming this is the same woman, must be the first child Wes mentions. It’s technically possible that Wes might be the second-oldest child’s father, but she hadn’t realized their relationship was of such an abbreviated duration.  Maybe there was something about Jedi having short and intense relationships, Iyola mused, remembering her fling with Lagan. \n\nRegardless, he would probably want to know about Nadia, and to learn more about Marina and her family from her.\n\n**“Wes,**\" Iyola says gently,   **“when I was poking around my room on the Atin Oya’ka, I found a flimsi of a pretty, dark-haired, blue-eyed woman wearing a lightsaber.  She was with two young girls in the image. I gave the flimsi to Nadia, and she told me that the woman was her mother, Marina Cloudspinner. The other girl was her younger sister, Kiera. The girls were perhaps four and two in the flimsiplast, and they were on some sort of planet with terrace farming.  It wasn't familiar to me.  I am sure Nadia can tell you more.”**","timestamp":"2026-01-05T01:25:17.026000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457556431602716734","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"When she said his name he could hear the shift in tone of her voice.  Her presence in the Force softened as she began to speak.  It started off as nothing but as she continued he brows furrowed.   When she mentioned Marina’s full name he stopped.   When she mentioned Nadia and another daughter named… Kiera he wavered.     \n\n\nSlowly Wes turned towards Iyola.  The look of shock on his face was as plain as the sun they saw only earlier on the platform.  Thoughts flip flopped in his head as well as his emotions in his stomach.   The rest of what she said came in bits and pieces.   Two and four years old.  \n\n\nIt made sense.  He remembered the lifestone back on Fakir.   Marina had let him hold it.  The stone had a presence in the Force and it was linked to her daughter that was in hiding.   \n\n\nNadia.  \n\n\n**”Kiera.”**  He said the second name softly as if remembering a precious memory.  An image of his mother appeared.   \n\n\n**”A picture of Nadia when she was four.   With her 2 year old sister, Kiera and their mother Marina Cloudspinner.”**  His eyes focused on Iyola.    **”Did I hear you correctly?”**  His voice was low and full of emotion.  As if her answer held hope in the balance.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-05T02:08:53.383000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457562933172109333","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola could tell that Wes was emotionally affected by her revelation. ** “Yes, you heard me correctly,” **she assured him.  **“She said that her sister was fighting with the Kryze clan for Mandalore, Lady Boka-tana or something like that.”  **She thought for a moment.  **“Also mentioned a brother, but not if he was older or younger.  He wasn’t in the flimsi, though.”  **\n\nShe wished she had a flimsi of Caz.","timestamp":"2026-01-05T02:34:43.478000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457568337847652487","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He shook his head in disbelief yet he knew he wasn’t dreaming.   He heard what Iyola had said plain as day.  Kiera was fighting to retake Mandalore with Clan Kyrze.  \n\n\n***Kiera.***  He said the name to himself once more.  ***Could it be?***  He thought as he took a deep steadying breath.   His Mandalorian and Jedi training kicked in as he fought to reign in emotions.  It wasn’t working well.   \n\n\n**”I know nothing of a younger brother.  I don’t recognize the name.   I do recognize the name Kiera.   It was also my mothers name.”**  His eyes widened and he turned quickly.   The previous unsteady moment had already passed.  \n\n\n**”I have questions that need to be answered”** He turned his head as he quickly walked.  **”You coming?”**\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-05T02:56:12.053000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457569890117488720","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola smiled at Wes's enthusiasm.  **“Sure, Wes. Coming with.” ** She also needed to pick up her credits from Serena Foss. One way or another, she was going to the Neon Nook. \n\n*Was it possible that Kiera was Wes’ daughter?*  Iyola wondered.  She absent-mindedly rubbed her upper arm, where her implant was.  Her mother had insisted on conception control implants from the time she was a youngling.  She hoped they still existed in this time, because she was due to reup hers pretty soon.","timestamp":"2026-01-05T03:02:22.143000+00:00","edited_timestamp":"2026-01-05T03:03:26.095000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457585130611802173","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes, now a man possessed by a sudden, overwhelming hope and a storm of unasked questions, strides purposefully through the impersonal corridors of Kando's Coursers' compound, his helmet tucked under his arm. Iyola, a picture of determined efficiency, falls into step beside him, a curious blend of their respective personas. The efficient clicks of her bootheels and the heavier, deliberate cadence of his armored footsteps echo in the sterile quiet. They pass through the various secure zones, each scanner's soft hum a familiar passage, their ident chips seamlessly granting access.\n\nSoon, the muted thrum of the main hangar bay grows stronger. As the heavy blast doors hiss open, the vast, well-lit space of Ghurn's private facility is revealed once more. The *Venture* looms impressively at its docking ring, silent and imposing. Next to it, the *Atin Oya'ka* sits berthed, its gangplank extended, a welcoming, familiar silhouette.\n\nAnd waiting at the base of the *Atin Oya'ka*'s gangplank, a small smile playing on her lips, is Varda.\n\nVarda appears remarkably refreshed, the earlier fatigue and spiritual agitation completely absent. She wears the same clean white blouse and patchwork skirt from before, but the fabric seems to shimmer faintly, and the small gemstones woven into her braids and embroidered into her skirt glimmer with a renewed inner light. Her gaze is serene, her posture straighter, imbued with a quiet, deep-seated calm. Her staff, leaning casually against her side, seems to pulse with a low, steady energy that only Wes might perceive with his Force-attuned senses. She radiates a profound, almost ancient, tranquility.","timestamp":"2026-01-05T04:02:55.760000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1457585148311765042","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Well now, if it isn't the reunited, if somewhat harried, adventurers,\"** Varda says, her voice smooth and warm, her eyes twinkling with amusement as Wes and Iyola approach. She offers them a calm, knowing smile, the subtle mischief from earlier now replaced by a deeper, almost prophetic, glint in her violet eyes. **\"I trust your little scouting expedition was... *enlightening*?\"** She inclines her head slightly, her gaze passing over them, missing nothing of their agitation, or the storm brewing beneath Wes's carefully maintained composure.","timestamp":"2026-01-05T04:02:59.980000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Varda Nisyren"},{"id":"1457707231289282592","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"His heavy footfalls were a longer stride than Iyola's shorter softer ones.  Between the two of them a cadence began to take shape between the two of them.  It was beginning to have an effect on Wes.  The rhythm was beginning to allow him to focus and begging to get his emotions somewhat under control.  \n\n\nThoughts fired off in his head.  The statistical possibility or impossibility that they rescued Marina’s daughter from the slavers after waking up was unfathomable.  It was just another question thrown on top of all the others that were now coming to mind.\n\n\nSounds of maintenance drew the determined Mandalorian from his thoughts as they entered the hangar bay of the Skirata.  The Skirata, how did they end up answering Marina’s call for help.   Realization had begun to set in.  The Del-Fin were scattered.  Broken.  Hunted by the Empire.  He wasn’t even sure if his own father or the clan still existed.   The means he had given Marina to reach out for help wasn’t just to his clan but to the clans as a whole.   \n\n\nAs they rounded one of Ghurn’s Skirata’s ships the *Oya’ka* came into view.   Her gang plank was extended and waiting for them was Varda.   A knowing smile graced her features as if the old woman already knew what was happening.  The old witch was calm and if Wes knew anything that meant she was dangerous.   \n\n\nHer voice was calm and cool as if she knew what was happening.  Perhaps she did.  Wes was doing little to hide his presence.  Anyone who could sense a disturbance would feel his coming.  Remembering his training he pulled his presence inward and let out a deep breath.  It wasn’t easy as it took two attempts to reign in the torment of emotions running through him.  The out of control whirlwind of emotions that surrounded him diminished to a small gale as he took one last breath.  Varda’s tone and calm composure said more than she was giving away.\n***","timestamp":"2026-01-05T12:08:06.830000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457707326159978510","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**”Yes, except the enlightening part happened as we were returning.”**  He spoke with a surprising amount of control as he looked around for Nadia.   His fingers tapped on his helmet that was tucked beneath his arm.   It was a telltale sign of his.   Anxiousness was eating at him.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-05T12:08:29.449000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457719259575619595","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda's serene smile deepens, her eyes twinkling with amusement as Wes struggles for composure. She offers a silent, almost sympathetic nod, acknowledging the storm raging beneath his carefully controlled exterior. Her gaze follows his, subtly tracking his search, and a flicker of deeper understanding crosses her face as she easily surmises the object of his intense attention. The weight of newly discovered, explosive truths.\n\n**\"The most profound enlightenments often strike when one is least prepared, or in moments of transition,\"** Varda says, her voice soft but resonating with ancient wisdom. She gestures with an open hand towards the extended gangplank of the *Atin Oya'ka*, a warm, silent invitation. **\"But the hangar floor is not the place for such profound... *processing*. The *Oya'ka* awaits. Come, let us go inside. Perhaps there, amidst proper company, these new enlightenments can be... *shared*.\"** Her gaze, though direct and unwavering, holds no judgment, only a deep, almost maternal understanding.","timestamp":"2026-01-05T12:55:54.597000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Varda Nisyren"},{"id":"1457778590451105834","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes was already looking around the hanger bay as Varda spoke.  Her voice was soft but it carried well in the vast hangar despite the noise of routine maintenance.  He was shaking his head in frustration at not seeing Nadia.  In his current state he didn’t even think of using the Force to reach out to locate her.  \n\n\nHe brought his attention back to Varda as she continued to speak.  As much as she would never admit it, her words sounded like they were from Master Davion himself.   Calm, provoking and introspective.  \n\n\nHe raised an eyebrow as she suggested they continue to talk aboard the *Oya’ka* and how it would be a better place for ‘enlightenment.\n\n\n***She knows.***  He thought as he looked up the gangplank.  Despite being calmer he still wasn’t in the mood for word play.  He gave Varda a quick nod.   **”Some privacy might be in order.”** He said as he moved for the gangplank as thoughts and images of Marina swirled in his head.  Her infant daughter he sensed from using the lifestone when they were on Fakir.  Then there was maybe the most profound and scariest one of all.  The thought that her sister may very well be his daughter.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-05T16:51:40.180000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Wes Del-Fin"},{"id":"1457868107266658376","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola was glad to see that Varda was all right, though she wasn’t used to the older woman looking so glamorous.  She spoke as if she was already aware of the new information she’d given Wes.  Maybe she was.  Either a microtagger or Force magic. Either way, it was fine with Iyola if Wes shared his emotional revelations with Varda, who seemed very eager to chat.   \n\nShe wondered where Ghurn and Nadia Skirata and Serena Foss were.  It was odd that none of them were here.  They’d practically been jumping down her throat before this mission.  Besides which, Serena had promised to convert some very valuable gems into credits for her, and they should be ready by now. \n\nIyola dug up the secure frequency Serena had given them.  **“Hey, we’re here if you want to debrief us or whatever,**” she said into her commlink.","timestamp":"2026-01-05T22:47:22.652000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Iyola Kett"},{"id":"1457878207498817734","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda's lips curve into a faint, almost imperceptible smile as Wes confirms his need for privacy. She gives him a slow, measured nod, her eyes reflecting a deep, almost ancient understanding. **\"Privacy is a balm for the spirit,\"** she murmurs, her voice soft but resonant. **\"And clarity is a gift the Force offers in its own time, and its own way.\"** She then gestures towards the gangplank, a silent invitation for him to lead the way.","timestamp":"2026-01-05T23:27:30.735000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":32,"thread":{"id":"1457878207498817734","type":11,"last_message_id":"1459238725413245142","flags":0,"guild_id":"661388927734775859","name":"Echoes of the Past","parent_id":"1435992787584679936","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"208916238661844993","thread_metadata":{"archived":false,"archive_timestamp":"2026-01-05T23:37:09.019000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2026-01-05T23:37:09.019000+00:00"},"message_count":43,"member_count":3,"total_message_sent":86,"member_ids_preview":["352982222636187659","626586611500711967","208916238661844993"]},"components":[],"userName":"Varda Nisyren"},{"id":"1457878448184758435","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As Wes and Varda ascend the gangplank of the *Atin Oya'ka*, their boots echoing softly on the durasteel, a crisp, professional voice immediately responds to Iyola's commlink query.","timestamp":"2026-01-05T23:28:28.119000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Storyteller"},{"id":"1457878450227384341","channel_id":"1435992787584679936","author":{"id":"1436384190198448270","username":"Serena Foss","avatar":"7765d78b4383748b2af3d3877c5b06b1","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"***\"Acknowledged, Iyola,\"*** Serena's voice is smooth and efficient, a stark contrast to the charged atmosphere. ***\"The Chief is currently occupied. A full debriefing is scheduled for 1800 hours in Meeting Room Gamma. An escort will be dispatched to guide you at 1745. In the interim, please consider yourselves at liberty to rest and recuperate. Your credits have been successfully converted and are now available on your ident chips.\"*** The message concludes with a brief, professional silence, leaving no room for further discussion. Looking at the chronometer, there's a few hours before the scheduled debriefing.","timestamp":"2026-01-05T23:28:28.606000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"userName":"Serena Foss"},{"id":"1457880647942275205","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes sets a determined pace up the gangplank, the heavy thud of his armored boots a counterpoint to the quiet storm of emotion swirling within him. Varda, a knowing silence about her, follows with unhurried grace. \n\nThey pass through the quiet, familiar corridors of the *Atin Oya'ka*'s upper deck, the low hum of the ship a constant, comforting presence. The scent of caf and spices, leftover from breakfast, still clings to the air. As they enter the main lounge, the warm, ambient lighting and plush furnishings offer a quiet refuge from the bustling hangar and the lingering tensions of their mission. The large holoscreen displays a serene, rotating vista of Cloud City's upper reaches, its peaceful beauty a stark contrast to the hidden currents flowing through the ship.\n\nWes's gaze sweeps the comfortable space. He notes the empty chairs, the quiet stillness. He heads directly to the far side of the lounge, towards a cluster of plush seating in a secluded alcove, indicating his clear desire for privacy.\n\nWes Del-Fin (@yogi_001)","timestamp":"2026-01-05T23:37:12.582000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[{"id":"352982222636187659","username":"yogi_001","avatar":"42efdd81c920262f5537ca8c4a23e619","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Yogi","avatar_decoration_data":{"asset":"a_c12a5c953352c20bd6e63576e2cce3a0","sku_id":"1440174638930853956","expires_at":1768507200},"collectibles":null,"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"552020084776763413","identity_enabled":true,"tag":"TCP","badge":"b184c153dc04b7955c319eb864d31d79"},"primary_guild":{"identity_guild_id":"552020084776763413","identity_enabled":true,"tag":"TCP","badge":"b184c153dc04b7955c319eb864d31d79"}}],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":1,"userName":"Storyteller"},{"id":"1457886549042532508","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola allows the connection to Serena to end without any comment on her part.  *How delightful, another Mandalorian escort*.  At least she has her credits.  She has to make sure not to spend them on any Skirata errands.\n\nFor the time being, she’s curious about this fraught moment that she’s inadvertently created, and tags along after Wes, selecting an ottoman in the vicinity of the alcove.  He can either bring her in or shoo her away; it's up to him.","timestamp":"2026-01-06T00:00:39.514000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":3,"userName":"Iyola Kett"},{"id":"1457890576992309437","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":null,"discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Entering the main lounge Wes looked around.   It was empty and more importantly quiet.  He looked at the view screens with the quiet views of Cloud City.  The serene vistas did little to calm the torrent of thoughts and emotions that currently clouded his normally calm.   \n\n\nThe quieter footfalls of Iyola and the rhythmic tapping of Varda’s walking stick followed closely behind.  Seeing the empty chairs on the far side of the lounge, Wes took a straight line approach to the area and sat his helmet down on the table.  Then he sat on the couch.   Elbows on his knees he let his head rest in his hand for a moment before lifting it.   He saw Iyola already seated and Varda only a few steps away.  ***She can be quick when she wants to be.***  He thought.   \n\n\n**”I don’t know where to begin.    Iyola already has the beginning of the picture and for some reason I think you already do too.”**  He said, looking at Varda as she came closer.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T00:16:39.852000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":5,"userName":"Wes Del-Fin"},{"id":"1457892592543990043","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda pauses, her eyes meeting Wes's as he speaks. Her lips press into a thin, knowing smile. The comfortable cushion of a nearby chair beckons, and she lowers herself onto it, her staff resting lightly across her knees. Iyola's eager presence is a small, vibrant spark in the quiet lounge.\n\n**\"The beginnings of all stories are often found in the quiet whispers before the storm, Wes,\"** Varda says softly, her voice rich with a blend of Dathomiri wisdom and a subtle, almost chiding, maternal concern. She glances pointedly at Iyola, then back to Wes, her gaze sharp. **\"Or in the unspoken secrets held by those who believe themselves to be alone.\"**\n\nShe lets out a soft, almost weary sigh, a flicker of true sadness passing through her violet eyes before her usual calm reasserts itself. **\"I confess I heard some fragments, much as you seem to have heard some from our enthusiastic friend. Bits and pieces, like scattered starlight through ancient branches. And yes, my own senses have... illuminated certain possibilities. But some truths are not mine to speak. They are threads for other hands to weave.\"**\n\nShe gestures with her staff towards Wes, then to the depths of the *Oya'ka*, indicating the general direction of Nadia's current location in her quarters. **\"A daughter's tale is hers alone. And a warrior's secrets, though heavy, are hers to lay bare when she is ready. Your paths here are intertwined in ways far more ancient than either of you yet fully grasp. And the Force, you see, rarely shows all of its hand at once. It guides. It does not dictate.\"**","timestamp":"2026-01-06T00:24:40.397000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":7,"userName":"Varda Nisyren"},{"id":"1457906351484178599","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola looks back and forth from Wes to Varda. She considers herself pretty sharp linguistically, but it takes her a bit to interpret Varda’s cryptic statements. “**So are you saying that you had an idea about Wes and Marina and Nadia, but you think that Nadia should be the first person to do anything?”**  she guesses.  **“Why did the Force tell you and not Wes?” **\n\nShe doesn’t say anything about the oddly pointed look toward her when Varda mentioned unspoken secrets.  What did Varda mean by that?  That Iyola shouldn’t have said anything? *Too late for that. *","timestamp":"2026-01-06T01:19:20.784000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":9,"userName":"Iyola Kett"},{"id":"1457916181280325642","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda's gaze settles on Iyola, a flicker of amusement in her eyes as the younger woman grapples with the Dathomiri's layered words. She watches Wes in her peripheral vision, sensing the tightening of his composure. The silence in the lounge is pregnant with unspoken expectations.\n\n**\"The Force, child, speaks to all who listen, but it does not shout in one tongue only,\"** Varda says softly, her voice still resonating with the quiet power. She offers Iyola a gentle, almost chiding smile. **\"And it tells what is needed, when it is needed. Sometimes, it speaks in visions, sometimes in feelings, and sometimes… sometimes it speaks through the wisdom of those who choose to trust another.\"**\n\nShe inclines her head subtly towards Wes. **\"Nadia and I spent a long night under the stars. We shared many words. She shared with me… what was weighing on her heart. The truths you speak of, Iyola, came to me in trust.\"** Varda's gaze is direct, unwavering.\n\n**\"As for who should act first?\"** Varda continues, a hint of steel entering her voice. **\"The Force is not a hand that dictates, but a current. To jump into the river before you know its depths is foolishness. To deny another their journey of understanding… that is hubris. Nadia holds many threads of this web. Some, she is just beginning to unravel herself.\"** She holds Iyola's gaze, a clear message in her eyes. **\"Her path to clarity is her own.\"** Her focus shifts to Wes. \"**Though it is one you may both need to traverse together.**\"","timestamp":"2026-01-06T01:58:24.390000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":11,"userName":"Varda Nisyren"},{"id":"1457929955898818737","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes listened as Varda explained what she had meant.   While she spoke directly all Wes had to do was to close his eyes and he would have sworn he heard one of the masters aboard the Chu’unthor II speaking.   Apparently one didn’t have to be a Jedi master to weave words together to make it sound prophetic.   \n\n\nWhat she said had truth weaved into it.  To act hastily would be folly.    He was ready to talk but clearly Nadia wasn’t.  As much as it pained him to sit where he was when he wanted answers it was the right thing to do.  He gave a small laugh and looked over to Varda.  **”I have two people I’d like you to meet.   First would be Master Davion.   The two of you would be able to have quite a chat.   Second would be the Warmaster.   I think you would give the old Mandalorian a run for his credits.”**  He smiled slightly.   **”Chase is out there somewhere I’m sure.  As is the Warmaster but unfortunately his holocron was not with me when we awoke.”**\n\n\nHe let out a deep breath as he looked back towards the crew quarters.  He wanted to reach out to Nadia but didn’t.   Varda was right.  This couldn’t be rushed.  **”For ten years I was on the run from the Empire.  Always staying one step ahead.  When I came back from the unknown regions I knew I couldn’t sit back any longer.  I had heard rumors of an underground group helping force sensitives and their families find safety from the Empire.  It took a while but I eventually gained some trust and started running fugitives from the Empire because they or a loved one had potential with the Force.”**\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T02:53:08.515000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":13,"userName":"Wes Del-Fin"},{"id":"1457930021648863233","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He looked back to Varda and then to Iyola.   **”I find myself in a similar situation now as I did then.  They needed help in some form.  Safety, someone to talk to or just knowing that they and their loved ones were being taken somewhere they wouldn’t be hunted.  Sometimes it was just someone to listen to them.”**  He took a deep breath as he looked back to Varda.   **”As much as I want to talk to her, need to talk to her about Rin….”**  He let out a big sigh as he leaned back into the plush chair unsure of what to say.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T02:53:24.191000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":15,"userName":"Wes Del-Fin"},{"id":"1457936881206562950","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda listens to Wes, her ancient eyes fixed on his face, tracing the echoes of his lost decade. The names he speaks – \"Master Davion,\" \"the Warmaster\" – resonate with a familiarity beyond mere hearing, stirring faint, almost ghostly, currents in her mind. Her lips curve into a wistful smile as he describes his desire for her to meet them.\n\n**\"Ah, to trade philosophies with a master of inner stillness,\"** Varda murmurs, her voice soft, imbued with a longing that feels ancient and profound. **\"And to test wits with a warrior who valued strength and spirit above all else. Yes... those would indeed be illuminating conversations, Wes. Perhaps, one day, the threads will align.\"** A hint of sadness tinges her tone as he mentions the lost holocron, a profound empathy for the missing pieces of his past.\n\nAs he speaks of his years on the run, of becoming a shepherd for Force-sensitives and their families, Varda gives a slow, deliberate nod. Her gaze shifts to Iyola, then back to Wes, acknowledging the profound truth in his words.","timestamp":"2026-01-06T03:20:39.637000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":17,"userName":"Varda Nisyren"},{"id":"1457936928686084147","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"The weaving of life, you see, is never finished until the last breath is drawn,\"** Varda states, her voice low and resonant, filled with an unwavering certainty. **\"You speak of helping, Wes. You speak of listening. You speak of guiding the lost to safety.\"** She gestures with her staff, the carved wood catching the light as if alive. **\"This is not a new path for you, *vod*.\"** The Mando'a term, used with deliberate weight, is a rare, deep acknowledgment of his chosen ethos, bridging the gap between his Force sensitivity and his Mandalorian core.\n\nShe leans forward, her violet eyes, usually so distant, now clear and intensely focused on his. **\"As for Nadia… you walk beside her. You feel her static, her pain, her silent need to anchor. Show her, then, that she is not adrift. That she is not alone. Sometimes,\"** Varda says, her voice softening, **\"the silence you offer is more potent than any words. Be the stillness she can lean on. The calm eye in her storm. The path, then, will reveal itself.\"** Her gaze then sweeps over to Iyola, including the young explorer in her silent charge, inviting her to be a part of this collective act of empathy.","timestamp":"2026-01-06T03:20:50.957000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":19,"userName":"Varda Nisyren"},{"id":"1457937178922320125","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola liked the Jedi.  She always had, as long as she could remember.  She enjoyed working with them on her brief SurveyCorps joint program on Vinee. She liked their learnedness, their kindness and selflessness, their gorgeous white and gold uniforms, and their mysterious lightsabers.  There were things she didn’t like as well, and chief among them was their convoluted philosophy, which to Iyola seemed to ask them to wait patiently, passively, until the magical Force tapped them on the shoulder.  Varda wasn’t even a Jedi, but she still talked like one.  And a Jedi-esque lecture about her ignorance of the will of the Force was not what she was in the mood for right now.\n\nWes talked about some Jedi he’d known - Iyola assumed they were Jedi, anyway - and then again reminisced about his time in the Unknown regions.  Iyola was curious about his experiences there, but this wasn’t really the time to ask. He’d helped Force sensitives escape - this must be this horrible Purge she’d heard about.  He pondered whether he should talk to Nadia.  Iyola stood up and started pacing back and forth. This conversation was driving her mynockshit crazy.\n\n**“Seriously?”**  she said to them.  **“Wes, just go talk to Nadia.  Nadia already talked to Varda, she clearly wants to talk about Marina.  Jump in the kriffing metaphorical river already.  If Nadia doesn’t want to talk about it, she’ll tell you so, or punch you, something Mandalorian like that.\"**   She turned to leave, then turned back. ** “If somehow I met someone who personally knew my boyfriend, or my family, they’d have to cut me in half to keep me away.”**","timestamp":"2026-01-06T03:21:50.618000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":21,"userName":"Iyola Kett"},{"id":"1457956275387105302","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes looked from Varda to Iyola as they talked.  They all came from different times with different beliefs and yet from this day forward he would call both of them friends.   As they each spoke they both said the same thing.  Both with their own spin and insight.  \n\n\nThat he needed to get off his ass and go be there for Nadia.  Not as a father or a fellow Mandalorian but simply as a friend.  He closed his eyes and took a deep breath.  Upon opening them he stood and looked at both women.  He smiled at the obvious differences and the similarities both shared.  **“Thank you.   Both of you.”**  Reaching down he grabbed his helmet.   **”I owe you both a debt that I may never be able to repay.”**  He gently shook his helmet at both women.   **”Kiera, my mother, would often say that Mandalorian men always needed to wear their helmets.  The reason for this is because they often needed to be hit in the head to see the forest through the trees.”**  He gave them both a quick nod along with another smile.  \n\n\nHe moved quickly and with a surprise calm.   Gone was the anxiety of earlier when he discovered who Nadia was.   Now he moved with a purpose.  She was Mandalorian and she was the daughter of the woman he loved.  That made her family.  What kind of family he didn’t know.   Only time would reveal that.   \n\n\nHe headed for the corridor that led to the crew quarters.  Thoughts of what to say swirled around in his head.  All of a sudden he was at a loss for what to say.  That he still could not sense Marina through the bond was unsettling; he hoped that Nadia could maybe tell him why.    He held no expectation that it would be today but someone needed to take that first step.   \n\n\nHe looked up at the door controls to her cabin and hesitated for an instant.  With thoughts of Marina he hit the chime button to her room.  Announcing that someone was there.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T04:37:43.570000+00:00","edited_timestamp":"2026-01-06T04:39:12.212000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":23,"userName":"Wes Del-Fin"},{"id":"1457965866896461844","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes moves through the *Atin Oya'ka*'s quiet corridors, the anxiety that plagued him replaced by a focused, determined purpose. His footsteps echo, measured and strong, until he stands before Nadia's cabin door. He brings his hand up, his thumb hovering over the chime button, thoughts of Marina swirling, a new courage born of Varda and Iyola's combined nudges. He presses the button.\n\nThe soft chime sounds within the cabin, but there is no response. The door remains firmly sealed, a silent, unyielding barrier.\n\nWes waits, but the door stays locked, the cabin's interior remaining a private sanctuary. He turns, a faint ripple of confusion, then disappointment, in his Force presence. Just then, a faint, rhythmic sound, almost like a low thrumming, approaches from further down the corridor – from the direction of the gym.\n\nNadia appears, not from her cabin, but from the corridor leading away from the common areas. She moves with a slow, deliberate grace, her helmet still held under her arm. Her posture is relaxed, her previous tension seemingly having dissipated into the very air around her. Her gaze, when it meets Wes's, is calm and direct, revealing nothing of her internal turmoil.","timestamp":"2026-01-06T05:15:50.364000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":26,"userName":"Storyteller"},{"id":"1457965869488410674","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Nadia Skirata","avatar":"b896375bd56e975a0838c79f352ab28e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Wes,\"** Nadia says, her voice low and even, a new timbre of control replacing her earlier weariness. **\"Were you looking for me? I decided to… clear my head. The gym is quite well-equipped.\"** Her blue eyes are clear, holding a quiet strength, but also a carefully constructed wall that dares him to push.\n` `                              <:fett:1287130263851368489> Off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Notable-Allies#nadia-skirata>)","timestamp":"2026-01-06T05:15:50.982000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":27,"userName":"Nadia Skirata"},{"id":"1458098064882663576","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes heard the soft chime sound off within Nadia’s quarters.  When there was no response he found himself looking last and right wondering if she was even in there.   Again he thought about reaching out but he knew that may not be the best course.  The door's portal remained unchanged.  Closed, locked, preserving the sanctuary that it protected.  \n\n\nHe shook his head taking a half step back from the door as disappointment started to settle in.  He was about to turn and head back but the familiar sound of booted feet made him pause.   A moment later Nadia appeared down the corridor.  Remembering that the rec area was down that way he realized that she must have been there.   \n\n\nShe looked relaxed.   He remembered that there was a rec area in the aft section.  It looked and felt like she had been using the facilities there.   The effort looked like it had the desired effect.  It translated and carried when she noticed him.  He sensed that she was relaxed.  The physical effort of spent energy had the desired effect of calming the mind.   \n\n\nHe nodded at her question.  His determination was still present but his features softened as he saw her eyes.  How he didn’t notice it the first time he didn’t know.  There was no denying it now.  They were exactly like her mothers.   With that realization any doubt that he may have had fell away.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T14:01:08.820000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":29,"userName":"Wes Del-Fin"},{"id":"1458098164572880999","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**”I…”**  He paused as he felt her presence and it took him back twenty years.  To a much simpler time.  Where he sat upon a duracrete floor in a warehouse on a backwater planet named Fakir.  There he attempted one of his first tests in the Force.  He held a life stone that Marina had in her possession.  He had no idea what it was or what it represented.  What he discovered was that it was tied to a little girl tucked away safe from the galaxy.  That little girl was her daughter.   Remembering the feeling of trust that Marina had given him in the moment brought a small smile to his face.  Now looking at Nadia he finally saw what he had failed to see all along.  \n\n\nThis was that little life she had protected.  How he didn’t sense it he didn’t know.  His first attempt at using the Force had come full circle.   \n\n\nHis eyes softened as his smile turned into the smile he used to use for her mother.  **”That’s one of the best ways to clear one’s head and yes.   I was looking for you.”**\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T14:01:32.588000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":31,"userName":"Wes Del-Fin"},{"id":"1458118923378622667","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Nadia Skirata","avatar":"b896375bd56e975a0838c79f352ab28e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Nadia gives a nod in agreement, her weight shifting uneasily. The soft light of the corridor catches the faint flush on her cheeks, and a subtle tension returns to her shoulders. **\"Varda showed me some... alternative meditation techniques. They require more room than can be found in quarters,\"** she says with some forced lightness. The direct, intense way Wes looks at her, the sudden softness in his eyes, makes her feel wary. It is a look too intimate, too perceptive, stirring an unease she cannot quite place. She feels the subtle shift in his Force presence, the raw emotion swirling beneath his calm exterior, and her own carefully constructed walls rise a fraction higher.\n\n**\"Was there... something specific you needed, Wes?\"** Her voice is low, firm, gently trying to redirect the conversation, subtly probing the reason for his unexpected appearance and intense gaze. She avoids his direct gaze, her eyes scanning the empty corridor.\n` `                              <:fett:1287130263851368489> Off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Notable-Allies#nadia-skirata>)","timestamp":"2026-01-06T15:24:01.873000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":33,"userName":"Nadia Skirata"},{"id":"1458132077773066483","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Upon seeing her reaction and subtle shift he reigned himself in.   Her original relaxed posture had become more guarded.  His memories brought up strong emotions and he was doing little to keep it under wraps.  \n\n\nClearing his throat he regained his composure and looked quickly back to where the common room waited.   **”We came back a little bit ago.  I’m sure your uncle will expect a debrief soon.”** \n\n\nHe took a half step back and stopped.  He knew he couldn't just walk away.  He had come for a reason and he needed to at least let her know that he knew.  Then it would be up to her to decide what she was comfortable with.   \n\n\nSlowly he turned back, his face was more neutral.  The serious nature of his next words were evident on his face if not in his Force presence.   **”There is one more thing.  I think it’s important for both of us.”**  His demeanor softened a bit as he looked at her. \n\n\nHe found himself taking a quick breath as he searched for the words.    The ones he had earlier had evaporated into the ether.  **”When you’re ready and you want to talk about your mother, all you have to do is ask.  I’ll put whatever I’m doing on hold and answer your questions.”**  \n\n\nHe found his breath leaving and took a deep breath.  Glad that the hurdle was finally dealt with he took a breath.  He didn’t know what her response would be or if she was ready but the ball was in play.\n***\n<:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T16:16:18.125000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":35,"userName":"Wes Del-Fin"},{"id":"1458153359138619443","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Nadia Skirata","avatar":"b896375bd56e975a0838c79f352ab28e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Nadia grows utterly still, her shoulders subtly tensing, all external signs of her earlier composure vanishing in an instant. Her face, previously softened by Varda's strange meditation, hardens, pale and stark in the corridor's dim light. Wes's words, gentle as they are, land like hammer blows. Her blue eyes, wide and suddenly vulnerable, meet his for a long, fraught moment. She feels the truth in his Force presence, his sincere offer, but the raw grief for her mother and the overwhelming paradox of his living presence simply crack her carefully built control.\n\nShe takes a slow, shaky breath, fighting the rush of tears, fighting the urge to fall apart again. When she finally speaks, her voice is a near-whisper, thick with the full, devastating weight of her grief, accusation, and utter disbelief.\n\n**\"She said you were dead, Wes.\"** The words are flat, devoid of question, a simple, brutal statement of the deepest truth she knew, one that cuts to the core of everything. She offers no other words, simply lets that profound, aching fact hang in the silence between them, her gaze unwavering, forcing him to face the monumental lie woven into her life.\n` `                              <:fett:1287130263851368489> Off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Notable-Allies#nadia-skirata>)","timestamp":"2026-01-06T17:40:51.998000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":37,"userName":"Nadia Skirata"},{"id":"1458169536749633690","channel_id":"1435992787584679936","author":{"id":"208916238661844993","username":"aliciagd","avatar":"d7832f2cac5df42d164b81e35de34f09","discriminator":"0","public_flags":0,"flags":0,"banner":null,"accent_color":null,"global_name":"Alicia","avatar_decoration_data":{"asset":"a_9034e8f9670d1d1bb773cebba4ecf6ce","sku_id":"1432550258168299651","expires_at":null},"collectibles":{"nameplate":{"sku_id":"1427463138646954035","asset":"nameplates/orb/infinite_swirl/","label":"COLLECTIBLES_ORB_INFINITE_SWIRL_NP_A11Y","palette":"violet"}},"display_name_styles":null,"banner_color":null,"clan":{"identity_guild_id":"480488957889609733","identity_enabled":true,"tag":"Sage","badge":"a97b2236adc3b0f190ee75428db3a914"},"primary_guild":{"identity_guild_id":"480488957889609733","identity_enabled":true,"tag":"Sage","badge":"a97b2236adc3b0f190ee75428db3a914"}},"content":"Nanite Mysteries","timestamp":"2026-01-06T18:45:09.041000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"type":18,"message_reference":{"type":0,"channel_id":"1458169536749633690","guild_id":"661388927734775859"},"flags":32,"thread":{"id":"1458169536749633690","type":11,"last_message_id":"1459595663284375781","flags":0,"guild_id":"661388927734775859","name":"Nanite Mysteries","parent_id":"1435992787584679936","rate_limit_per_user":0,"bitrate":64000,"user_limit":0,"rtc_region":null,"owner_id":"208916238661844993","thread_metadata":{"archived":false,"archive_timestamp":"2026-01-06T18:45:09.041000+00:00","auto_archive_duration":4320,"locked":false,"create_timestamp":"2026-01-06T18:45:09.041000+00:00"},"message_count":23,"member_count":2,"total_message_sent":46,"member_ids_preview":["626586611500711967","208916238661844993"]},"components":[],"userName":"aliciagd"},{"id":"1458169555250839735","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"With Wes's armored footsteps fading down the corridor, a sudden quiet settles over the *Atin Oya'ka*'s lounge. Varda, her ancient eyes still gleaming with purpose, rises gracefully from her chair. The space feels different without Wes's intense presence, lighter, yet still imbued with the lingering echoes of profound revelations.","timestamp":"2026-01-06T18:45:13.452000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":1,"userName":"Storyteller"},{"id":"1458169557234614302","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Varda Nisyren","avatar":"14d583853ee8dc32e686b8feb7f254fe","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Varda turns to Iyola, a faint, almost mischievous smile touching her lips. **\"Sometimes, child,\"** she murmurs, her voice soft but resonating with inner calm, **\"the Force moves in patterns that are clearest when we ourselves are still. I believe I have spoken enough this day. I have... much to contemplate. My spirit demands its solitude..\"** She offers Iyola a gentle, knowing nod, and with a rustle of her knitted cardigan, she turns and walks with measured, unhurried steps towards her own quarters, leaving Iyola alone amidst the plush seating and the serene vistas on the holoscreen.","timestamp":"2026-01-06T18:45:13.925000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":2,"userName":"Varda Nisyren"},{"id":"1458172775054184645","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Nadia’s emotions hit him like a bull freighter and he wasn’t ready for it.  He remembered what it was like to lose his own mother but her situation was different.  They were both Attuned to the Force and with each other.   He knew the emptiness she felt but it wasn’t the same.   Marina was her mother.  \n\n\nHer grief was overwhelming and he simply nodded his head slowly at her words.  He felt the myriad of emotions that now comprised her and he began to wonder if he did the right thing.   \n\n\nHe held her gaze as his facial expression softened.  **”I think she was right.”**  His hand came up to his abdomen where the brutal scar was from the lightsaber wound he woke up with.   **”I don’t know what happened to me.  I remember being on a mission for the Path and picking up a family.  Two kids and their father.  That was nine years ago.  Then waking on the *Venture* with the others.  There’s a hole in my memory and try as I might I can’t remember what happened.  All I have to tell me that something happened is this scar.  I have no explanation.”**   \n\n\nHe shrugged his shoulders softly as his lips drew into a thin line.  **”Whatever happened to me must have done something to the bond Marina and I shared.  At least that’s what I thought when I couldn’t sense her.   Not that…”**   He stopped talking.   He could say it as that would make it real.  His broad armored shoulders dropped slightly as he finally had to accept the idea that she was gone.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-06T18:58:01.113000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":39,"userName":"Wes Del-Fin"},{"id":"1458178058594029827","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Nadia Skirata","avatar":"b896375bd56e975a0838c79f352ab28e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Nadia's body remains rigid, but she watches Wes, her blue eyes, still raw with tears, fix on the slight, almost imperceptible tremor of his hand as he touches the scar on his abdomen. His words, delivered with a raw honesty that mirrors her own pain, are a testament to the immense, shared burden of loss and fractured memory. His broad shoulders, usually so firm, slump slightly, a vulnerable gesture that reaches deep within her Force-attuned empathy. She feels the finality of his grief, the dawning, devastating acceptance of Marina's loss. It is a profound, shared silence that echoes with the absence of their beloved Jedi.\n\nShe takes a slow, shuddering breath, trying to steady herself. She pushes back the surge of empathy, pushing past her own pain, focusing on a single, tangible anchor in this overwhelming storm of truth. Her hand slips into the pouch on her utility belt.\n\nWith trembling hands, Nadia pulls out a small, heavy coin, tarnished and dull, its edges worn smooth with age Her fingers trace the etchings: Wes’s own name set into one side. Nadia holds it out to him, her fingers brushing his. Her gaze, though tear-filled, is unwavering, direct, brimming with the agonizing truth she now fully comprehends. **\"She kept it, Wes,\"** Nadia chokes out, her voice raw, barely a whisper. **\"All these years.\"** \n\nA fresh wave of overwhelming emotion washes over her, the weight of the past pressing down. With a final, choked sob, Nadia shoves the coin into Wes's hand, breaks eye contact, and then, without another word, she moves past him with a desperate, fluid motion.\n` `                              <:fett:1287130263851368489> Off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Notable-Allies#nadia-skirata>)","timestamp":"2026-01-06T19:19:00.807000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":41,"userName":"Nadia Skirata"},{"id":"1458255573366735054","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"There was an ever widening pit in his stomach and no amount of rationalization would fix it.   No *what if,* no *but maybe.*  Marina was gone.  He wasn’t here to try and prevent it from happening.  He senses the understanding in Nadia.  She could see him come to grip with the idea that Marina was no longer alive.  His stomach finally sank. \n\n\n***If only we had…***  He stopped the thought before it finished.  They both made choices that day.  They both thought they were doing the right thing.  That the war would end and then they would have the time they so wanted.  \n\n\nFate wasn’t on their side.\n\n\nA subtle movement from Nadia caught his attention.  She was digging into a pouch.  What she pulled forth nearly broke him as a tear began to cascade down his cheek.  The coin Nadia held was the same coin he had given her mother all those years ago.   He shook his head as he saw the smooth and worn edges.   It looked as if it had been handled often and gently for periods of time.   It was the coin he gave her.  He had given it to her as a just in case.  He remembered her asking if he was giving away secrets when he gave her the means to reach out for help.  Any other time he would have laughed.  \n\n\nNadia’s next words filled him with bitter happiness and profound sadness.  She had kept it.  She had never forgotten.  His next breath was a shuddering one as Nadia quickly grabbed his hand and shoved it into his palm.   He saw the look in her eyes and any walls he had left crumbled away.   It didn’t matter though as she was already past him.   Her last sob would forever be etched in this memory.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T00:27:01.769000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":43,"userName":"Wes Del-Fin"},{"id":"1458255664626274538","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Looking down at the coin he fought for control but it was pointless.  His hand closed around the smooth edges and the metal bit into his palm.  If he hadn’t been wearing his gloves he would have surely cut his palm.  He pulled in his presence.  It was the tightest he’d ever done it.  He needed time and didn’t need anyone else picking up on the emotions.  He took a step then another towards his quarters.  For now this was his to carry.   \n\n\nAlone.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T00:27:23.527000+00:00","edited_timestamp":"2026-01-07T00:28:46.629000+00:00","tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":45,"userName":"Wes Del-Fin"},{"id":"1458268597175455929","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes walked off, resolute in his determination to talk to Nadia about her mother.  Varda and Iyola looked at each other, Varda with her usual enigmatic smile, Iyola still somewhat puzzled.  With a nod and a closing comment about patterns and the Force, Varda walked off, likely for a nice nap.\n\nIyola wasn’t tired.  To the contrary - the talk had made her restless to do something.  \n\nShe thought back to the odd controller she’d found on the Venture.  Eve had told her that it could command nanites.  *Why not try it out?  She had time.*\n\nWhistling a tune (the  theme song to *Triple or Nothing*, a  short-lived holodrama), Iyola made her way back to the Venture.  Probably best to try it out in the old cargo hold.","timestamp":"2026-01-07T01:18:46.887000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":5,"userName":"Iyola Kett"},{"id":"1458277182408364188","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola, humming a jaunty tune to herself, navigates the pristine corridors of the Clan Skirata compound with a renewed sense of purpose. Her earlier restlessness, fueled by conversations of deep grief and ancient Force philosophy, now coalesces into a pragmatic need for action. Her pace quickens as she leaves the relative warmth of the *Atin Oya'ka* behind, passing through into the private hanger bay of Ghurn Skirata. The only other ship present in the bay is the snubfighter of a design Iyola is unfamiliar with. The *Venture* looms impressively at its docking ring, silent and imposing, its internal systems now thrumming with a newfound energy from Vekka's ongoing diagnostics.\n\nShe taps her ident chip on the terminal at the *Venture*'s airlock. With a soft hiss, the massive inner door cycles open, revealing the sterile, utilitarian entry bay. The subtle blue glow from Eve's holographic avatar shimmers into existence nearby as Iyola steps inside, the airlock hissing shut behind her.","timestamp":"2026-01-07T01:52:53.766000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":7,"userName":"Storyteller"},{"id":"1458277184648122550","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Welcome back aboard the *Venture*, Iyola. The technical assessment by Kando's Coursers technicians is proceeding as planned. Diagnostics are complete. Phase two repairs are projected to commence within two standard hours, contingent upon the successful restoration of my primary droid complements. Did you require assistance?\"**","timestamp":"2026-01-07T01:52:54.300000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":8,"userName":"Eve the AI"},{"id":"1458277243406127267","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola makes her way from the airlock, deeper into the *Venture*. The sterile quiet is now replaced by the distinct sounds of ongoing activity. From the mid-section, faint whirs and metallic taps indicate Vekka's team is actively working. Following the mental map she retained from her earlier exploration, she heads for the vast cargo hold and workshop.\n\nThe cargo hold is now a hive of activity. Though sparsely filled with actual cargo, several of Vekka's multi-limbed maintenance droids are at work, their optical sensors sweeping walls and conduits, emitting soft diagnostic beeps. Vekka himself, the lean, pale Rodian slicer, is hunched over a mobile console near one of the immense power conduits, a holographic schematic of the ship's internal damage projected before him. He mutters rapid-fire commands in Rodian to his droids, his cybernetic eye glowing with intense concentration.\n\nThe air is thicker here with the smell of ozone and faint, acrid cleaning chemicals. The cargo hold itself pulses with a palpable energy; the ship's power grid, now being actively probed and rerouted, thrums powerfully through the deck plating. Iyola can clearly see a cluster of small but deep pits and scoring marks on a large power conduit near Vekka's position – the micrometeoroid damage Eve had mentioned. This is definitely an active area of the *Venture's* power grid.","timestamp":"2026-01-07T01:53:08.309000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":10,"userName":"Storyteller"},{"id":"1458283735416836096","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"“**Hi Eve,”** says Iyola, as she walks back into the familiar hush of the *Venture.*  **“How’s the assessment going?  Did you miss me?”  **\n\nShe makes her way over the cargo hold.  She hears clanging from inside, and when she enters, she sees that it’s no longer the vacant space she remembers; it’s the site of a full-on repair operation.  That creepy Rodian she’d seen earlier is overseeing things, from the look of it, with a pack of droids.  She glances at the exposed power grid with very mild interest, and listens to Vekka’s directives with a bit more interest. Rodian has a passing relation to Huttese. She’s pretty sure she could pick it up within a few weeks if she wanted to.\n\n**“Hey there,” **she says, waving at Vekka.  **“Just stopping by to say hi.” ** This probably isn’t the best place for her test .  Maybe she’ll go to the lounge and see if the nanites can take one of those chaises apart.","timestamp":"2026-01-07T02:18:56.125000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":12,"userName":"Iyola Kett"},{"id":"1458291971025276940","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Welcome back, Iyola. My operational parameters do not include the simulation of 'missing' any specific individuals,\"** Eve replies, her synthesized voice still calm, but now with a subtle, almost imperceptible softening around the edges of the words. **\"However, your presence is noted. The assessment is proceeding efficiently, as previously reported. Did you require specific assistance?\"**","timestamp":"2026-01-07T02:51:39.647000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":16,"userName":"Eve the AI"},{"id":"1458291973998772327","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Vekka","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Vekka stiffens instantly at Iyola's cheerful greeting. His head snaps up from his console, his single cybernetic eye fixing on her with an unnervingly intense, suspicious glare. His pale green skin seems to flush a faint, sickly yellow with irritation. He mutters something in clipped Rodian that sounds distinctly unfriendly. His gaze sweeps over her, assessing her presence in his active workspace with obvious displeasure.\n\n**\"This is an operational area. Restricted,\"** Vekka rasps, his voice dry and hostile, cutting through the hum of the droids. He gestures curtly with a multi-jointed finger towards the main exit. **\"Unauthorized personnel interfere with diagnostics. State your purpose, or clear the zone.\"** His droids, as if sensing his agitation, subtly reorient their optical sensors towards Iyola.","timestamp":"2026-01-07T02:51:40.356000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":17,"userName":"Vekka"},{"id":"1458302081990529054","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"In his quarters Wes tried to find balance.   It was a fleeting effort for the moment.  There was no balance.  Just loss.   \n\n\nPain\n\n\nWith an irritated grunt he stood, grabbed his helmet and made for the door.   Upon opening he turned and headed for the same gym he saw Nadia coming from just a handful of moments earlier.   \n\n\nUpon entering the gym he saw the mat and walked towards it instantly.  Setting his helmet down outside the mat he took several steps towards the middle.   Since he had awoke on the *Venture* he hadn't practiced the form called Teras Kai.   It was a martial art aimed at combating force users.  He had learned from the holocron that Marina had lent him.  That was missing now as well.  \n\n\nWith a deep breath he started and still found no calm.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T03:31:50.289000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":48,"userName":"Wes Del-Fin"},{"id":"1458449343034949705","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes steps onto the clear, expansive mats of the *Atin Oya'ka*'s gym, the faint scent of recycled sweat and ozone filling the air. He sets his helmet aside, the hard shell a stark contrast to the plush mat. He closes his eyes, trying to center himself, trying to quiet the whirlwind of emotion that now rages within him: grief for Marina, confusion, a burgeoning, terrifying anger at the unknown forces that toyed with their lives. He attempts to move through the precise, fluid motions of Teras Kasi, but his mind is a fractured storm, his muscles responding with wooden stiffness. No calm. Only the gnawing, pervasive pain of an unbearable truth.\n\nApproximately **one hour** passes. The low hum of the *Atin Oya'ka*'s systems is the only witness to Wes's struggle. His movements, initially clumsy, slowly gain a fraction of their old precision, but the fury and sorrow remain, a tight knot in his gut.\n\nThe gym doors hiss open with a soft, almost reverent sound. Ghurn Skirata stands there, his *beskar'gam* gleaming, his helmet tucked under his arm. His face is a mask of granite, weathered and grim, but his steel-colored eyes burn with an intensity that promises no easy answers. He is a tightly coiled spring, radiating a cold, implacable fury that is almost overwhelming in its directness. He steps onto the mat, his heavy boots making no sound, his presence utterly dominating the space.","timestamp":"2026-01-07T13:17:00.058000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":50,"userName":"Storyteller"},{"id":"1458449351427887162","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Del-Fin.\"** Ghurn's voice is a low, hard rumble, cutting through the tortured silence of the gym like a vibro-blade. His gaze is fixed on Wes. **\"We need to speak.\"**","timestamp":"2026-01-07T13:17:02.059000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":51,"userName":"Ghurn Skirata"},{"id":"1458465585364078622","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"***Disbelief.***\n\n\nThoughts ran through his head as he stood there in the middle of the mat.   How could she be gone was the main one that kept creeping up.   \n\n\nQuietly he stood.  Head up, shoulders back, eyes closed as he sought to quell the building storm that was brewing inside him.  He needed to find that peace as Master Davion had always mentioned.  \n\n\nYet there was another, competing voice that offered another outlet.   *Anger.*  \n\n\nOften the voices of Chase and the Warmaster offered different things.   The two showed him differing ways of looking at the galaxy.   Often each path leads to the same outcome.   One just offered more violence.  \n\n\nFinally after 15 minutes he moved.  Initial movements were awkward and clumsy.  That only lessened the calm and fueled the anger.  The dance between the two wasn’t something new.  It was a balance.  Peace and conflict went hand in hand.   One had to deal with both to maintain the balance.  \n\n\nAt the moment peace was losing out.  \n\n\nAnother quarter hour had passed and his movements had begun to smooth out.  His anger fuelled the need to move.  To do the forms and strikes as Master Ven as instructed.  Remember the remarks Ven made when he didn’t move quite right or at the precise time.  It was more prodding to his current state and added more fuel to the fire.  Only to intertwine with the knot that had settled in his gut.   It only reminded him of the newly discovered scar that was there.  \n\n\nHe lost track of time.  The physical exertion along with the emotional swirled together as he attempted to remove the new found pain from his being.   He was close.  The exercises both physical and mental, were working.  He could hear the approving words of Master Ven and the Warmaster when he moved correctly or launched a perfect strike.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T14:21:32.531000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":53,"userName":"Wes Del-Fin"},{"id":"1458465752611815425","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Then he heard the doors hiss open.  He was almost finished and didn’t look to see who it was.   Yet he knew the presence of Ghurn Skirata.  It was unmistakable and like his own presence Ghurns was riled up as well.  His presence was unavoidable and moving closer.   \n\n\nAs he moved and spun around he saw Ghurn step on to the mat.  The Mandalorian voice was low and held an edge.  With out stopping Wes finished the final move and then stood tall as he came back to the finishing stance.  \n\n\nA few seconds passed as he closed his eyes, took a deep breath and opened himself.   He was still angry but he now had control.  \n\n\nLoosening his stance he turned towards the veteran Skirata and gave the man the respect he was due with a firm nod.   **”Then talk.”**  His voice was even and calm as the sweat ran down his forehead.   Wes looked Ghurn in the eyes, not giving any ground.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T14:22:12.406000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":55,"userName":"Wes Del-Fin"},{"id":"1458479821913980989","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Ghurn's steel-colored eyes, burning with a cold, contained fury, bore into Wes's. He takes a slow, deliberate breath, and for a long moment, the only sound in the gym is the faint hum of the ship's environmental controls and the quiet, heavy pounding of Wes's own heart. There are decades of unspoken history in that gaze, nine years of grief and a lifetime of Mandalorian resolve.\n\n**\"Marina Cloudspinner,\"** Ghurn states, his voice a low, hard rumble that reverberates in the confined space, cutting through the silence. It's not a question, but a cold, stark pronouncement of a name that is both a shared memory and a new, terrible question. He holds Wes's gaze, searching for any tell, any flicker of deceit or understanding that might give away the impossible truth now standing before him. He doesn't ask \"what do you know?\" or \"how do you know?\" The question is implicit in his very presence.\n\n**\"She said you were gone.\"** His jaw tightens, a muscle flexing under the weathered skin. **\"She was convinced. She grieved, as did we.\"** He pauses, allowing each word to sink in. His gaze drops, just for a moment, to the Del-Fin sigil on Wes's pauldron, then flicks back up, sharper than before.\n\n**\"Nine years, Del-Fin. Nine years of that truth. Now, you stand here.\"** He takes a single, deliberate step closer, his presence expanding, subtly asserting his command. **\"Explain that.\"** His voice is still low, but now edged with an steel-cold demand that cuts through the gym. **\"Start with *how* you stand here.\"**","timestamp":"2026-01-07T15:18:06.789000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":57,"userName":"Ghurn Skirata"},{"id":"1458485916674035839","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"As she walks to the cargo bay,  Eve informs her in her classic style that she had not, in fact, missed Iyola, as she was not required to do so by her programming.  Honestly, Iyola hadn’t expected anything else.\n\n**“Thanks, Eve,”  **says Iyola. **“I am noting your presence as well.  I’ll need your help with the nanite thingie in a bit.”**\n\nVekka is not pleased to see her.  She somehow was annoyed at his imperious attitude, like she deserved to be on the Venture more than he did.  She decided to have a little fun with it and assumed her best imperious attitude. She stared at Vekka coldly for a long moment, then at the droids with their blank sensors. \n\n**“Acceptable. You may proceed,”** she said loftily, turning sharply and heading toward the lounge.  \n\nOnce she’s there, she pulls out the nanite controller, following Eve’s directions for activating it.","timestamp":"2026-01-07T15:42:19.893000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":19,"userName":"Iyola Kett"},{"id":"1458508338299142415","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes stood silently as Ghurn eyed him.  He held the man’s gaze as he watched him take a slow and deliberate breath.   One like he just did.  It was an effort to find some calm.  To quell the storm that raged.  \n\n\nWhen Ghurn spoke Marina’s full name he exhaled through his nose and gave a small nod and nothing else.  No explanation.  No story.  He waited for what was to follow.  Ghurn needed answers and he knew he was going to have to ask to get them.  \n\n\nWhen Ghurn spoke he didn’t move until he said that Marina was convinced.  His cheek twitched when he said she grieved.  Again she suffered more loss convinced he was gone.  He watched as the grizzled Mandalorian looked at the Pauldron.  The sigil of his clan, Del-Fin, proudly displayed for any and all to see.  When he looked back his gaze was serious as were his words.  He wanted an explanation.  \n\n\nLittle did Ghurn know there wasn’t anyone who wanted an explanation more than he did.  \n\n\nHe stood silent for a long second as he looked into the man’s eyes.  ***On my own two feet is how I stand here.***  He thought. Yet that wasn’t what he said.  A brawl wasn’t what he was looking for   Like Ghurn he wanted answers.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T17:11:25.625000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":59,"userName":"Wes Del-Fin"},{"id":"1458508486773051547","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**”If I knew that answer I would have told Nadia not much more than an hour ago.”** He took a short breath and let it out through his nose.  **”Everything that we’ve said is fact.    I woke up with no knowledge of how I ended up in that cryo tube.    All I have as an explanation of what happened is the scar of where a lightsaber nearly ended me.  Nothing else!”**  His hand moved back to his side from the spot.  The now nine year old scar felt cold and empty.  \n\n\n**”I have no answers Ghurn.  Right now I want and wish that you have some answers for me.  I woke up missing the thing I held close to my heart. The one thing I would absolutely die for.”**  He paused as his head shook slightly from side to side.  **”The knowledge that Marina was out there still living.  One step ahead of the Empire.”**  A sharp breath was taken as his next words rolled out.  The calm he had just found was nearly breaking.  **”No matter the distance, no matter where we were, we could always sense the other.”**  \n\n\nHe shook his head as he fought back tears.  **”She’s gone and I couldn’t do anything to stop it.”**  His shoulders slumped slightly as his head dipped a bit.   **”I wish I had answers for you and the cold hard fact is…I don’t”**   He took a breath and stood tall again meeting the elder Skirata’s gaze.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T17:12:01.024000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":61,"userName":"Wes Del-Fin"},{"id":"1458515891829604434","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Ghurn watches Wes intently, his steel-colored eyes unwavering. He sees the controlled fury, the raw pain, the man standing on the edge of unraveling. He hears the frantic pace of his breath, the denial of answers he seeks, and the desperate appeal for understanding. Wes's admission of his own missing memory, of the inexplicable scar, resonates with a truth Ghurn is only just beginning to accept: the world has become stranger than he could have possibly imagined.\n\nWhen Wes speaks of Marina, of the profound, impossible bond that linked them across distances, Ghurn's jaw tightens. He hears the crushing weight of his loss, and for a fleeting, agonizing second, Ghurn relives Marina's own shattered return, her face etched with a similar, incommunicable grief. The mention of the severed bond, the Force-absence, echoes the deepest pain Marina carried.\n\nGhurn's expression, previously carved from granite, softens infinitesimally, though the underlying fury remains, transmuted from suspicion into a cold, hard resolve directed at unseen enemies. He takes another slow, deliberate step, closing the distance between them, not in aggression, but in a sudden, almost reluctant, acknowledgement of shared grief.\n\n**\"Marina suffered too much grief,\"** Ghurn states, his voice now lower, almost a murmur, but cutting through the space with the weight of absolute finality. **\"She kept too many secrets.\"** He shakes his head, the movement subtle, conveying a profound, weary sadness that momentarily cracks his stoic facade. **\"Secrets she buried deep, even from her family. Even from Storn, her husband.\"**\n\nHe lets the truth hang in the air for a moment, a new, agonizing revelation for Wes.","timestamp":"2026-01-07T17:41:26.527000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":64,"userName":"Ghurn Skirata"},{"id":"1458515897772937310","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Your bond... she *felt* it when you disappeared,\"** Ghurn continues, his gaze unwavering, dissecting Wes's raw emotion with the clinical precision of a diagnostician. **\"She believed you were killed. On Bothuwai. By an Inquisitor. The scar you carry,\"** Ghurn's gaze drops briefly to Wes's abdomen, then snaps back to his eyes, **\"it matches her account.\"** He pauses, letting the implications sink in. **\"For five years, she never stopped looking for you. Then, she returned from a mission for the Path and declared you dead. She never spoke of it again. Not to me. Not to Nadia. Not to Kiera.\"**\n\nGhurn steps back, the measured distance returning between them, but the intensity of his presence does not diminish. He folds his arms across his armored chest.\n\n**\"Nadia knows about your relationship with her mother,\"** Ghurn states, his voice regaining a fraction of its former steel. **\"She knows you are Kiera's father.\"** He pauses, then the low, hard edge returns to his voice. He gestures towards Wes, his voice raw with unspoken rage and fierce protectiveness. **\"Her world is shattered. For a second time, by your ghost. You demand answers, Del-Fin. So do I. And most of all, so does Nadia. And until she has them, until this chaos is contained, *you will not approach Kiera*. Do I make myself clear?\"**","timestamp":"2026-01-07T17:41:27.944000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":65,"userName":"Ghurn Skirata"},{"id":"1458518430364860510","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Vekka stares after Iyola, his cybernetic eye blinking in bewildered disbelief at her dismissive, imperious response. He mutters another string of agitated Rodian curses under his breath, shaking his head slightly before turning back to his console, his droids resuming their work, though their sensors now subtly track Iyola's retreating form.\n\nIyola, her chin held high, navigates the bustling cargo hold with an almost regal air, her confidence a stark contrast to Vekka's sputtering annoyance. She finds the main lounge of the *Venture* empty, quiet, and thankfully far removed from the immediate hum of Vekka's operations. The comfortable seating and serene holographic vista of Bespin's clouds await her.\n\nTaking her place on one of the plush lounge chairs, Iyola pulls out the Nanite Swarm Controller. She examines the device in her hand, recalling Eve's instructions. The complex, organic script on its dial seems to pulse faintly under the lounge's soft lighting. With a deliberate motion, she presses the central crystalline emitter.\n\nA soft, resonant hum emanates from the device, growing steadily louder. The crystalline emitter begins to glow with a gentle, internal blue light, matching the hue of Eve's avatar. A faint, almost imperceptible tremor vibrates through the tool, and through Iyola's hand, connecting her directly to the underlying systems of the *Venture*. The entire lounge seems to sigh around her, a subtle thrumming deep within the deck plates echoing the nanites stirring to life throughout the ship's ancient hull and structural matrix. The faint, internal hum she had noted earlier on the *Venture* is now much more pronounced and directly responsive.","timestamp":"2026-01-07T17:51:31.761000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":22,"userName":"Storyteller"},{"id":"1458518442759160035","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Nanite Swarm Controller operational. Localized nanite swarms are now awaiting command parameters, Iyola. Did you require immediate application, or would you prefer a review of the instructional schematics?\"** Eve's voice, emanating directly from a nearby speaker, sounds less synthetic, more attentive. The words flow with a smoother, more natural rhythm, imbued with an almost nascent curiosity.","timestamp":"2026-01-07T17:51:34.716000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":23,"userName":"Eve the AI"},{"id":"1458571015767724150","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes could feel the hard resolve to protect his own.   Yet even with the strong feelings Wes felt understanding from the man.   Yet even with that understanding Ghurn stood firm with his feelings.  Resolve in protecting family and clan.   Wes knew he could hold no grudge for that.   He would be doing the same if the roles were reversed. \n\n\nWith Ghurn now a step closer Wes listened as the man spoke.     He spoke of her suffering and secrets.   Secrets that she kept from even the closest of family.  Including her husband.   All he could do was give a small nod as the last word rolled around in his head.   *Husband.*  \n\n\nFor effect's sake or in compassion the silence dragged on for a moment after that last revelation.  As Ghurn continued he spoke of things he did not remember.   Bothuwai.  Inquisitor.  It didn’t make any sense.   Bothuwai was several hours from the drop off point of.  If not more depending on the route one took to get there.  The problem was he could remember leaving Corellia but not arriving at the drop off point.  \n\n\nBut something bothered him.  It didn’t make sense.  If she believed he was killed on Bothuwai. How did she know about the location of the scar?  His eyes narrowed but Ghurn continued without pause.  How five years passed and she never stopped looking.  But one day after a job for the Path she declared the search over.  That he was dead.  ***She ran jobs for the path too?*** The thought rolled around inside his head as Ggurn stepped back.  \n\n\nWhen Ghurn spoke again his voice was hard like earlier.  Once again setting the tone as he spoke about Nadia and Kiera.  It was then the anger and parental protectiveness flared to life.  It was then he knew the Skirata protected their own.  That was something he could respect.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T21:20:29.098000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":67,"userName":"Wes Del-Fin"},{"id":"1458571118481903628","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"He took a breath and then calmly took a half step forward.  Much like Ghurn had done to him.   Having brought his anger under control his voice was even.  **”Yes I want answers just like you.  I need answers.  Somehow, someway I need to have an understanding of what and why all this has happened.  The probability of crossing paths with Nadia nine years after…”** He paused looking for the word but settled for the obvious one.  **”Dying, I can’t even comprehend the odds.”** Frustration was evident in his voice.  \n\n\nHis armored chest rose as he took a deep breath.   **”Ghurn, I’m not here to cause grief and strife for you and your family.  Something happened to me. Something happened to all of us.”** He said his voice raising slightly as he gestured to the common area where he left Iyola and Varda.  **”I want answers just as badly as you do.   One of the things you’ve just said has sparked questions.”**  He paused for a second, not giving Ghurn time to answer.  **”And as far as Kiera goes…”** His voice faltered slightly.  **”I never knew.   If I had…”** He shook his head..l  He felt his ire rising and stepped back composing himself again.  **Nothing would have kept me away.   I’ll abide by your wishes about Kiera.”**  He paused as he thought, a slight chuckle sounded out from him.  It was honest sounding and not disrespectful.  **”But if she’s anything like her mother what makes you think she will abide by that?”**\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-07T21:20:53.587000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":69,"userName":"Wes Del-Fin"},{"id":"1458584827875037285","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola sat in a blob-shaped chair.  It was so soft that she sank into it until her boots were almost touching the group.  She lay back in satisfaction.\n\n**“Why don’t you give me a review of the schematics first,”** she said, eyeballing the scanner. The Venture seems to hum in anticipation.  She wonders if Eve is vulnerable to the nanites - not that she would do anything to Eve, but it might be amusing to play a prank on her.","timestamp":"2026-01-07T22:15:22.161000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":25,"userName":"Iyola Kett"},{"id":"1458590436045357230","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Commencing review of Nanite Swarm Controller instructional schematics. Visual display directed to the nearest suitable surface,\"** Eve's voice states. A section of the sleek, dark wall paneling directly opposite Iyola's chair flickers, then illuminates, becoming a high-resolution holographic screen. Detailed schematics of the *Venture*'s hull and internal conduits begin to scroll across it, interspersed with magnified, almost microscopic, views of the nanite swarms at work. Explanatory text in crisp Aurebesh accompanies each image, detailing the 'deconstruct,' 'construct,' and 'bond' functions, complete with examples of appropriate command parameters and safety warnings regarding \"collateral structural instability\" and \"unintended material transfiguration\" from improper use.\n\nAs the schematics scroll, Eve's voice continues, providing a concise, guided explanation. **\"The nanites are integrated at a sub-structural level. Optimal repair for micrometeoroid damage, such as the breaches in Engineering Junction Beta-4, requires a 'bond' command, targeting specific metallic compositions. Structural reinforcement utilizes a 'construct' parameter, drawing upon localized atmospheric particles or raw material repositories within the immediate environment. 'Deconstruct' operations are primarily for salvage, material harvesting, or clearing severe obstruction.\"**","timestamp":"2026-01-07T22:37:39.253000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":27,"userName":"Eve the AI"},{"id":"1458602917899796725","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Ghurn watches Wes closely, his steel-colored eyes assessing every subtle tremor of emotion, every deliberate action. He sees the pain, the raw disbelief, the burning frustration. Wes's acceptance of his terms regarding Kiera, albeit with a Mandalorian's pragmatic question about her likely defiance, triggers a subtle shift in Ghurn's posture. The tightly coiled fury begins to unwind, replaced by a deep-seated weariness that momentarily cracks his stoic façade. The initial, desperate need to protect his own begins to blend with the sheer, monumental scale of the new questions Wes's presence has unearthed.\n\nHe takes a slow, deep breath, letting the tension seep from his shoulders as he takes a step back, his arms dropping to his side. The memory of Marina, vibrant, and defiant, weighs heavily upon him.\n\n**\"Very well,\"** Ghurn murmurs, his voice regaining a semblance of its usual low rumble. **\"You abide by my wishes concerning Kiera. For now. That gives us a chance. And yes,\"** his gaze, though still intense, is now one of alliance rather than accusation. **\"We *all* have questions. Many of them. \"**\n\nHe turns slightly, gesturing towards the entrance to the gym. **\"Nadia… she carries many burdens, but also many strengths. Some of them... unexpected. She has a knack, when she's lucid and focused, for cutting through the static in a mind. For drawing out lost memories, or even the subtle nuances of events that are otherwise unclear.\"** Ghurn pauses, choosing his words carefully, omitting the more forceful applications of Nadia's empathy. **\"When she has recovered sufficiently, her unique abilities may be of assistance to us all. Especially in piecing together the events of your missing time, and the circumstances surrounding your… *death* on Bothuwai.\"**","timestamp":"2026-01-07T23:27:15.159000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":71,"userName":"Ghurn Skirata"},{"id":"1458611666844520449","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola watches the holographic demonstration from Eve.  This looks incredibly interesting.  It occurs to her that the bond function would be very helpful for Vekka. *Could she make a deal with the Skiratas?* She put that notion aside for the time being.\n\n**“So how exactly does the construct work?  Do I have to deconstruct something first?” ** Iyola points at a nearby bench.**  “Could I just deconstruct that and construct it into something else?  How do I tell it to stop?”**","timestamp":"2026-01-08T00:02:01.070000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":29,"userName":"Iyola Kett"},{"id":"1458615856866136105","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Construct parameters require a source of raw material, Iyola,\"** Eve explains patiently, the holographic schematic of a molecular breakdown appearing on the wall panel. **\"While a nearby bench *could* be subjected to a 'deconstruct' command, providing the necessary constituent elements, this would result in an irreversible structural alteration. The nanites do not discriminate between functional and non-functional components once a 'deconstruct' parameter is initiated. Any material can be transformed, but the process is not 'undoable' in the conventional sense.\"**\n\nA detailed diagram illustrating the precise, spoken, or mental command structure for nanite operations then overlays the previous schematics. **\"Nanite operations cease upon receipt of a 'stop' command, either verbally issued by a designated operator or via a cessation of directed focus through the controller. Additionally, operations will automatically cease if energy reserves are depleted or if a critical structural instability threshold is detected within the operational zone.\"** Eve's voice retains its emergent attentiveness, a faint current of curiosity underlying her technical explanation.","timestamp":"2026-01-08T00:18:40.049000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":31,"userName":"Eve the AI"},{"id":"1458907937455210712","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola thought about what Eve had said.  **“Do you have a particular attachment to this bench?”  **she asked.  **“I’m just looking for something to experiment with before I start using the nanites on the engines and outer hull.  Any other suggestions?”**\n\nShe glanced around.   **“Do the nanites only work on - inorganic material?”**","timestamp":"2026-01-08T19:39:17.488000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":33,"userName":"Iyola Kett"},{"id":"1458922961162600522","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes looked at Ghurn and nodded.  The grizzled man’s face and presence had shifted.  He sensed a growing feeling of acceptance and alliance as the earlier feelings of distrust and accusation diminished.   That Ghurn still had questions was good.   It meant that he too would also seek to find answers.  He felt that he was going to need all the help he could get.  Not just for himself but the others as well\n\n\nWith a nod Wes he’d out his hand.  The initial distrust had been settled.  Now it was time to build trust.  **”Thank you Ghurn.  Together we’ll figure this out.”**  Wes was thankful that the veteran leader had come around slightly.   Having the opposite happen would have been unfortunate. \n\n\nReleasing Ghurn’s forearm he took a breath.  He had a question.  Something that was said about Marina and his death.  He needed to be clear he understood it.  \n\n\n**”Ghurn, I have a question.  It’s been bouncing around in my head since you mentioned Bothuwai.”**  His eyes left Ghurn as he thought back for a moment.   **”How did Marina know I *died* on Bothuwai and by an inquisitor no less?  How did she know about the scar?**”  He paused.  **”Where was she nine years ago when she sensed I disappeared?”**  He looked back at Ghurn.  His eyes questioning now that he was thinking from a different angle.  **”I worked alone.  So do the Inquisitors.”** He shook his head.   **”Who’s account did she get?”**  His chest rose as he took a deep breath.  **”You said she worked for the Path.”**  He looked into Ghurn's eyes looking for anything that might be a tell.  **”The job I was on when all this happened,”**  He took a breath and let it out.  **”Was for the Path.”**\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-08T20:38:59.419000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":73,"userName":"Wes Del-Fin"},{"id":"1458961819459649591","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Ghurn meets Wes's extended hand with a firm, solid grip, the Mandalorian gesture sealing their fragile alliance. His gaze is direct, unwavering. **\"Indeed, Del-Fin. We will.\"** He lets go of Wes's arm as the questions, sharp and precise, cut through the space between them. The queries about Bothuwai, Marina's knowledge of the scar, and her apparent omniscience regarding his \"death\" cause Ghurn to rub his beard thoughtfully, his steel-gray eyes distant, sifting through memories.\n\n**\"Marina was... discreet about her operations.,\"** Ghurn states, his voice low, a note of weariness in it. **\" She rarely shared sources. Especially for the Path. Secrecy, you understand, was survival.\"** He pauses, his gaze unfocusing for a moment as he recalls the grim aftermath.\n\nGhurn rubs his beard again, a long, weary sigh escaping him. **\"She was gone for a period. Longer than usual, two, maybe three weeks. She had a habit of disappearing if she felt a mission was compromised, to ensure no Imperial trails led back to us. But this time... when she returned, she was haggard. Tired. Wounded.\"** He shakes his head. “**She had broken her arm, I remember that. A mission gone sideways, she called it. A brutal confrontation.**”\n\n**\"Her account of Bothuwai was... a report,\"** Ghurn continues, his brow furrowing as he struggles to reconstruct the exact details. **\"She gave no specifics of how she gained the intel beyond that, Del-Fin. She never did. She merely relayed the facts as she believed them. That you engaged an Inquisitor. That you died on Bothuwai. And yes,\"** his voice hardens with a grim finality, **\"that you bore a lightsaber wound to the abdomen.\"**\n\nGhurn meets Wes's gaze, a profound, unsettling new understanding dawning in his eyes, now sharper, more alert than before. **\"If your mission was also for the Path, and coincided with hers...\"** He doesn't finish the thought, but the implication hangs heavy in the air.","timestamp":"2026-01-08T23:13:23.959000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":75,"userName":"Ghurn Skirata"},{"id":"1458963246986956830","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"My operational parameters do not include 'attachment' to inanimate objects, Iyola,\"** Eve states, her voice calm, a slight delay suggesting a subtle processing of the non-literal query. **\"The bench is a structural component. Its integrity is less critical to the *Venture*'s overall functionality than primary propulsion or life support systems.\"**\n\nA moment passes as Eve synthesizes additional data. **\"For safe, non-critical experimentation, a supply of discarded, inorganic waste material is optimal. There are designated 'salvage hoppers' in the aft section of the cargo bay that contain various metal alloys and synth-composites awaiting recycling. These would provide a suitable and controlled environment for material manipulation.\"**\n\nShe pauses, then her tone shifts subtly, an almost academic interest entering her voice. **\"Regarding material parameters: nanite swarms are designed for the manipulation of both inorganic and organic matter at a cellular and molecular level. The theoretical applications are extensive, spanning material fabrication, bio-regeneration, and atmospheric conditioning. However, non-authorized alteration of organic matter is outside my current operational directives and would require specific, 'Protector Level' authorization.\"** Her voice drops a fraction, returning to its default calm, yet the brief mention of organic manipulation carries a chilling undertone.","timestamp":"2026-01-08T23:19:04.308000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":35,"userName":"Eve the AI"},{"id":"1458993332347994117","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"She liked to think that she was affecting Eve a little bit.  Eve was definitely trying to remain polite and dismissive, but her cool, mechanical voice held a hint of interest, or confusion.\n\nIyola thought back to the cargo bay.  **“So, Vekka made it very clear that my presence in the cargo bay was unwelcome,”**  she said. **“Unless you want to tell him otherwise, I’m starting with this bench.”**\n\nShe holds out the transmitter, trying to mentally connect with it or whatever she’s supposed to do. “**Do I touch the bench, or what? I assume I’m an approved user by now, right?”**","timestamp":"2026-01-09T01:18:37.217000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":37,"userName":"Iyola Kett"},{"id":"1459038566557421580","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes watched and listened as Ghurn spoke.  Spoke about the woman he once knew.  There was clear affection, almost family-like.  How she had secrets and some missions kept her away for longer periods.  It seemed like the Empire was still a major thorn in the galaxy's side.  \n\n\nHis accounting of Marina’s return from a mission gone sideways was chilling.  A broken arm from a brutal confrontation.   A mission gone ”sideways.”    \n\n\nWes felt the shifting changes in the Force as Bothuwai was mentioned.   Ghurn recounts Marina’s report of his encounter with an Inquisitor and how he died from a lightsaber wound.   When the leader of Kando's Coursers stopped and thought for a moment, Wes felt a shift in Ghurn’s presence as the Mandalorian’s eyes opened from a different point of view.  \n\n\nWes nodded he didn’t know what to think.  He had no memory of Bothuwai.  No memory of a life and death battle with an Inquisitor.  All they had between them was an account from Marina who also suffered from a broken arm while also on a mission for the Path.   It was thin but it was something.   **”Ghurn,”**  He paused as he ran a hand up over his short hair.  **”What if,”**  He paused again as he struggled to say what he was thinking.  **”What if she *was* there?”**\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-09T04:18:21.893000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":77,"userName":"Wes Del-Fin"},{"id":"1459174179885547521","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Ghurn meets Wes's gaze, his steel-colored eyes narrowing slightly at the question. The gym, once a place of violent physical release, now feels charged with a different kind of tension, a quiet hum of profound, unsettling questions. Ghurn rubs his beard thoughtfully, sifting through memories. The idea, once unspoken, now voiced by Wes, casts a new, disturbing light on Marina's grim return.\n\n**\"Marina was resourceful. And incredibly capable,\"** Ghurn states, his voice low, almost contemplative, echoing with pride and a subtle hint of unease. He pauses, his gaze distant, seeing not Wes, but a ghost from his past, a sister-in-arms now draped in shadows. **\"Her missions for the Path were often... high risk. She went where others would not. Saw things others could not.\"** He doesn't dismiss the possibility outright, but his pragmatic mind also grapples with its implications. **\"But if she *was* there... if she saw it with her own eyes... why declare you dead, Del-Fin? Why carry that burden for nine years, never speaking of the true circumstance of your disappearance to her family, even to Kiera? That part... that does not make sense.\"** The question is rhetorical, filled with a deep, personal ache of confusion and an overriding sense of the immense, inexplicable weight Marina must have carried, not aimed at Wes, but at the monumental secret itself.","timestamp":"2026-01-09T13:17:14.630000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":79,"userName":"Ghurn Skirata"},{"id":"1459174314866769950","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Eve the AI","avatar":"7600cdc7ae2c3d48b77801931cc9687c","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"**\"Your designation as crew, Iyola, grants you priority operational authority over vessel systems,\"** Eve states, her voice perfectly placid. A subtle, internal processing seems to accompany the words, a micro-calculation of shifting hierarchies. **\"Kando's Coursers' technical personnel, while *authorized* for maintenance, operate under my delegated authority, and by extension, yours. The only one who would be able to override such authority would be the designated Captain.\"** A faint, almost imperceptible emphasis rests on the word 'authorized.'\n\nEve's voice then shifts, addressing Iyola's direct question regarding the nanite tool. **\"To initiate a command, physical contact with the target object is not strictly necessary. The Wrangler-Series Maintenance Tool utilizes a short-range, resonant energy field. Direct proximity to the desired target, combined with your conscious mental or verbal command transmitted through the tool, is sufficient. Yes, as a member of the crew, you are a designated user.\"**\n\nShe pauses, and a barely perceptible current of something akin to subtle amusement enters her tone, a new layer to her evolving personality. **\"Regarding Chief Vekka's... 'disposition' towards unauthorized personnel: Should you demonstrate the tool’s efficacy and your own immediate utility within his current operational field, I am confident he will cease his prior objections. His operational parameters prioritize resource acquisition for repairs.\"**","timestamp":"2026-01-09T13:17:46.812000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":39,"userName":"Eve the AI"},{"id":"1459193035840684125","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes could feel the subtle shifts within Ghurn.  Things that were once certain now maybe had a small sense of doubt and question.  What certainly wasn’t helping was the hole in his memory.  He was beginning to question just how long the memory lapse was.  He doubted it was hours.   Weeks or maybe somewhere in between.  \n\n\n***Too many questions.***  He thought as the list just kept growing.  \n\n\nGhurn vocalized his own thoughts.  Like himself he had no answers.  Only more questions that needed answers.  Then maybe, maybe they could make sense of it all.  Then things could be put to rest.  Then the  memory of the woman they all cared for and loved could be remembered the way it needed to be.  \n\n\n**”I don’t know and you are right.  This doesn’t make any sense.  For some reason the Force has tied all of us together and it started twenty years ago.  It will take time and some help but eventually we will unravel the threads and lay the truth bare.”**  He gave the veteran and leader of Kando Coursers a reassuring nod.   **”And Vod, I’m glad we’re working together and not against each other.  Family no matter how they are tied together, stand together.”**\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-09T14:32:10.240000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":81,"userName":"Wes Del-Fin"},{"id":"1459229808775921841","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Ghurn Skirata","avatar":"f989e92be7283fa85c0e66fabffbdf2e","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Ghurn watches Wes, his steel-gray eyes, though still clouded with confusion, now holding a glimmer of acceptance. The outright declaration that the Force has intertwined their fates, a Force that Ghurn's pragmatic Mandalorian worldview has long viewed with cautious skepticism, strikes him with a new, unsettling weight. He doesn't dismiss it. Wes's conviction is too strong, his raw pain too undeniable.\n\nGhurn offers a curt, almost imperceptible nod, a silent acknowledgement of the profound truth in Wes's words. The phrase \"family, no matter how they are tied together, stand together\" resonates deep within his Mandalorian core, cutting through the layers of deceit and mystery with the bedrock principle of clan loyalty.\n\n**\"Indeed, Del-Fin. Indeed,\"** Ghurn rumbles, his voice low and firm, now imbued with a quiet resolve that mirrors Wes's own. \n\nHe takes a deep breath, and his gaze softens, a profound weariness visible in the lines around his eyes. **\"We will find our answers, Del-Fin. Together. For Marina. For Nadia. And for Kiera.\"** With a final nod, he pivots and walks with a determined stride towards the gym doors, leaving Wes with the unspoken weight of a newly forged alliance and the promise of answers.","timestamp":"2026-01-09T16:58:17.591000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":83,"userName":"Ghurn Skirata"},{"id":"1459238725413245142","channel_id":"1457878207498817734","author":{"id":"1436384190198448270","username":"Wes Del-Fin","avatar":"cbee4aafbd327114fe0dc7c3fe97725d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wes felt the subtle and bedrock resolve that Ghurn held for family and clan.  It was one thing they both felt strongly about.  He gave him a nod as he mentioned finding answers for three people they both felt strongly about.   He knew he was still an outsider.  That trust was earned and not just given.  He felt that the path had been laid out and had a solid foundation.   Family, if lucky, provided that solid foundation.   \n\n\nHe watched as Ghurn nodded and turned to leave.   Before he reached the doors Wes called out as he picked up his own helmet.  **”Ghurn do me a favor.”**  He paused as he waited for the Mandalorian to turn back.  **”Tell them both that there is no rush.  When they are ready they will know.  Until then we look for answers and carry on.”**   He almost finished with ***As normal,*** but nothing about the situation was normal.   He watched as Ghurn gave him a final nod before turning and exiting the training room.   \n\n\nAs the door closed he took a deep breath and let it out.\n` `                              <:fett:1287130263851368489> Helmet off [✎](<https://github.com/alicia86/SW_ForgottenOnes/wiki/Wes-Del-Fin>)","timestamp":"2026-01-09T17:33:43.483000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":85,"userName":"Wes Del-Fin"},{"id":"1459347413037875201","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Wait - is Eve saying that she outranks Vekka?  The thought makes her laugh out loud.  If she didn’t know better, she’d say that the impassive AI was actually encouraging her to flout Vekka’s supposed authority.  Iyola likes this idea very much. \n\n** “Thank you, Eve.  That is the nicest thing you have ever said to me, ” **responds Iyola.  **“I think I will do as you suggest.” **\n\nShe saunters back to the cargo bay.  Vekka is still there, looking no friendlier than he did before. Iyola nods to him, ignores the droids, then walks over to the recycling area  She runs her fingers lightly over the transmitter. *Let’s start a little light deconstruction! *","timestamp":"2026-01-10T00:45:36.632000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":41,"userName":"Iyola Kett"},{"id":"1459416959593615433","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Storyteller","avatar":"b8ff56e6117f4cd57f52136a4c89f939","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Vekka stiffens instantly as Iyola reappears in the cargo bay, his cybernetic eye narrowing with renewed suspicion. His Rodian muttering takes on a sharper, more agitated cadence, clearly expressing displeasure at her return. He shoots a quick, wary glance towards his maintenance droids, who subtly adjust their scanning arrays towards the newcomer. His entire demeanor radiates barely suppressed irritation.\n\nIyola, a mischievous glint in her eyes, deliberately ignores Vekka's hostile signals. With a cheerful, defiant air, she approaches one of the designated salvage hoppers. It's a large, reinforced bin, half-filled with various pieces of mangled metal, snapped conduits, and discarded synth-composites from earlier repair efforts—precisely the \"inorganic waste material\" Eve suggested.\n\nShe takes out the Nanite Swarm Controller. The crystalline emitter glows with a soft, internal blue light, pulsing gently in her hand, connecting her directly to the ship's underlying nanite systems. Her fingers brush lightly against the cold, dull metal of a particularly twisted piece of scrap within the hopper. She concentrates, focusing her will.\n\n\"**Deconstruct!**\" Iyola commands, her voice a low, almost conspiratorial whisper, but with a clear intent that resonates with the humming device in her hand.\n\nImmediately, a localized hum emanates from the hopper, growing in intensity. The twisted scrap metal beneath her touch begins to shimmer and blur at its edges. A fine dust, like iridescent motes of pulverized metal, visibly floats up from its surface, coalescing into a swirling, silvery cloud of liquid metal. The process is precise, controlled, and utterly silent save for the low, focused hum. The twisted scrap visibly shrinks, its bulk rapidly diminishing as its molecular bonds are effortlessly disassembled by the unseen nanite swarm.","timestamp":"2026-01-10T05:21:57.823000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":43,"userName":"Storyteller"},{"id":"1459595663284375781","channel_id":"1458169536749633690","author":{"id":"1436384190198448270","username":"Iyola Kett","avatar":"8aaf30acf87729c106409bc1edc02a6d","discriminator":"0000","public_flags":0,"flags":0,"bot":true,"global_name":null,"clan":null,"primary_guild":null},"content":"Iyola watches in fascination as the nanites effortlessly disassemble a few stray chunks of scrap, transforming them into a spiral of glittery dust.  The vibration of the nanites thrums around her -   -  it’s like she senses them in her head too.  Is this what using the Force feels like?  \n\nWell, disassembly is one thing - assembly is another.  Eve wasn’t super-clear on what that involved.  Iyola images the most obscene hand gesture she can and describes it to the nanites while picturing it in her head.  Her artistry is interrupted by a message on her commlink - it’s from Serena. The briefing is about to begin.\n\nShe finishes up as best she can.  It just ends up looking like a blob with spikes, but at least she hasn’t disassembled the ship.  **“Stop,”** she says.   The nanines subside. She needs more practice. She dumps the metal shape on the deck and heads back to the Atin Oya’ka.","timestamp":"2026-01-10T17:12:04.103000+00:00","edited_timestamp":null,"tts":false,"mention_everyone":false,"mentions":[],"attachments":[],"embeds":[],"pinned":false,"webhook_id":"1436384190198448270","type":0,"application_id":"644942473315090434","flags":0,"components":[],"position":45,"userName":"Iyola Kett"}]